[
    {
        "title": "Learnpoint",
        "url": "/index.html",
        "content": "Sign in Logga in Learnpoint Learnpoint Integrated LMS and SIS Integrerad lärplattform och skoladministration Create programmes, write announcements, enroll students, hand out assignments, and assess student work. All in one place. Skapa utbildningar, registrera studenter, dela ut uppgifter, skriv nyheter, och betygsätt studenter. Allt på ett ställe. Announcements Nyheter Write announcements to all students in a group or course. An efficient way to communicate information. Skriv nyheter till alla studenter i en klass eller kurs. Ett effektivt sätt att förmedla information. Assignments Uppgifter Create and hand out assignments. You can sort the assignments into sections to give the course a clear structure. Skapa och dela ut uppgifter. Du kan sortera uppgifterna i avsnitt för att ge kursen en tydlig struktur. Grading Betyg You can grade both courses and assignments. Each course has a comprehensible grading overview. Du kan betygsätta både kurser och uppgifter. I varje kurs finns en överskådlig sammanställning. Want to know more? Vill du veta mer? Would you like a demo, ask a question, or perhaps just talk to us? We'd be happy to hear from you. Vill du se en demo, ställa en fråga, eller kanske bara prata? Hör gärna av dig. Write to us at info@learnpoint.se Skriv till info@learnpoint.se Learnpoint is developed by ViaEcole Learnpoint är utvecklat av ViaEcole Work at Learnpoint Lediga tjänster English | Svenska"
    },
    {
        "title": "Designer - Learnpoint",
        "url": "/jobs/2021\\02\\designer.html",
        "content": "Sign in Logga in Designer Learnpoint is an integrated LMS and SIS made for teachers, students, administrators, and schools. The Learnpoint team is on a mission to simplify education and we're now hiring a full time designer. About the Job Om tjänsten Design is often split into many different roles such as UI, UX, frontend developement, and so on. At Learnpoint, it's all one role. We believe the best designs come from someone who is involved at every step from idea and research to finished product. This means that designers at Learnpoint are generalists. They are projects managers, visual designers, writers, researchers, developers, and more. You'll spend most of your time designing the product Learnpoint. But occasionally you'll be working on other products, tools, and sites that's part of the company. The day-to-day work varies a lot. During our six week work cycles, we mainly focus on designing and building new features. But as a designer, you'll also be working on bug fixes, adjustments, and minor improvements. Between each development cycle, we spend two weeks doing free research. You can read, design games, take a course, or anything else that will advance your design mastery. The team don't share an office, so everyone works remotely. You can work from home, rent an office, or whatever works best for you. Where, when, and how you work is up to you. Making a career at Learnpoint does not mean giving up on your craft. As you become better at design, you'll advance from junior designer to designer, and then from senior designer to lead designer, and so on. There are five levels of design mastery in total. The salary for a junior designer is 31416 SEK. About You Om dig You are truly interested in design, but perhaps even more interested in humans. How do humans think, how do they learn, what makes them happy? You understand that good design is as much about pixels, as it is about human perception, cognition, and culture. You believe that design is about improving the life for others. You are interested in results and answers, but even more interested in questions. You are curious to the bone and you love learning. You understand that there is no prescription for designing an easy-to-use feature, but you're eager to figure it out. You believe that nothing interesting starts with knowing. It starts with not knowing - it starts with a question. You are proficient in HTML, CSS, and JavaScript. And you love writing. You understand that words matters just as much as colors and spacing. How to Apply Sök jobbet Write an application where you tell us about yourself and describe how you could contribute in our mission to simplify education. Send your application to karl.west@viaecole.se Learnpoint is developed by ViaEcole Learnpoint är utvecklat av ViaEcole Work at Learnpoint Lediga tjänster English | Svenska"
    },
    {
        "title": "Work with us - Learnpoint",
        "url": "/jobs/index.html",
        "content": "Sign in Logga in Work at Learnpoint Lediga tjänster Designer Permanent Full time Remote Fast anställning Heltid Distans Learnpoint is developed by ViaEcole Learnpoint är utvecklat av ViaEcole Work at Learnpoint Lediga tjänster English | Svenska"
    },
    {
        "title": "Sign in - Learnpoint",
        "url": "/sign-in.html",
        "content": "Sign in Logga in Sign in Logga in Enter the Learnpoint address for your school. Skriv in Learnpoint-adressen till din skola. Couldn't find the school. Check the address. Hittade inte skolan. Kontrollera adressen. Enter the Learnpoint address Ange Learnpoint-adressen school-name Continue Fortsätt Trouble signing in? We'd be happy to help. Problem att logga in? Vi hjälper gärna till. Previous sign ins Tidigare inloggningar Learnpoint is developed by ViaEcole Learnpoint är utvecklat av ViaEcole Work at Learnpoint Lediga tjänster English | Svenska"
    }
]