[
    {
        "title": "Learnpoint",
        "url": "/index.html",
        "content": "Sign in Logga in Learnpoint Learnpoint Integrated LMS and SIS Integrerad lärplattform och skoladministration Create programmes, write announcements, enroll students, hand out assignments, and assess student work. All in one place. Skapa utbildningar, registrera studenter, dela ut uppgifter, skriv nyheter, och betygsätt studenter. Allt på ett ställe. Announcements Nyheter Write announcements to all students in a group or course. An efficient way to communicate information. Skriv nyheter till alla studenter i en klass eller kurs. Ett effektivt sätt att förmedla information. Assignments Uppgifter Create and hand out assignments. You can sort the assignments into sections to give the course a clear structure. Skapa och dela ut uppgifter. Du kan sortera uppgifterna i avsnitt för att ge kursen en tydlig struktur. Grading Betyg You can grade both courses and assignments. Each course has a comprehensible grading overview. Du kan betygsätta både kurser och uppgifter. I varje kurs finns en överskådlig sammanställning. Want to know more? Vill du veta mer? Would you like a demo, ask a question, or perhaps just talk to us? We'd be happy to hear from you. Vill du se en demo, ställa en fråga, eller kanske bara prata? Hör gärna av dig. Write to us at info@learnpoint.se Skriv till info@learnpoint.se Learnpoint is developed by ViaEcole Learnpoint är utvecklat av ViaEcole English | Svenska"
    },
    {
        "title": "Work with us - Learnpoint",
        "url": "/jobs/index.html",
        "content": "Sign in Logga in Work at Learnpoint Jobba hos oss Learnpoint is developed by ViaEcole Learnpoint är utvecklat av ViaEcole English | Svenska"
    },
    {
        "title": "Sign in - Learnpoint",
        "url": "/sign-in.html",
        "content": "Sign in Logga in Sign in Logga in Enter the Learnpoint address for your school. Skriv in Learnpoint-adressen till din skola. Couldn't find the school. Check the address. Hittade inte skolan. Kontrollera adressen. Enter the Learnpoint address Ange Learnpoint-adressen school-name Continue Fortsätt Trouble signing in? We'd be happy to help. Problem att logga in? Vi hjälper gärna till. Previous sign ins Tidigare inloggningar Learnpoint is developed by ViaEcole Learnpoint är utvecklat av ViaEcole English | Svenska"
    }
]