[
    {
        "title": "Learnpoint",
        "url": "/index.html",
        "content": "Sign in Logga in Learnpoint Learnpoint Integrated LMS and SIS Integrerad lärplattform och skoladministration Create programmes, write announcements, enroll students, hand out assignments, and assess student work. All in one place. Skapa utbildningar, registrera studenter, dela ut uppgifter, skriv nyheter, och betygsätt studenter. Allt på ett ställe. Announcements Nyheter Write announcements to all students in a group or course. An efficient way to communicate information. Skriv nyheter till alla studenter i en klass eller kurs. Ett effektivt sätt att förmedla information. Assignments Uppgifter Create and hand out assignments. You can sort the assignments into sections to give the course a clear structure. Skapa och dela ut uppgifter. Du kan sortera uppgifterna i avsnitt för att ge kursen en tydlig struktur. Grading Betyg You can grade both courses and assignments. Each course has a comprehensible grading overview. Du kan betygsätta både kurser och uppgifter. I varje kurs finns en överskådlig sammanställning. Want to know more? Vill du veta mer? Would you like a demo, ask a question, or perhaps just talk to us? We'd be happy to hear from you. Vill du se en demo, ställa en fråga, eller kanske bara prata? Hör gärna av dig. Write to us at info@learnpoint.se Skriv till info@learnpoint.se Learnpoint is developed by ViaEcole Learnpoint är utvecklat av ViaEcole Work at Learnpoint Lediga tjänster English | Svenska"
    },
    {
        "title": "Documents",
        "url": "/jobs/2021/02/design-challenge-code.html",
        "content": "Design Challenge Code"
    },
    {
        "title": "Design Challenge - Learnpoint",
        "url": "/jobs/2021/02/design-challenge.html",
        "content": "Sign in Logga in Design Challenge Only for selected people. This challenge will take some time. Introduction Overview description How the document feature work Problem definition - no structure Your assignment Evaluation How to hand in. What to hand in. Deadline Download the code Learnpoint is developed by ViaEcole Learnpoint är utvecklat av ViaEcole Work at Learnpoint Lediga tjänster English | Svenska"
    },
    {
        "title": "Designer - Learnpoint",
        "url": "/jobs/2021/02/designer.html",
        "content": "Sign in Logga in Designer Learnpoint is an integrated LMS and SIS made for teachers, students, and school managers. The Learnpoint team is on a mission to simplify education and we're now hiring a full time designer. Learnpoint är ett integrerat LMS och administrativt system för lärare, studenter, och skolledare. Vår mission är att förenkla utbildning och nu har vi en ledig tjänst som designer. About the Job Om tjänsten Design is often split into many different roles such as UI, UX, frontend developement, and so on. At Learnpoint, it's all one role. We believe the best designs come from someone who is involved at every step from idea and research to finished product. Design är ofta uppdelat i olika roller som UI, UX, frontend utveckling, och så vidare. Hos oss ligger alla dessa i en och samma roll. Vår övertygelse är att riktigt bra design bygger på ett djupt engagemang i alla aspekter av designprocessen. This means that designers at Learnpoint are generalists. They are projects managers, visual designers, writers, researchers, developers, and more. Hos oss är designers generalister. Dom leder projekt, skriver, skissar, bygger prototyper, implementerar design, och så vidare. You'll spend most of your time designing the product Learnpoint. But occasionally you'll be working on other products, tools, and sites that's part of the company. Största delen av arbetet ägnas åt produkten Learnpoint. Men ibland kommer du jobba med andra produkter, verktyg, och webbsidor som finns inom ramen för bolagets verksamhet. The day-to-day work varies a lot. During our six week work cycles, we mainly focus on designing and building new features. But as a designer, you'll also be working on bug fixes, adjustments, and minor improvements. Between each development cycle, we spend two weeks doing free research. You can read, design games, take a course, or anything else that will advance your design mastery. Det dagliga arbetet varierar mycket. Under våra sex veckors utvecklingsperioder jobbar vi främst med nyutveckling. Men som designer hos oss kommer du även jobba med buggfixar, justeringar, och små förbättringar. Mellan varje utvecklingsperiod har vi två veckors fritt arbete. Du kan läsa, designa spel, gå en kurs, eller vad som helst som utvecklar din designkompetens. The team don't share an office, so everyone works remotely. You can work from home, rent an office, or whatever works best for you. Where, when, and how you work is up to you. Vi har inget gemensamt kontor, så alla jobbar på distans. Du kan jobba hemifrån, hyra en kontorsplats, eller hitta på något annat. Var, hur, och när du jobbar är upp till dig. The job is permanent and full time. Tjänsten är fast och på heltid. Making a career at Learnpoint does not mean giving up on your craft. As you become better at design, you'll advance from junior designer to designer, and then from senior designer to lead designer, and so on. There are five levels of design mastery in total. En karriär hos oss innebär inte att du kommer lämna ditt yrke som designer. När du utvecklar din kompetens kommer du befordras från junior designer till designer, och sedan från senior designer till lead designer, och så vidare. Det finns totalt fem karriärssteg. The salary for a junior designer is 31 416 SEK. Lönen för en junior designer är 31 416 SEK. About Us Om oss Learnpoint is part of the edtech company ViaEcole. We're a customer focused company with two products — Learnpoint and yh-antagning.se. Learnpoint är en del av edtech bolaget ViaEcole. Vi är ett kundorienterat bolag med två produkter — Learnpoint och yh-antagning.se. About You Om dig You are truly interested in design, but perhaps equally interested in humans. How do humans think, how do they learn, what makes them happy? You understand that good design is as much about pixels, as it is about human perception, cognition, and culture. Du är genuint intresserad av design, men kanske minst lika intresserad av människor. Hur tänker dom, hur lär dom sig, och vad gör dom lyckliga? Du förstår att bra design handlar lika mycket om pixlar som om perception, kognition, och mänsklig kultur. You believe that design is about improving the life for others. Du tror på att design handlar om att förbättra andra människors vardag. You are interested in results and answers, but even more interested in questions. You are curious to the bone and you love learning. You understand that there is no prescription for designing an easy-to-use feature, but you're eager to figure it out. You believe that nothing interesting starts with knowing. It starts with not knowing — it starts with a question. Du är intresserad av resultat och svar, men kanske ännu mer intresserad av frågor. Du är genuint nyfiken och älskar lärande. Du förstår att det inte finns något färdig recept för att designa lättillgängliga produkter, men du drivs av att ta reda på hur man gör. Du tror på att inget intressant börjar med att veta. Det börjar med att inte veta — det börjar med en fråga. You are proficient in HTML, CSS, and JavaScript. And you love writing. You understand that words matters just as much as colors and spacing. Du behärskar HTML, CSS, och JavaScript. Och du gillar att skriva. Du förstår att ord spelar lika stor roll som pixlar och färger. How to Apply Sök jobbet Write an application where you tell us about yourself and describe how you could contribute in our mission to simplify education. Send your application to karl.west@viaecole.se Skriv en ansökan där du berättar om dig själv och beskriver hur du kan hjälpa till i vår mission att förenkla utbildning. Skicka din ansökan till karl.west@viaecole.se What happens next? Vad är nästa steg? When we've reviewed the applications, you'll hear from us about advancement to the design challange stage. När vi gått igenom ansökningarna, meddelar vi om du gått vidare till nästa fas i processen som är en designuppgift. The design challenge is an at-home assignment that will showcase your approach to design. You will redesign a web page and document your process and your thinking. Designuppgiften genomförs på distans. Du får i uppdrag att designa om en webbsida och dokumentera din process och hur du resonerat. The final stage in the process are a few interviews with future colleagues. Den sista fasen består av ett litet antal intervjuer med framtida kollegor. Learnpoint is developed by ViaEcole Learnpoint är utvecklat av ViaEcole Work at Learnpoint Lediga tjänster English | Svenska"
    },
    {
        "title": "Work with us - Learnpoint",
        "url": "/jobs/index.html",
        "content": "Sign in Logga in Work at Learnpoint Lediga tjänster Designer Permanent Full time Remote Fast anställning Heltid Distans Learnpoint is developed by ViaEcole Learnpoint är utvecklat av ViaEcole Work at Learnpoint Lediga tjänster English | Svenska"
    },
    {
        "title": "Sign in - Learnpoint",
        "url": "/sign-in.html",
        "content": "Sign in Logga in Sign in Logga in Enter the Learnpoint address for your school. Skriv in Learnpoint-adressen till din skola. Couldn't find the school. Check the address. Hittade inte skolan. Kontrollera adressen. Enter the Learnpoint address Ange Learnpoint-adressen school-name Continue Fortsätt Trouble signing in? We'd be happy to help. Problem att logga in? Vi hjälper gärna till. Previous sign ins Tidigare inloggningar Learnpoint is developed by ViaEcole Learnpoint är utvecklat av ViaEcole Work at Learnpoint Lediga tjänster English | Svenska"
    }
]