[
    {
        "title": "Learnpoint: About us",
        "description": "About Learnpoint",
        "url": "/about/index.html",
        "content": "We're on a mission to simplify education. Vi förenklar utbildning. The product Produkten Learnpoint is a beloved learning platform for students, teachers, and school managers. It includes features for planning, grading, communication, collaboration, and much more. Learnpoint är en mycket omtyckt lärplattform för studenter, lärare och skolledare. Den innehåller funktioner för planering, bedömning, kommunikation, samarbete, och mycket mer. Read more about the product and features in the help section. Läs mer om produkten och funktionerna på hjälpsidan. The team Teamet We're a curious group of individuals motivated by a love for learning and a shared goal of creating simple and user-friendly products. Vi är ett nyfiket gäng individer som drivs av ett intresse för lärande och ett gemensamt mål att skapa enkla och användarvänliga produkter. Daniel Gidlöf Development Utveckling Dhanfia Rahman Design Frida Brodin Design Jonas Bergvall Customer success Kamil Gourie Customer success Karl West Design Katja Sörlen Sales Försäljning Martin Tholsby Sales Försäljning Martin Vehmas Development Utveckling Susanna Bollhem Sales Försäljning Zuzana Roháčová Development Utveckling The workplace Arbetsplatsen We're a completely remote organization and don't have a shared office. This enable us to have a distraction free environment where we're able to focus on our job without being unnecessarily interrupted. We put work and quality above meetings and politics. Vi jobbar på distans och har inget gemensamt kontor. Det gör det möjligt för oss att ha en distraktionsfri arbetsplats och låter oss fokusera på jobbet utan att bli avbrutna i onödan. Vi prioriterar arbete och kvalitet framför möten och politik. Even though we don't do typical meetings, we often get together over Zoom to work, discuss, teach, and learn. Our culture is highly collaborative and all team members are helpful and professional. Även om vi inte genomför typiska möten, så träffas vi ofta över Zoom för att arbeta, diskutera, förklara och lära. Kulturen bygger på samarbete och alla medarbetare är hjälpsamma och professionella. Making a career at Learnpoint does not mean you have to give up your craft and become a manager. You'll be able to advance within your area of expertise and be promoted through five career levels. Each level is documented in a proficiency map and your salary is determined by your current level. En karriär på Learnpoint betyder inte att du måste överge din roll och bli chef. Du får utvecklas inom ditt expertområde och befordras i fem steg. Varje steg är dokumenterad i en expertkarta och din lön bestäms av vilket steg du befinner dig på. On top of the Swedish welfare benefits, Learnpoint offers workplace allowance, health insurance, healthcare insurance, wellness care, occupational pension, extra parental leave payment, accident insurance, and so on. You should be able to focus on doing great and interesting work, without having to worry about complicated insurance policies or legal details. Learnpoint har många värdefulla förmåner som kontorsersättning, sjukförsäkring, sjukvårdsförsäkring, friskvårdsersättning, tjänstepension, olycksfallsförsäkring, föräldralön, och så vidare. Du skall kunna fokusera på kreativa och intressanta arbetsuppgifter, utan att behöva oroa dig för krångliga försäkringsregler och juridiska detaljer. Does Learnpoint sounds like a workplace for you? Check out our job openings. Låter Learnpoint som något för dig? Kolla in våra lediga tjänster."
    },
    {
        "title": "Learnpoint: Contact",
        "description": "Learnpoint Contact, Learnpoint Kontakt",
        "url": "/contact/index.html",
        "content": "Contact Kontakt Learnpoint AB KIVRA: 556684-6381 SE-106 31 Stockholm 106 31 Stockholm SWEDEN hello@learnpoint.se +46 850 126 090 08 - 50 12 60 90 Company registration number: 556684-6381 Organisationsnummer: 556684-6381 Support Visit our help page to find support contact information. På hjälpsidan finns kontaktuppgifter till supporten."
    },
    {
        "title": "Kursinnehåll / Kursdelar",
        "description": "Kursinnehåll / Kursdelar - Learnpoint Hjälp och Support",
        "url": "/help/content/course-items.html",
        "content": "Kursdelar Course items This page is only available in swedish. Kursdelarna kan innehålla uppgifter, information och dokument. Lägg till kursdel En kursdel måste alltid ligga i ett avsnitt. Se till att det finns avsnitt innan du lägger till en kursdel. Välj i vilket avsnitt kursdelen skall läggas till. Klicka på Ny kursdel. Fyll i namn. Klicka på Skapa: Publicera kursdel Kursdelarna (och avsnitten) visas inte för studenterna förrän dom är publicerade. Klicka på meny-ikonen (dom tre prickarna till höger). Klicka på Publicera: Lägg till innehåll Kursdelarna kan innehålla text, länkar, bilder, filmer och bifogade filer. Klicka på kursdelen. Klicka på redigeringsknappen (den grå pennan till höger om kursdelens namn). Lägg till text, länkar, bilder, etc. Klicka på Spara: Ange inställningar Det finns sex inställningar på varje kursdel. Uppgift: Inställningen anger om kursdelen skall vara en inlämningsuppgift. Tid: Anger ett tidsintervall eller endast en sluttid. Plats: Anger en plats som hör till kursdelen. Betyg: Anger om läraren skall sätta betyg på kursdelen. Innehållets synlighet: Anger när innehållet ska synas för studenten. Såhär gör du för att ange kursdelens inställningar: Klicka på kursdelen. Klicka på redigeringsknappen (den grå pennan till höger om inställningen). Välj inställning. Klicka på Spara: Flytta kursdel Kursdelarna kan flyttas så att dom hamnar i rätt ordning. Klicka på meny-ikonen till höger (dom tre prickarna till höger). Klicka på Flytta. Nu visas blå knappar som indikerar vart du kan flytta kursdelen. Klicka på någon av dom blå knapparna: Ta bort kursdel Klicka på meny-ikonen (dom tre prickarna till höger). Klicka på Ta bort: Återställ borttagen kursdel Borttagna kursdelar sparas i 30 dagar. Under den tiden är det möjligt att återställa dom. Skrolla längst ned på innehållsidan. Klicka på Visa borttagna. Hitta den kursdel du vill återställa. Klicka på Återställ. Nästa: Kursinnehåll / Hämta innehåll →"
    },
    {
        "title": "Kursinnehåll / Importera innehåll",
        "description": "Kursinnehåll / Importera innehåll - Learnpoint Hjälp och Support",
        "url": "/help/content/import-content.html",
        "content": "Importera innehåll Import content This page is only available in swedish. Du kan importera innehåll från andra kurser i Learnpoint. Importera innehåll Skrolla längst ned på innehållsidan. Klicka på Importera innehåll. Klicka på kursen du vill importera från. Markera dom kursdelar du vill importera. Klicka på Importera. Dom importerade kursdelarna hamnar längst ned på innehållssidan. Inställningar Du kan ställa om alla lärare på skolan skall kunna importera från kursen: Gå till Om-sidan. Klicka på Redigera. Kryssa i (eller ur) Alla lärare på skolan får importera innehåll från denna kurs. Klicka på Spara. Nästa: Betyg / Inledning →"
    },
    {
        "title": "Kursinnehåll / Inledning",
        "description": "Kursinnehåll / Inledning - Learnpoint Hjälp och Support",
        "url": "/help/content/introduction.html",
        "content": "Kursinnehåll Learning content This page is only available in swedish. Innehållet i kurserna byggs upp av kursdelar och avsnitt. Kursdelar kan innehålla uppgifter, instruktioner och dokument. Kursdelarna organiseras i avsnitt för att ge kursinnehållet en pedagogisk struktur. Kursinnehållet finns på sidan Innehåll i respektive kurs: Nästa: Kursinnehåll / Avsnitt →"
    },
    {
        "title": "Kursinnehåll / Avsnitt",
        "description": "Kursinnehåll / Avsnitt - Learnpoint Hjälp och Support",
        "url": "/help/content/sections.html",
        "content": "Avsnitt Sections This page is only available in swedish. Avsnitten innehåller kursdelar. Varje avsnitt har ett namn och en beskrivning. Lägg till avsnitt Skrolla längst ned på innehållssidan. Klicka på Nytt avsnitt. Fyll i namn. Fyll i beskrivning om du vill. Klicka på Skapa: Publicera avsnitt Avsnitten (och kursdelarna) visas inte för studenterna förrän dom är publicerade. Klicka på meny-ikonen (dom tre prickarna till höger). Klicka på Publicera: Flytta avsnitt Avsnitten kan flyttas så att dom hamnar i rätt ordning. Klicka på meny-ikonen till höger (dom tre prickarna till höger). Klicka på Flytta. Nu visas blå knappar som indikerar vart du kan flytta avsnittet. Klicka på någon av dom blå knapparna: Ta bort avsnitt Klicka på meny-ikonen (dom tre prickarna till höger). Klicka på Ta bort: Återställ borttaget avsnitt Borttagna avsnitt sparas i 30 dagar. Under den tiden är det möjligt att återställa dom. Skrolla längst ned på innehållsidan. Klicka på Visa borttagna. Hitta det avsnitt du vill återställa. Klicka på Återställ. Nästa: Kursinnehåll / Kursdelar →"
    },
    {
        "title": "Kom igång / Aviseringar",
        "description": "Aviseringar - Learnpoint Hjälp och Support",
        "url": "/help/getting-started/notifications.html",
        "content": "Aviseringar Notifications This page is only available in swedish. Du behöver inte klicka runt i Learnpoint för att se vad som hänt. Allt nytt finns i aviseringsrutan. Aviseringsrutan Aviseringsrutan hittar du i toppmenyn: Vad aviserar Learnpoint om? Learnpoint aviserar om: Nyheter Inlägg i kanaler Enkäter LIA-platser Loggböcker Betyg Inlämningar Kommentarer För att få aviseringar från en grupp, måste du vara medlem gruppen. Om du är administratör, eller utbildningsledare för en klass, kan du ha behörighet till grupper utan att vara medlem. Du måste lägga till dig själv som medlem i dessa grupper för få aviseringar. Markera som läst När du klickar på en avisering kommer du till det aviseringen avser (ex. en nyhet eller en kommentar). Aviseringen markeras automatiskt som läst när du klickat på den. Du kan dessutom manuellt markera en avisering som läst. Klicka på kontext-menyn (dom tre prickarna till höger) och sedan på Markera som läst: För att markera alla aviseringar som lästa, klicka på Markera alla som lästa: Markera som oläst Om en avisering är läst, kan du markera den som oläst. Klicka på kontext-menyn (dom tre prickarna till höger) och sedan på Markera som oläst: Inställningar Du hittar aviseringsinställningarna genom att klicka på kugghjulet längst upp till höger i aviseringsrutan. På inställningssidan kan du: Välja att bli aviserad med e-post. Stänga av aviseringar för enskilda grupper: Nästa: Kom igång / Profilsidan →"
    },
    {
        "title": "Kom igång / Profilsidan",
        "description": "Profilsidan - Learnpoint Hjälp och Support",
        "url": "/help/getting-started/profile-page.html",
        "content": "Profilsidan Profile page This page is only available in swedish. Din profilsida innehåller information om dig, exempelvis namn, e-post och bild. Du navigerar till profilsidan genom att först klicka på avataren längst upp till höger, och sedan på Visa profilsidan: Redigera Du kan ändra informationen på profilsidan: Klicka på pennan för att ändra profilbild. Klicka på Redigera för att ändra information. Klicka på Byt lösenord för att byta lösenord: Nästa: Grupper / Inledning →"
    },
    {
        "title": "Kom igång / Logga in",
        "description": "Logga in - Learnpoint Hjälp och Support",
        "url": "/help/getting-started/sign-in.html",
        "content": "Logga in Sign in Få ett konto från skolan Get an account from your school För att logga in behöver du först få ett användarkonto från skolan. Kontakta din skola om du inte redan fått ett konto. To be able to sign in, you first need to receive a user account from your school. Contact your school if you haven't already received an account. Hitta till skolans inloggningssida Find the sign in page for your school Gå till learnpoint.se/sign-in.html Navigate to learnpoint.se/sign-in.html Skriv in adressen till din skola. Type in the address to your school. Klicka på Fortsätt. Click on Continue. Aktivera konto Activate account Du behöver aktivera ditt konto innan du kan logga in: You need to activate your account before you can sign in: Hitta till skolans inloggningssida (se ovan). Find the sign in page for your school (see above). Klicka på Aktivera konto. Click Aktivera konto. Ange din e-postadress och klicka på OK. Type your email address and click OK. Nu får du ett mejl med instruktioner. Kolla skräpposten om du inte hittar mejlet. You'll receive an email with instructions. Check your spam folder if you can't find the email. Logga in Sign in När du har aktiverat ditt konto loggar du in på följande sätt: When you've activated your account, you sign in like this: Hitta till skolans inloggningssida (se ovan). Find the sign in page for your school (see above). Ange användarnamn och lösenord. Type your username and password. Kryssa i Håll mig inloggad om du vill hållas inloggad. Check Håll mig inloggad if you want to stay signed in. Klicka på Logga in. Click Logga in. Problem att logga in? Trouble signing in? Kontrollera användarnamnet. Observera att du inte kan logga in med en mailadress. Check your username. Note that you cannot use your email address. Kontrollera att Caps Lock inte är aktiverat på tangentbordet. Check that Caps Lock is not activated on your keyboard. Har du glömt lösenordet så kan du återställa det. Klicka på Glömt ditt lösenord? och följ instruktionerna. If you've forgotten your password, you can reset it. Click Glömt ditt lösenord? and follow the instructions. Har du inte fått något användarkonto, kontakta din skola. If don't have a user account, contact your school. Lyckas du ändå inte logga in? Kontakta vår support så hjälper vi till! Still having troubles signing in? Contact out to our support! Nästa: Kom igång / Aviseringar →"
    },
    {
        "title": "Betyg / Kursdelar",
        "description": "Betyg / Kursdelar - Learnpoint Hjälp och Support",
        "url": "/help/grading/course-items.html",
        "content": "Kursdelar Course items This page is only available in swedish. Aktivera betygsättning på kursdelar För att kunna betygsätta en kursdel behöver det anges bland inställningarna på kursdelen: Uppföljningssidan Varje kursdel har en uppföljningssida. På den visas: En liten blå ikon för nya inlämningar. En siffra för nya kommentarer. Det angivna betyget. Om betyget inte har publicerats. En knapp för att publicera samtliga betyg som ännu inte publicerats: Sätt betyg på kursdel Gå till kursdelens uppföljningssida. Klicka på en student. Välj betyg. Ange Feedback om du vill förtydliga betyget på något sätt. Klicka på Publicera när du vill att studenten skall se betyget. Du kan även öppna inlämningsuppgifter och skriva kommentarer till studenten. Använd genvägarna för att navigera till nästa student: Ta bort betyg på kursdel Gå till studenten. Klicka på meny-ikonen (dom tre prickarna till höger). Klicka på Ta bort betyget. Klicka på Ta bort. Klicka på Publicera när du vill att borttagningen skall visas för studenten. Klicka på OK: Nästa: Betyg / Kurser →"
    },
    {
        "title": "Betyg / Kurser",
        "description": "Betyg / Kurser - Learnpoint Hjälp och Support",
        "url": "/help/grading/courses.html",
        "content": "Kurser Courses This page is only available in swedish. Kursbetygen finns i den första kolumnen på betygssidan: Sätt betyg på kurs Gå till sidan Betyg. Klicka på rutan för kursbetyg på någon av studenterna. Välj betyg. Klicka på Klarrapportera när du är klar med betygsättningen. Klicka på Publicera när du vill att betyget skall visas för studenten. NOTERA: Ibland har du som lärare inte behörighet att publicera kursbetyg och då kan du hoppa över detta steg. Välj nästa student bland genvägarna: Ta bort betyg på kurs Gå till studentens kursbetyg. Klicka på meny-ikonen (dom tre prickarna till höger). Klicka på Ta bort betyget. Klicka på Ta bort. Klicka på Klarrapportera. Klicka på Publicera när du vill att borttagningen skall visas för studenten. NOTERA: Ibland har du som lärare inte behörighet att publicera borttagningen och då kan du hoppa över detta steg. Nästa: Betyg / Skalor →"
    },
    {
        "title": "Betyg / Inledning",
        "description": "Betyg / Inledning - Learnpoint Hjälp och Support",
        "url": "/help/grading/introduction.html",
        "content": "Betyg Grading This page is only available in swedish. Betyg kan sättas både på kurser och kursdelar. I varje kurs finns en översikt på sidan Betyg. En blå triangel indikerar att betyget ännu inte är publicerat till studenten: På studenternas profilsida, på sidan Studieplan, finns en överblick av studentens kursbetyg: Det är möjligt att använda flera olika betygsskalor i Learnpoint. Detta är särskilt användbart för skolor med olika utbildningsformer. Skoladministratörer har en länk till betygsskalorna i menyn Mer: Nästa: Betyg / Kursdelar →"
    },
    {
        "title": "Betyg / Skalor",
        "description": "Betyg / Skalor - Learnpoint Hjälp och Support",
        "url": "/help/grading/scales.html",
        "content": "Skalor Scales This page is only available in swedish. Skoladministratörer kan definiera vilka betygsskalor som ska kunna användas för kurser och kursdelar. Man kan ha olika skalor för olika kurser, vilket är särskilt användbart för skolor med olika utbildningsformer. Lägg till ny skala Klicka på Ny skala under rubriken Skalor för kurser eller Skalor för kursdelar, beroende på vilken typ av skala du vill skapa. Fyll i namnet på skalan. Klicka på Skapa: Redigera skala Navigera till skalan som du vill redigera. Klicka på meny-ikonen (dom tre prickarna till höger). Klicka på Redigera: Skalans egenskaper Varje skala har ett antal egenskaper som påverkar var den kan användas och hur den visas. Namn: Namnet är det som kommer att visas när man väljer vilken skala som ska användas för en kurs eller en kursdel. Beskrivning: Skalans interna beskrivning (syns endast för administratörer). Skolformer: Anger vilka skolformer skalan ska kunna användas för. En kurs tillhör alltid en skolform, så se till att skalan är aktiv för den skolform som kursen tillhör. Lägsta värde för status klar: Anger det lägsta värde ett betygssteg måste ha för att den gröna status-ikonen skall visas. Lägg till steg Varje skala har ett antal betygssteg. När en lärare sätter betyg, så är det dessa steg/betyg som hon kan välja bland. Klicka på Nytt steg under rubriken Betygssteg Fyll i stegets egenskaper: Stegens egenskaper Varje betygssteg har följande egenskaper: Namn: Stegets fullständiga namn. Förkortning: Förkortningen är det som visas vid betygssättning, i översikten, och i studieplanen. Värde: Om värdet är större än lägsta värde för status klar, så visas en grön status-ikon. Om värdet är lägre, så visas en röd ikon. Status: Visar den aktuella status-ikonen för steget. TIPS: Betygsstegen uttrycks ofta med bokstäver, men det är också möjligt att använda emojis, vilket kan vara användbart i vissa situationer. Här är ett exempel på hur det kan se ut när man betygssätter med en skala som har två emojis, ett rött kryss och en grön bock: Ta bort steg Man kan endast ta bort betygssteg som aldrig använts för betygssättning. Så fort en lärare satt ett betyg utifrån ett betygssteg, så går det inte att ta bort det steget. Klicka på ta bort-ikonen (papperskorgen till höger): Publicera skala För att en skala ska kunna användas så behöver den publiceras. Och för att kunna publiceras, så behöver den ha minst ett betygssteg och dessutom vara aktiv för minst en skolform. Klicka på meny-ikonen (dom tre prickarna till höger). Klicka på Publicera: Flytta skalor Skalorna kan flyttas så att dom hamnar i rätt ordning. Klicka på meny-ikonen (dom tre prickarna till höger). Nu visas knappar som indikerar vart du kan flytta skalan. Klicka på någon av knapparna för att flytta upp eller ned: Inaktivera en skala Om en skala inte ska användas längre, så kan den inaktiveras. Detta påverkar givetvis inte dom kurser där skalan redan används — när en skala inaktiveras så kommer den bara döljas för nya kurser, samt för dom kurser där skalan inte redan används. Klicka på skalan som du vill inaktivera. Klicka på menyikonen (dom tre prickarna till höger) och välj Redigera. Ta bort krysset för den skolform där skalan skall inaktiveras. Klicka på Spara: Ta bort skala Notera att det endast är skalor som aldrig använts som är möjliga att ta bort. Klicka på meny-ikonen (dom tre prickarna till höger). Klicka på Ta bort: Nästa: LIA / Inledning →"
    },
    {
        "title": "Grupper / Om",
        "description": "Grupper / Om - Learnpoint Hjälp och Support",
        "url": "/help/groups/about.html",
        "content": "Om About This page is only available in swedish. Varje grupp har en sida med allmän information: Redigera allmän information om gruppen Klicka på Redigera för att ändra gruppens information: Nästa: Kursinnehåll / Inledning →"
    },
    {
        "title": "Grupper / Kanaler",
        "description": "Grupper / Kanaler - Learnpoint Hjälp och Support",
        "url": "/help/groups/channels.html",
        "content": "Kanaler Channels This page is only available in swedish. Diskussionskanaler är ett flexibelt verktyg för kommunikation och samarbete. Funktionen finns på sidan Kanaler i respektive grupp: Aktivera funktionen Kanaler kan användas på grupper av typen Skola, Klass, och Kurs. Om funktionen inte är påslagen, så aktiverar du den på gruppens Om-sida. Skapa kanal Både lärare och studenter kan skapa kanaler: Klicka på Ny kanal. Fyll i namn. Välj Kategori. Klicka på Spara: Lägg till medlemmar När du skapat en kanal kan du lägga till medlemmar: Klicka på kontextmenyn uppe till höger (dom tre prickarna). Klicka på Medlemmar. Klicka på Lägg till. Lägg till dom som skall vara medlemmar i kanalen: Skapa kategori Om du har många kanaler i en grupp så kan du sortera in dem i olika kategorier. Såhär skapar du en ny kategori: Klicka på Ny kategori. Fyll i namn. Klicka på Spara: Gå med i kanal Både lärare och studenter kan gå med (bli medlem) i vilken kanal som helst — det finns alltså inga &quot;privata&quot; kanaler i Learnpoint. Såhär går man med i en kanal: Klicka på Alla kanaler. Klicka på Gå med för den kanalen du vill bli medlem i (eller navigera till kanalen du vill bli medlem i och klicka sedan på Gå med i kanal): Aviseringar När det finns nya inlägg i en kanal så visas kanalnamnet med fet text, men du kan dessutom få aviseringar om du vill. Aviserings-klockan uppe till höger avgör om du får aviseringar för kanalen (eller inlägget): Bifoga bilder och filer Du kan bifoga både bilder och filer i en kanal: Ta bort kanal Såhär tar du bort en kanal: Gå till kanalen du vill ta bort. Klicka på kontextmenyn (dom tre prickarna) uppe till höger. Klicka på Ta bort. Bekräfta. Återställa borttagen kanal Om du av misstag tagit bort en kanal, så har du 30 dagar på dig att återställa den. Såhär återställer du en kanal: Klicka på Alla kanaler. Skrolla längst ned på sidan. Klicka på Borttagna kanaler. Hitta kanalen du vill återställa. Klicka på Återställ. Nästa: Grupper / Nyheter →"
    },
    {
        "title": "Grupper / Material",
        "description": "Grupper / Material - Learnpoint Hjälp och Support",
        "url": "/help/groups/documents.html",
        "content": "Material Documents This page is only available in swedish. Med materialfunktionen kan du lagra filer och länkar i grupper av typen klass och skola. Funktionen finns på sidan Material: Lägg till Lägg till en fil eller en länk genom att klicka på Lägg till och följ sedan instruktionerna: Ändra och ta bort Längst till höger på sidan finns knappar för att ändra och ta bort: Nästa: Grupper / Studenter →"
    },
    {
        "title": "Grupper / Inledning",
        "description": "Grupper / Inledning - Learnpoint Hjälp och Support",
        "url": "/help/groups/introduction.html",
        "content": "Grupper Groups This page is only available in swedish. Learnpoint är huvudsakligen organiserat i grupper. Varje grupp innehåller information och funktionalitet för just den gruppen. Det finns tre typer av grupper: Skola, Klass och Kurs. Dom fungerar ungefär på samma sätt, men det finns några skillnader. Exempelvis finns funktionen Innehåll finns endast i kurser, och funktionen Material finns endast i klasser och skolan. Aktuella grupper &quot;Aktuella grupper&quot; är dom som visas på startsidan. Klicka på Hem för att se dina aktuella grupper: Du kan också se dina aktuella grupper bland genvägarna som finns längst upp till vänster: Alla grupper Klicka på Visa alla grupper för att se och söka bland alla dina grupper: Nästa: Grupper / Kanaler →"
    },
    {
        "title": "Grupper / Nyheter",
        "description": "Grupper / Nyheter - Learnpoint Hjälp och Support",
        "url": "/help/groups/posts.html",
        "content": "Nyheter Announcements This page is only available in swedish. Nyheter är ett bra sätt att förmedla information till alla medlemmarna i en grupp. Nyheterna finns på sidan Nyheter: Skriva och publicera För att skriva en nyhet, klicka först på Skriv nyhet uppe till vänster. Fyll sedan i titel, innehåll och klicka på Publicera: Spara utkast När du publicerar en nyhet får medlemmarna i gruppen en avisering och kan läsa och kommentera nyheten. Om du vill spara nyheten, men publicera vid ett senare tillfälle, klickar du istället på Spara utkast: Dina sparade utkast finns under Dina utkast uppe till höger på nyhetssidan: Nästa: Grupper / Material →"
    },
    {
        "title": "Grupper / Personal",
        "description": "Grupper / Personal - Learnpoint Hjälp och Support",
        "url": "/help/groups/staff.html",
        "content": "Personal Staff This page is only available in swedish. Varje grupp innehåller personal. Personalen visas på sidan Personal: Lägg till personal Klicka på Lägg till. Fyll i mailadress och klicka på Nästa. Kryssa i dom roller personalen skall ha i gruppen. Klicka på Klar: Om personalen är helt ny på skolan, behöver du även ange namn, signatur, e-post, m.m. Ta bort eller ändra roll för personal Klicka på dom tre prickarna längst till höger. Klicka på Redigera medlemskap. Klicka på Ta bort eller Ändra roll. Om du valde att ändra roll, kryssa i rätt roller och klicka sedan på Spara: Vilka roller som kan väljas beror på vilken typ av grupp det är. Visa profilsidan för personal Varje personal har en profilsida med allmän information. Klicka på personalens bild. Klicka på Visa profilsidan. På profilsidan kan du se information om personalen: Nästa: Grupper / Om →"
    },
    {
        "title": "Grupper / Studenter",
        "description": "Grupper / Studenter - Learnpoint Hjälp och Support",
        "url": "/help/groups/students.html",
        "content": "Studenter Students This page is only available in swedish. Varje grupp innehåller studenter. Studenterna finns på sidan Studenter: Lägg till student Studenter kan läggas till på klasser. (Det går inte att lägga till studenter på skolan eller på kurser). När du lagt till en student på en klass, blir hon automatiskt tillagd på skolan och på klassens kurser. Klicka på Lägg till. Klicka på Lägg till student. Fyll i personnummer och klicka på Nästa. Välj datum. Klicka på Klar: Om studenten är helt ny på skolan, behöver du även ange namn, födelsedatum, adress, m.m. Ta bort student Du behöver aldrig ta bort studenter från skolan eller från kurser. Du behöver endast ändra studentens status i klassen — studentens medlemskap i skolan och kurser uppdateras automatiskt: Klicka på dom tre prickarna längst till höger. Klicka på Ändra status. Välj status och datum. Klicka på Spara: Visa profilsidan för en student Varje student har en profilsida med allmän information, kalender, studieplan och dokumentation. Klicka på studentens bild. Klicka på Visa profilsidan. På profilsidan kan du bläddra mellan dom olika funktionerna: Nästa: Grupper / Personal →"
    },
    {
        "title": "Hjälp",
        "description": "Learnpoint Hjälp och Support",
        "url": "/help/index.html",
        "content": "Help Hjälp Support Support support@learnpoint.se +46 850 126 090 08 - 50 12 60 90 Phone opening hours Open Closed Closed for lunch Telefontider Öppet Stängt Lunchstängt Regular phone opening hours Ordinarie telefontider Mon-Thu Mån-Tor 9am-12pm and 1pm-4pm 9-12 och 13-16 Fri Fre 9am-12pm 9-12 const phoneSupportOpenHours = { 0: [], // Sun 1: [9, 10, 11, 13, 14, 15], // Mon 2: [9, 10, 11, 13, 14, 15], // Tue 3: [9, 10, 11, 13, 14, 15], // Wed 4: [9, 10, 11, 13, 14, 15], // Thu 5: [9, 10, 11], // Fri 6: [], // Sat }; const closedDaysRanges = [ ['2025-06-19', '2025-06-20', \"We're closed\", \"Vi har midsommarstängt\"], ['2025-07-12', '2025-08-03', \"☀️ We're closed for the summer\", \"☀️ Vi har sommarlov\"], ['2025-12-24', '2025-12-26', \"🎄 We're closed for Christmas\", \"🎄 Vi har julstängt\"], ['2025-12-31', '2026-01-01', \"⭐ We're closed for the New Years\", \"⭐ Vi har nyårsstängt\"], ['2026-01-05', '2026-01-06', \"We're closed\", \"Vi har stängt\"] ]; function isWithinClosedDaysRange(date) { for (const closedDaysRange of closedDaysRanges) { const rangeStartDate = new Date(closedDaysRange[0]); const rangeEndDate = new Date(closedDaysRange[1]); isAfterOrOnStartDate = compareDates(date, rangeStartDate) > -1; isBeforeOrOnEndDate = compareDates(date, rangeEndDate) bYear) return 1; if (aMonth bMonth) return 1; if (aDay bDay) return 1; return 0; } const { openNow, openPreviousHour, openNextHour, isClosedDay } = phoneSupportIsOpen(new Date()); const supportOpeningHoursPanel = document.querySelector('.help-index-page__support-opening-hours'); // OPEN SIGN if (openNow) { supportOpeningHoursPanel.classList.add('OPEN'); } else { if (openPreviousHour && openNextHour) { supportOpeningHoursPanel.classList.add('CLOSED-FOR-LUNCH'); } else { supportOpeningHoursPanel.classList.add('CLOSED'); } } // SPECIAL DAYS CLOSED PANEL if (isClosedDay) { const specialDaysClosedPanel = document.querySelector('.help-index-page__special-days-closed'); specialDaysClosedPanel.classList.add('SHOW'); const specialDaysClosedSpanEn = specialDaysClosedPanel.querySelector('[lang=en]'); const specialDaysClosedSpanSv = specialDaysClosedPanel.querySelector('[lang=sv]'); const startDate = new Date(isClosedDay[0]); const endDate = new Date(isClosedDay[1]); const dateFormatOptions = { day: 'numeric', month: 'long' }; const startDateStringEn = startDate.toLocaleDateString('en', dateFormatOptions); const startDateStringSv = startDate.toLocaleDateString('sv', dateFormatOptions); const endDateStringEn = endDate.toLocaleDateString('en', dateFormatOptions); const endDateStringSv = endDate.toLocaleDateString('sv', dateFormatOptions); if (isClosedDay[0] === isClosedDay[1]) { specialDaysClosedSpanEn.innerHTML = `${isClosedDay[2]} ${endDateStringEn}`; specialDaysClosedSpanSv.innerHTML = `${isClosedDay[3]} ${endDateStringSv}`; } else { specialDaysClosedSpanEn.innerHTML = `${isClosedDay[2]} ${startDateStringEn} - ${endDateStringEn}`; specialDaysClosedSpanSv.innerHTML = `${isClosedDay[3]} ${startDateStringSv} - ${endDateStringSv}`; } } User guides Dokumentation Check out the guides in the menu to the left for instructions on how to use Learnpoint. I menyn till vänster finns beskrivningar av funktionerna i Learnpoint. Click the menu button Under meny-knappen in the upper right corner for instructions on how to use Learnpoint. uppe till höger finns beskrivningar av funktionerna i Learnpoint. News Nyheter Product announcements and updates are published on the news page, where you also can subscribe to our newsletter. På nyhetssidan publiceras produktnyheter och uppdateringar. Där kan du även prenumerera på vårt nyhetsbrev. Feedback Feedback We always appreciate feedback. If you have any ideas or suggestions, write to: karl.west@learnpoint.se Vi uppskattar alltid feedback. Har du synpunkter eller förslag, skriv till: karl.west@learnpoint.se Nästa: →"
    },
    {
        "title": "LIA / LIA-plats",
        "description": "LIA / LIA-plats - Learnpoint Hjälp och Support",
        "url": "/help/internship/internship.html",
        "content": "LIA-plats Internships This page is only available in swedish. Lägg till LIA-plats Både studenter och personal kan lägga till LIA-platser. Såhär gör du som personal: Gå till LIA-verktyget. Välj student. Klicka på Registrera LIA-plats. Ange handledarens mejladress. Klicka på Nästa. Ange information om handledaren. Klicka på Nästa. Ange information om praktikplatsen. Klicka på Spara. Godkänn LIA-plats För att en LIA-plats skall anses godkänd, behöver den godkännas av samtliga parter: studenten, handledare och skolan. Studenten och handledaren godkänner på egen hand, men som personal kan du dessutom godkänna åt dom: Gå till LIA-platsen Klicka i kryssboxarna för dom du vill godkänna åt: Nästa: LIA / Inställningar →"
    },
    {
        "title": "LIA / Inledning",
        "description": "LIA / Inledning - Learnpoint Hjälp och Support",
        "url": "/help/internship/introduction.html",
        "content": "LIA Internship This page is only available in swedish. LIA är ett verktyg för att hantera praktik under utbildningen. Verktyget finns på LIA-kurser på sidan LIA: LIA-processen Innan praktiken börjar behöver studentera söka och hitta en lämplig praktikplats. Under denna period kan studenterna uppmanas att skriva om sitt sökande i loggboken. Loggboken är en del av LIA-verktyget. När studenten hittat praktikplats så registrerar hon den i verktyget. Handledaren på praktikföretaget får ett mejl och uppmanas att godkänna praktikplatsen och en överenskommelse. Under praktiken kan studenterna uppmanas skriva om sina erfarenheter i loggboken. När praktiken är slut får studenten och handledaren besvara varsin enkät. Svaren från studenten används för att utvärdera praktikföretaget, och svaren från handledaren används som betygsunderlag. Nästa: LIA / LIA-plats →"
    },
    {
        "title": "LIA / Inställningar",
        "description": "LIA / Inställningar - Learnpoint Hjälp och Support",
        "url": "/help/internship/settings.html",
        "content": "Inställningar Settings This page is only available in swedish. Inställningar på kursen Inställningarna för LIA-vertyget finns under länken LIA-inställningar på sidan LIA: Verktyget har inställningar för: Loggbok under sökande. Loggbok under praktik. Automatisk publicering till handledare. Möjlighet att bifoga filer. Instruktioner till handledare. Överenskommelsen som handledaren godkänner innan praktiken. Såhär kan LIA-inställningarna på en kurs se ut: Skolövergripande inställningar Du som administratör kan ändra dom skolövergripande standardinställningarna för LIA-verktyget. Inställningarna finns under länken Mer i toppmenyn: Inställningar för enkäter Inställningarna för LIA-vertygets enkäter finns under länken LIA-enkäter på sidan LIA: LIA-verktyget har enkätinställningar för: Studentenkäten som besvaras av studenten när praktiken är klar. Handledarenkäten som besvaras av handledaren när praktiken är klar. Här är ett exempel på hur inställningarna kan se ut: Nästa: →"
    },
    {
        "title": "Learnpoint: Learning management platform",
        "description": "Delightfully simple learning management.",
        "url": "/index.html",
        "content": "Delightfully simple learning management. Uppfriskande enkel lärplattform. Learnpoint is the hassle-free learning management platform that simplifies education for both students and teachers. Learnpoint är den krångelfria lärplattformen som förenklar utbildning för både lärare och studenter. Learning content Kursinnehåll Create and hand out assignments, instructions and documents. Organize the content into sections to give it a clear structure.Read more → Skapa och dela ut uppgifter, instruktioner och dokument. Organisera innehållet i avsnitt så att kursen får en pedagogisk struktur.Läs mer → Channels Kanaler Write announcements, answer questions, and promote collaborative learning. A flexible tool with many applications.Read more → Skriv nyheter, besvara frågor, och uppmuntra kollaborativt lärande. Ett flexibelt verktyg med många användningsområden.Läs mer → Grading Betyg You can grade both courses and assignments. Each course has a comprehensible grading overview.Read more → Du kan betygsätta både kurser och uppgifter. I varje kurs finns en överskådlig sammanställning.Läs mer → Announcements Nyheter Write announcements to all students in a course. An efficient way to publish information.Read more → Skriv nyheter till studenterna i en kurs. Ett effektivt sätt att publicera information.Läs mer → Want to know more? Vill du veta mer? Would you like a demo, ask a question, or just talk to us? Vill du se en demo, ställa en fråga, eller bara snacka en sväng? Write to hello@learnpoint.se Skriv till hello@learnpoint.se We love learning"
    },
    {
        "title": "Design Challenge Code",
        "description": "",
        "url": "/jobs/2021/02/design-challenge-code.html",
        "content": ""
    },
    {
        "title": "Design Challenge",
        "description": "Design Challenge, February 2021",
        "url": "/jobs/2021/02/design-challenge.html",
        "content": "Design Challenge Designprov February 2021 Februari 2021 This design challenge is part of the application process for a designer position. You have recieved a mail if you're qualified for this challenge. Detta designprov är en del av anställningsprocessen för en tjänst som designer. Du har fått mail om du kvalificerat dig för provet. Challenge Description Instruktion Learnpoint is organized in courses and each course has a document tool. Users can add, search, and view documents. Learnpoint innehåller kurser och varje kurs har ett dokumentverktyg. Användare kan lägga till, söka, och titta på dokument. The documents are sorted alphabetically, but there is no other structure. If there are lots of documents, it is difficult for the user to get a clear overview of all the documents. Dokumenten är sorterade i bokstavsordning, men i övrigt finns ingen struktur. Om det finns många dokument är det svårt för användare att få en god överblick av alla dokument. The problem is not about finding a specific document. If the user knows what document she is looking for, she can use the search feature. The problem is about getting a clear overview if there are lots of documents. Problemet handlar inte om att hitta ett visst dokument. Om användaren vet vilket dokument hon letar efter, så kan hon använda sökfunktionen. Problemet handlar om att få en god överblick när det finns väldigt många dokument. The challenge has two tasks: Provet består av två uppgifter: Find and discuss different solutions to the overview problem. Identifiera och diskutera olika lösningar på problemet med översikt. Implement one of your solutions. Implementera en av dina lösningar. The Document Tool in Learnpoint Dokumentverktyget i Learnpoint Below is an illustration of the document tool in Learnpoint. Nedan är en illustration av dokumentverktyget i Learnpoint. The Document Tool in Learnpoint Dokumentverktyget i Learnpoint How to approach the challange Tips för att lösa uppgiften This design challenge is primarily about showcasing your work processess and the way you think about design problems. When your work is evaluated, the first task will be more important than the second. Make sure to spend enough time on the first task before moving on to the next. Designprovet skall framför allt visa hur du arbetar och resonerar kring ett designproblem. Ditt arbete kommer bedömas med tonvikt på den första uppgiften. Se till att lägga tillräckligt med tid på den första uppgiften innan du går vidare till nästa. The second task should not result in a complete implementation that's ready for deployment. But it needs to be finished enough to demonstrate your chosen solution. If the solution requires a lot of work, you can limit the implementation to just a part of the solution. To get started, you can use the source code from this example. Den andra uppgiften ska inte resultera i en fullständig implementation som är färdig att leverera. Däremot behöver den vara tillräckligt genomarbetad för att demonstrera din valda lösning. Om lösningen är omfattande, kan du begränsa implementationen till en del av lösningen. För att komma igång kan du använda källkoden till detta exempel. Handing in your work Inlämning The first task should be documented in a PDF and the second task should be coded in a HTML file. The files should be zipped before you hand them in. Den första uppgiften skall dokumenteras i en PDF och den andra skall kodas i en HTML-fil. Zippa filerna innan du lämnar in dom. (Alternatively, you can write a blog post for the first task and/or publish the second task on the web. If you choose this option, you should hand in links instead of zipped files.) (Alternativt kan du skriva ett blogginlägg för den första uppgiften och/eller publicera den andra uppgiften på webben. Om du väljer detta alternativ så lämnar du in länkar istället för zippade filer.) Hand in your work no later than March 15th to karl.west@viaecole.se Lämna in ditt arbete senaste den 15 mars till karl.west@viaecole.se All our open positions → Alla lediga tjänster → .we-love-building { fill: #ff4b00; width: 1.2em; height: 1.2em; animation: 1.6s ease we-love-building-heart-beat; animation-iteration-count: infinite; animation-direction: alternate-reverse; } .dark .we-love-building { fill: #f6682d; } @keyframes we-love-building-heart-beat { from { transform: scale(1.2); } to { transform: scale(1); } } We love building"
    },
    {
        "title": "Designer",
        "description": "Product Designer Position, February 2021",
        "url": "/jobs/2021/02/designer.html",
        "content": "Designer You can no longer apply for this position. You can find all our open positions here. Den här tjänsten går inte längre att söka. Alla våra lediga tjänster finns annonserade här. February 2021 Februari 2021 Learnpoint is an integrated LMS and SIS made for teachers, students, and school managers. The Learnpoint team is on a mission to simplify education and we're now hiring a full time designer. Learnpoint är ett integrerat LMS och administrativt system för lärare, studenter, och skolledare. Vår mission är att förenkla utbildning och nu har vi en ledig tjänst som designer. About the Job Om tjänsten Design is often split into many different roles such as UI, UX, frontend developement, and so on. At Learnpoint, it's all one role. We believe the best designs come from someone who is involved at every step from idea and research to finished product. Design är ofta uppdelat i olika roller som UI, UX, frontend utveckling, och så vidare. Hos oss ligger alla dessa i en och samma roll. Vår övertygelse är att riktigt bra design bygger på ett djupt engagemang i alla aspekter av designprocessen. This means that designers at Learnpoint are generalists. They are projects managers, visual designers, writers, researchers, developers, and more. Hos oss är designers generalister. Dom leder projekt, skriver, skissar, bygger prototyper, implementerar design, och så vidare. You'll spend most of your time designing the product Learnpoint. But occasionally you'll be working on other products, tools, and sites that's part of the company. Största delen av arbetet ägnas åt produkten Learnpoint. Men ibland kommer du jobba med andra produkter, verktyg, och webbsidor som finns inom ramen för bolagets verksamhet. The day-to-day work varies a lot. During our six week work cycles, we mainly focus on designing and building new features. But as a designer, you'll also be working on bug fixes, adjustments, and minor improvements. Between each development cycle, we spend two weeks doing free research. You can read, design games, take a course, or anything else that will advance your design mastery. Det dagliga arbetet varierar mycket. Under våra sex veckors utvecklingsperioder jobbar vi främst med nyutveckling. Men som designer hos oss kommer du även jobba med buggfixar, justeringar, och små förbättringar. Mellan varje utvecklingsperiod har vi två veckors fritt arbete. Du kan läsa, designa spel, gå en kurs, eller vad som helst som utvecklar din designkompetens. The team don't share an office, so everyone works remotely. You can work from home, rent an office, or whatever works best for you. Where, when, and how you work is up to you. Vi har inget gemensamt kontor, så alla jobbar på distans. Du kan jobba hemifrån, hyra en kontorsplats, eller hitta på något annat. Var, hur, och när du jobbar är upp till dig. The job is permanent and full time. Tjänsten är fast och på heltid. Making a career at Learnpoint does not mean giving up on your craft. As you become better at design, you'll advance from junior designer to designer, and then from senior designer to lead designer, and so on. There are five levels of design mastery in total. En karriär hos oss innebär inte att du kommer lämna ditt yrke som designer. När du utvecklar din kompetens kommer du befordras från junior designer till designer, och sedan från senior designer till lead designer, och så vidare. Det finns totalt fem karriärssteg. The salary for a junior designer is 31 416 SEK. Lönen för en junior designer är 31 416 SEK. About Us Om oss Learnpoint is part of the edtech company ViaEcole. We're a customer focused company with two products — Learnpoint and yh-antagning.se. Learnpoint är en del av edtech bolaget ViaEcole. Vi är ett kundorienterat bolag med två produkter — Learnpoint och yh-antagning.se. About You Om dig You are truly interested in design, but perhaps equally interested in humans. How do humans think, how do they learn, what makes them happy? You understand that good design is as much about pixels, as it is about human perception, cognition, and culture. Du är genuint intresserad av design, men kanske minst lika intresserad av människor. Hur tänker dom, hur lär dom sig, och vad gör dom lyckliga? Du förstår att bra design handlar lika mycket om pixlar som om perception, kognition, och mänsklig kultur. You believe that design is about improving the life for others. Du tror på att design handlar om att förbättra andra människors vardag. You are interested in results and answers, but even more interested in questions. You are curious to the bone and you love learning. You understand that there is no prescription for designing an easy-to-use feature, but you're eager to figure it out. You believe that nothing interesting starts with knowing. It starts with not knowing — it starts with a question. Du är intresserad av resultat och svar, men kanske ännu mer intresserad av frågor. Du är genuint nyfiken och älskar lärande. Du förstår att det inte finns något färdig recept för att designa lättillgängliga produkter, men du drivs av att ta reda på hur man gör. Du tror på att inget intressant börjar med att veta. Det börjar med att inte veta — det börjar med en fråga. You are proficient in HTML, CSS, and JavaScript. And you love writing. You understand that words matters just as much as colors and spacing. Du behärskar HTML, CSS, och JavaScript. Och du gillar att skriva. Du förstår att ord spelar lika stor roll som pixlar och färger. How to Apply Sök jobbet Write an application where you tell us about yourself and describe how you could contribute in our mission to simplify education. Send your application before March 1st to karl.west@viaecole.se Skriv en ansökan där du berättar om dig själv och beskriver hur du kan hjälpa till i vår mission att förenkla utbildning. Skicka din ansökan senast 1:a mars till karl.west@viaecole.se What happens next? Vad är nästa steg? When we've reviewed the applications, you'll hear from us at the beginning or March about advancement to the design challange stage. När vi gått igenom ansökningarna, meddelar vi dig i början av mars om du gått vidare till nästa fas i processen som är ett designprov. The design challenge is an at-home assignment that will showcase your approach to design. You will redesign a web page and document your process and your thinking. Designprovet genomförs på distans. Du får i uppdrag att designa om en webbsida och dokumentera din process och hur du resonerat. The final stage in the process are a few interviews with future colleagues. Den sista fasen består av ett litet antal intervjuer med framtida kollegor. All our open positions → Alla lediga tjänster → .we-love-building { fill: #ff4b00; width: 1.2em; height: 1.2em; animation: 1.6s ease we-love-building-heart-beat; animation-iteration-count: infinite; animation-direction: alternate-reverse; } .dark .we-love-building { fill: #f6682d; } @keyframes we-love-building-heart-beat { from { transform: scale(1.2); } to { transform: scale(1); } } We love building"
    },
    {
        "title": "Frontend Developer Internship",
        "description": "Frontend Developer Internship, Autumn 2021",
        "url": "/jobs/2021/autumn/frontend-developer-internship.html",
        "content": "Frontend Developer Frontendutvecklare You can no longer apply for this position. You can find all our open positions here. Den här tjänsten går inte längre att söka. Alla våra lediga tjänster finns annonserade här. Autumn 2021 Hösten 2021 Learnpoint is an integrated LMS and SIS made for teachers, students, and school managers. The Learnpoint team is on a mission to simplify education and we have an internship position open for 1-2 frontend developers during autumn 2021. Learnpoint är ett integrerat LMS och administrativt system för lärare, studenter, och skolledare. Vår mission är att förenkla utbildning och vi har en praktikplats öppen för 1-2 frontendutvecklare under hösten 2021. About the Internship Om praktiken The main task will be to design and implement an application. The first step will be to discuss and choose which application that fits based on the length of the internship, your skillset and our organizational needs. You will make a demo of the application at the end of the intership. Praktikens huvudsakliga uppdrag är att designa och implementera en applikation. Första steget är att diskutera och bestämma vilken applikation som passar utifrån praktikens längd, dina förkunskaper och verksamhetens behov, och sedan avslutas praktiken med att du presenterar applikationen. In addition to the main task, you will also participate in some meetings and workshops. Utöver det huvudsakliga uppdraget kommer du även delta i några arbetsmöten och workshops. You'll have access to a supervisor throughout the internship. Du har tillgång till en handledare under hela praktiken. The internship is 2-6 months and takes place during autumn 2021. Praktiken genomförs under hösten 2021 och är 2-6 månader. We encourage you to apply together with someone else. The task can be done by a single trainee, but two would be even better. Vi ser helst att du genomför praktiken tillsammans med en annan praktikant. Uppdraget går att genomföra individuellt, men det fungerar bättre om ni är två som genomför det. Our team don't share an office, so you will work remote. Vi har inget gemensamt kontor, så allt arbete genomförs på distans. About Us Om oss Learnpoint is part of the edtech company ViaEcole. We're a customer focused company with two products — Learnpoint and yh-antagning.se. Learnpoint är en del av edtech bolaget ViaEcole. Vi är ett kundorienterat bolag med två produkter — Learnpoint och yh-antagning.se. About You Om dig You are truly interested in frontend development, but you're also interested in users. How do they think, what's difficult for them, and what do the like? You understand that a good application is as much about code as it is about humans. Du är genuint intresserad av frontendutveckling, men du är även intresserad av användare. Hur tänker dom, vad tycker dom är svårt och vad gillar dom? Du förstår att en bra applikation handlar lika mycket om kod som om människor. You are interested in results and answers, but perhaps equally interested in questions. You are curious to the bone and you love learning. You understand that there is no simple prescription when it comes to developing good applications, and you're eager to figure out how it should be done. Du är intresserad av resultat och svar, men kanske lika intresserad av frågor. Du är genuint nyfiken och älskar lärande. Du förstår att det inte finns något färdig framgånsrecept när man skall utveckla applikationer, och du drivs av att själv ta reda på hur man ska göra. You are proficient in HTML, CSS, and JavaScript. Du behärskar HTML, CSS, och JavaScript. How to Apply Sök praktikplatsen Write an application where you tell us about yourself and your interest in education and frontend development. Attach CV and portfolio. Indicate if you apply together with another trainee. Send your application to karl.west@viaecole.se Skriv en ansökan där du beskriver dig själv och ditt intresse för utbildning och frontendutveckling. Bifoga CV och portfolio. Ange om du söker praktiken tillsammans med någon annan. Skicka din ansökan till karl.west@viaecole.se What happens next? Vad är nästa steg? When we've reviewed your application, you'll hear from us within a week about advancement to the development challange stage. När vi läst igenom din ansökan, meddelar vi dig inom en vecka om du gått vidare till nästa fas i processen som är ett utvecklingsprov. The development challenge is an at-home assignment. You will design and implement a small component and document your working process. Utvecklingsprovet genomförs på distans. Du får i uppdrag att designa och implementera en komponent samt dokumentera din process och beskriva hur du tänkt. The final stage are a few interviews. Den tredje och sista fasen består av ett par intervjuer. All our open positions → Alla lediga tjänster → .we-love-building { fill: #ff4b00; width: 1.2em; height: 1.2em; animation: 1.6s ease we-love-building-heart-beat; animation-iteration-count: infinite; animation-direction: alternate-reverse; } .dark .we-love-building { fill: #f6682d; } @keyframes we-love-building-heart-beat { from { transform: scale(1.2); } to { transform: scale(1); } } We love building"
    },
    {
        "title": "Frontend Developer Internship",
        "description": "Frontend Developer Internship, Spring 2021",
        "url": "/jobs/2021/spring/frontend-developer-internship.html",
        "content": "Frontend Developer Frontendutvecklare You can no longer apply for this position. You can find all our open positions here. Den här tjänsten går inte längre att söka. Alla våra lediga tjänster finns annonserade här. Spring 2021 Våren 2021 Learnpoint is an integrated LMS and SIS made for teachers, students, and school managers. The Learnpoint team is on a mission to simplify education and we have an internship position open for 1-2 frontend developers during spring 2021. Learnpoint är ett integrerat LMS och administrativt system för lärare, studenter, och skolledare. Vår mission är att förenkla utbildning och vi har en praktikplats öppen för 1-2 frontendutvecklare under våren 2021. About the Internship Om praktiken The main task will be to design and implement an application. The first step will be to discuss and choose which application that fits based on the length of the internship, your skillset and our organizational needs. You will make a demo of the application at the end of the intership. Praktikens huvudsakliga uppdrag är att designa och implementera en applikation. Första steget är att diskutera och bestämma vilken applikation som passar utifrån praktikens längd, dina förkunskaper och verksamhetens behov, och sedan avslutas praktiken med att du presenterar applikationen. In addition to the main task, you will also participate in some meetings and workshops. Utöver det huvudsakliga uppdraget kommer du även delta i några arbetsmöten och workshops. You'll have access to a supervisor throughout the internship. Du har tillgång till en handledare under hela praktiken. The internship is 2-6 months and takes place during spring 2021. Praktiken genomförs under våren 2021 och är 2-6 månader. We encourage you to apply together with someone else. The task can be done by a single trainee, but two would be even better. Vi ser helst att du genomför praktiken tillsammans med en annan praktikant. Uppdraget går att genomföra individuellt, men det fungerar bättre om ni är två som genomför det. Our team don't share an office, so you will work remote. Vi har inget gemensamt kontor, så allt arbete genomförs på distans. About Us Om oss Learnpoint is part of the edtech company ViaEcole. We're a customer focused company with two products — Learnpoint and yh-antagning.se. Learnpoint är en del av edtech bolaget ViaEcole. Vi är ett kundorienterat bolag med två produkter — Learnpoint och yh-antagning.se. About You Om dig You are truly interested in frontend development, but you're also interested in users. How do they think, what's difficult for them, and what do the like? You understand that a good application is as much about code as it is about humans. Du är genuint intresserad av frontendutveckling, men du är även intresserad av användare. Hur tänker dom, vad tycker dom är svårt och vad gillar dom? Du förstår att en bra applikation handlar lika mycket om kod som om människor. You are interested in results and answers, but perhaps equally interested in questions. You are curious to the bone and you love learning. You understand that there is no simple prescription when it comes to developing good applications, and you're eager to figure out how it should be done. Du är intresserad av resultat och svar, men kanske lika intresserad av frågor. Du är genuint nyfiken och älskar lärande. Du förstår att det inte finns något färdig framgånsrecept när man skall utveckla applikationer, och du drivs av att själv ta reda på hur man ska göra. You are proficient in HTML, CSS, and JavaScript. Du behärskar HTML, CSS, och JavaScript. How to Apply Sök praktikplatsen Write an application where you tell us about yourself and your interest in education and frontend development. Attach CV and portfolio. Indicate if you apply together with another trainee. Send your application to karl.west@viaecole.se Skriv en ansökan där du beskriver dig själv och ditt intresse för utbildning och frontendutveckling. Bifoga CV och portfolio. Ange om du söker praktiken tillsammans med någon annan. Skicka din ansökan till karl.west@viaecole.se What happens next? Vad är nästa steg? When we've reviewed your application, you'll hear from us within a week about advancement to the development challange stage. När vi läst igenom din ansökan, meddelar vi dig inom en vecka om du gått vidare till nästa fas i processen som är ett utvecklingsprov. The development challenge is an at-home assignment. You will design and implement a small component and document your working process. Utvecklingsprovet genomförs på distans. Du får i uppdrag att designa och implementera en komponent samt dokumentera din process och beskriva hur du tänkt. The final stage are a few interviews. Den tredje och sista fasen består av ett par intervjuer. All our open positions → Alla lediga tjänster → .we-love-building { fill: #ff4b00; width: 1.2em; height: 1.2em; animation: 1.6s ease we-love-building-heart-beat; animation-iteration-count: infinite; animation-direction: alternate-reverse; } .dark .we-love-building { fill: #f6682d; } @keyframes we-love-building-heart-beat { from { transform: scale(1.2); } to { transform: scale(1); } } We love building"
    },
    {
        "title": "Backend Developer Internship",
        "description": "Backend Developer Internship, Autumn 2022",
        "url": "/jobs/2022/autumn/backend-developer-internship.html",
        "content": "Backend Developer Backendutvecklare You can no longer apply for this position. You can find all our open positions here. Den här tjänsten går inte längre att söka. Alla våra lediga tjänster finns annonserade här. Autumn 2022 Hösten 2022 Learnpoint is an integrated LMS and SIS made for teachers, students, and school managers. The Learnpoint team is on a mission to simplify education and we have an internship position open for 1-2 backend developers during spring 2022. Learnpoint är ett integrerat LMS och administrativt system för lärare, studenter, och skolledare. Vår mission är att förenkla utbildning och vi har en praktikplats öppen för 1-2 backendutvecklare under hösten 2022. About the Internship Om praktiken The main task will be to build an application or service. The first step will be to discuss and choose which application or service that fits based on the length of the internship, your skillset and our organizational needs. You will make a demo of the application or service at the end of the intership. Praktikens huvudsakliga uppdrag är att bygga en applikation eller en service. Första steget är att diskutera och bestämma vilken applikation eller service som passar utifrån praktikens längd, dina förkunskaper och verksamhetens behov, och sedan avslutas praktiken med att du presenterar applikationen eller servicen. In addition to the main task, you will also participate in some meetings and workshops. Utöver det huvudsakliga uppdraget kommer du även delta i några arbetsmöten och workshops. You'll have access to a supervisor throughout the internship. Du har tillgång till en handledare under hela praktiken. The internship is 2-6 months and takes place during spring 2022. Praktiken genomförs under hösten 2022 och är 2-6 månader. We encourage you to apply together with someone else. The task can be done by a single trainee, but two would be even better. Vi ser helst att du genomför praktiken tillsammans med en annan praktikant. Uppdraget går att genomföra individuellt, men det fungerar bättre om ni är två som genomför det. Our team don't share an office, so you will work remote. Vi har inget gemensamt kontor, så allt arbete genomförs på distans. About Us Om oss Learnpoint is part of the edtech company ViaEcole. We're a customer focused company with two products — Learnpoint and yh-antagning.se. Learnpoint är en del av edtech bolaget ViaEcole. Vi är ett kundorienterat bolag med två produkter — Learnpoint och yh-antagning.se. About You Om dig You are truly interested in finding solutions. Both for technical problems and how to make the application faster and more reliable for the user. Du är genuint intresserad av att hitta lösningar. Både för tekniska problem och hur du ska göra en applikation snabbare och mer tillförlitlig för användarna. You are interested in results and answers, but perhaps equally interested in questions. You are curious to the bone and you love learning. You understand that there is no simple prescription when it comes to developing good applications, and you're eager to figure out how it should be done. Du är intresserad av resultat och svar, men kanske lika intresserad av frågor. Du är genuint nyfiken och älskar lärande. Du förstår att det inte finns något färdig framgånsrecept när man skall utveckla applikationer, och du drivs av att själv ta reda på hur man ska göra. You are proficient in .NET, C#, and SQL. Du behärskar .NET, C#, and SQL. How to Apply Sök praktikplatsen Write an application where you tell us about yourself and your interest in education and backend development. Attach CV and portfolio. Indicate if you apply together with another trainee. Send your application to martin.vehmas@viaecole.se Skriv en ansökan där du beskriver dig själv och ditt intresse för utbildning och backendutveckling. Bifoga CV och portfolio. Ange om du söker praktiken tillsammans med någon annan. Skicka din ansökan till martin.vehmas@viaecole.se What happens next? Vad är nästa steg? When we've reviewed your application, you'll hear from us within a week about advancement to the development challange stage. När vi läst igenom din ansökan, meddelar vi dig inom en vecka om du gått vidare till nästa fas i processen som är ett utvecklingsprov. The development challenge is an at-home assignment. You will extend an existing web application and document your working process. Utvecklingsprovet genomförs på distans. Du får i uppdrag att vidareutveckla en befintlig webbapplikation samt dokumentera din process och beskriva hur du tänkt. The final stage are a few interviews. Den tredje och sista fasen består av ett par intervjuer. All our open positions → Alla lediga tjänster → .we-love-building { fill: #ff4b00; width: 1.2em; height: 1.2em; animation: 1.6s ease we-love-building-heart-beat; animation-iteration-count: infinite; animation-direction: alternate-reverse; } .dark .we-love-building { fill: #f6682d; } @keyframes we-love-building-heart-beat { from { transform: scale(1.2); } to { transform: scale(1); } } We love building"
    },
    {
        "title": "Customer Support Agent Internship",
        "description": "Customer Support Agent Internship, Autumn 2022",
        "url": "/jobs/2022/autumn/customer-support-agent-internship.html",
        "content": "Customer Support Agent Customer Support Agent You can no longer apply for this position. You can find all our open positions here. Den här tjänsten går inte längre att söka. Alla våra lediga tjänster finns annonserade här. Autumn 2022 Hösten 2022 Learnpoint is an integrated LMS and SIS made for teachers, students, and school managers. The Learnpoint team is on a mission to simplify education and we have an internship position open for a Customer Support Agent during autumn 2022. Learnpoint är ett integrerat LMS och administrativt system för lärare, studenter, och skolledare. Vår mission är att förenkla utbildning och vi har en praktikplats öppen för en Customer Support Agent under hösten 2022. About the Internship Om praktikplatsen Your main task will be to work with product support. You will be a member of our Customer Success team that is responsible for customer onboarding and product support. Towards the end of your internship you will make a presentation and a report. Ditt primära uppdrag är att arbeta med kundsupport. Du kommer vara en del av vårt Customer Success-team som ansvarar för att utbilda nya kunder och ge produktsupport. Praktiken avslutas med att du skriver en rapport och håller en presentation. You will have a supervisor that you have daily contact with throughout the whole internship. Du kommer att få en handledare som du har daglig kontakt med under hela praktiken. The internship is 2-6 months and takes place during autumn 2022. Praktiken utförs under hösten 2022 och är 2-6 månader lång. The internship is remote. Praktiken sker på distans. About Us Om oss Learnpoint is part of the edtech company ViaEcole. We are a customer focused company with two products — Learnpoint and yh-antagning.se. Learnpoint är en del av edtech bolaget ViaEcole. Vi är ett kundorienterat bolag med två produkter — Learnpoint och yh-antagning.se. About You Om dig You are interested in technology, but your passion is communicating with people. You are a positive person who is dedicated to finding solutions and helping others. We find the right attitude and motivation more important than experience. Du gillar teknik, men älskar att kommunicera med människor. Du är en positiv person som gillar att hitta lösningar och hjälpa andra. För oss är rätt inställning och motivation viktigare än erfarenhet. You have excellent verbal and written Swedish skills. Du talar och skriver utmärkt svenska. How to Apply Hur du ansöker We want you to write a letter where you introduce yourself to us and tell us why you want this internship. We appreciate honesty and passion. Skriv ett brev där du berättar om dig själv och varför du vill ha just den här praktikplatsen. Vi uppskattar engagemang och ärlighet. Tell us about: Berätta: Why you want to work in customer service/customer support. Varför du vill jobba med kundservice/kundsupport. A description of a great customer service/customer support experience you have had, and what made it great. En väldigt bra kundservice-/kundsupportupplevelse du har haft och vad som gjorde den bra. A time you taught yourself a new skill. När du lärde dig något nytt. Send your application to martin.tholsby@viaecole.se Skicka din ansöka till martin.tholsby@viaecole.se What happens next? Vad är nästa steg? When we have reviewed your application, you will hear from us within a week about advancement to the next stage which is a written assignment. The final stage includes interviews with members of our Customer Success team. När vi läst igenom din ansökan, meddelar vi dig inom en vecka om du har gått vidare till nästa steg i processen som är en skriftlig uppgift. Sista steget är att bli intervjuad av medlemmar i vårt Customer Success-team. All our open positions → Alla lediga tjänster → .we-love-building { fill: #ff4b00; width: 1.2em; height: 1.2em; animation: 1.6s ease we-love-building-heart-beat; animation-iteration-count: infinite; animation-direction: alternate-reverse; } .dark .we-love-building { fill: #f6682d; } @keyframes we-love-building-heart-beat { from { transform: scale(1.2); } to { transform: scale(1); } } We love building"
    },
    {
        "title": "Backend Developer Internship",
        "description": "Backend Developer Internship, Spring 2022",
        "url": "/jobs/2022/spring/backend-developer-internship.html",
        "content": "Backend Developer Backendutvecklare You can no longer apply for this position. You can find all our open positions here. Den här tjänsten går inte längre att söka. Alla våra lediga tjänster finns annonserade här. Spring 2022 Våren 2022 Learnpoint is an integrated LMS and SIS made for teachers, students, and school managers. The Learnpoint team is on a mission to simplify education and we have an internship position open for 1-2 backend developers during spring 2022. Learnpoint är ett integrerat LMS och administrativt system för lärare, studenter, och skolledare. Vår mission är att förenkla utbildning och vi har en praktikplats öppen för 1-2 backendutvecklare under våren 2022. About the Internship Om praktiken The main task will be to build an application or service. The first step will be to discuss and choose which application or service that fits based on the length of the internship, your skillset and our organizational needs. You will make a demo of the application or service at the end of the intership. Praktikens huvudsakliga uppdrag är att bygga en applikation eller en service. Första steget är att diskutera och bestämma vilken applikation eller service som passar utifrån praktikens längd, dina förkunskaper och verksamhetens behov, och sedan avslutas praktiken med att du presenterar applikationen eller servicen. In addition to the main task, you will also participate in some meetings and workshops. Utöver det huvudsakliga uppdraget kommer du även delta i några arbetsmöten och workshops. You'll have access to a supervisor throughout the internship. Du har tillgång till en handledare under hela praktiken. The internship is 2-6 months and takes place during spring 2022. Praktiken genomförs under våren 2022 och är 2-6 månader. We encourage you to apply together with someone else. The task can be done by a single trainee, but two would be even better. Vi ser helst att du genomför praktiken tillsammans med en annan praktikant. Uppdraget går att genomföra individuellt, men det fungerar bättre om ni är två som genomför det. Our team don't share an office, so you will work remote. Vi har inget gemensamt kontor, så allt arbete genomförs på distans. About Us Om oss Learnpoint is part of the edtech company ViaEcole. We're a customer focused company with two products — Learnpoint and yh-antagning.se. Learnpoint är en del av edtech bolaget ViaEcole. Vi är ett kundorienterat bolag med två produkter — Learnpoint och yh-antagning.se. About You Om dig You are truly interested in finding solutions. Both for technical problems and how to make the application faster and more reliable for the user. Du är genuint intresserad av att hitta lösningar. Både för tekniska problem och hur du ska göra en applikation snabbare och mer tillförlitlig för användarna. You are interested in results and answers, but perhaps equally interested in questions. You are curious to the bone and you love learning. You understand that there is no simple prescription when it comes to developing good applications, and you're eager to figure out how it should be done. Du är intresserad av resultat och svar, men kanske lika intresserad av frågor. Du är genuint nyfiken och älskar lärande. Du förstår att det inte finns något färdig framgånsrecept när man skall utveckla applikationer, och du drivs av att själv ta reda på hur man ska göra. You are proficient in .NET, C#, and SQL. Du behärskar .NET, C#, and SQL. How to Apply Sök praktikplatsen Write an application where you tell us about yourself and your interest in education and backend development. Attach CV and portfolio. Indicate if you apply together with another trainee. Send your application to martin.vehmas@viaecole.se Skriv en ansökan där du beskriver dig själv och ditt intresse för utbildning och backendutveckling. Bifoga CV och portfolio. Ange om du söker praktiken tillsammans med någon annan. Skicka din ansökan till martin.vehmas@viaecole.se What happens next? Vad är nästa steg? When we've reviewed your application, you'll hear from us within a week about advancement to the development challange stage. När vi läst igenom din ansökan, meddelar vi dig inom en vecka om du gått vidare till nästa fas i processen som är ett utvecklingsprov. The development challenge is an at-home assignment. You will extend an existing web application and document your working process. Utvecklingsprovet genomförs på distans. Du får i uppdrag att vidareutveckla en befintlig webbapplikation samt dokumentera din process och beskriva hur du tänkt. The final stage are a few interviews. Den tredje och sista fasen består av ett par intervjuer. All our open positions → Alla lediga tjänster → .we-love-building { fill: #ff4b00; width: 1.2em; height: 1.2em; animation: 1.6s ease we-love-building-heart-beat; animation-iteration-count: infinite; animation-direction: alternate-reverse; } .dark .we-love-building { fill: #f6682d; } @keyframes we-love-building-heart-beat { from { transform: scale(1.2); } to { transform: scale(1); } } We love building"
    },
    {
        "title": "Frontend Developer Internship",
        "description": "Frontend Developer Internship, Spring 2022",
        "url": "/jobs/2022/spring/frontend-developer-internship.html",
        "content": "Frontend Developer Frontendutvecklare You can no longer apply for this position. You can find all our open positions here. Den här tjänsten går inte längre att söka. Alla våra lediga tjänster finns annonserade här. Spring 2022 Våren 2022 Learnpoint is an integrated LMS and SIS made for teachers, students, and school managers. The Learnpoint team is on a mission to simplify education and we have internship positions open for frontend developers during spring 2022. Learnpoint är ett integrerat LMS och administrativt system för lärare, studenter, och skolledare. Vår mission är att förenkla utbildning och vi har praktikplatser öppna för frontendutvecklare under våren 2022. About the Internship Om praktiken The main task will be to design and implement an application. The first step is to discuss and decide which application to build, based on the length of the internship, your skillset and our organizational needs. You will make a demo at the end of the intership. Praktikens primära uppdrag är designa och implementera en applikation. Första steget blir att diskutera och bestämma vilken applikation som skall utvecklas, utifrån praktikens längd, dina förkunskaper och verksamhetens behov. Praktiken avslutas med en presentation. In addition to the main task, you'll also participate in a few meetings and workshops. Utöver det primära uppdraget kommer du även delta i några arbetsmöten och workshops. You'll have access to a supervisor throughout the whole internship. You'll meet with the supervisor at least once every week. Du har tillgång till en handledare under hela praktiken. Ni träffas minst en gång per vecka. The internship is 2-6 months and takes place during spring 2022. Praktiken utförs under våren 2022 och är 2-6 månader. The internship is a team effort. You should apply together with at least one other intern. Praktiken är ett teamarbete. Du skall söka praktikplatsen tillsammans med en eller flera andra praktikanter. The internship is remote. Praktiken sker på distans. About Us Om oss Learnpoint is part of the edtech company ViaEcole. We're a customer focused company with two products — Learnpoint and yh-antagning.se. Learnpoint är en del av edtech bolaget ViaEcole. Vi är ett kundorienterat bolag med två produkter — Learnpoint och yh-antagning.se. About You Om dig You are truly interested in frontend development, but you're also interested in users. How do they think, what's difficult for them, and what do they like? You understand that a usable application is as much about code as it is about humans. Du är genuint intresserad av frontendutveckling, men du är också intresserad av slutanvändare. Hur tänker dom, vad tycker dom är svårt och vad gillar dom? Du förstår att en användarvänlig applikation handlar lika mycket om kod som om människor. You want to achieve results, but you're also interested in questions. You are curious, you love learning, and you understand there's no simple prescription for designing user friendly applications. Du vill uppnå resultat, men du är också intresserad av frågor. Du är nyfiken, älskar lärande och förstår att det inte finns något färdig recept för att designa användarvänliga applikationer. You are proficient in HTML, CSS, and JavaScript. Du behärskar HTML, CSS, och JavaScript. How to Apply Sök praktikplatsen Write an application where you tell us about yourself and your interest in education, learning, and frontend development. Attach CV and portfolio. Make sure to mention the other interns you are applying with. Send your application to karl.west@viaecole.se Skriv en ansökan där du beskriver dig själv och ditt intresse för utbildning, lärande och frontendutveckling. Bifoga CV och portfolio. Ange vem eller vilka du söker tillsammans med. Skicka din ansökan till karl.west@viaecole.se What happens next? Vad är nästa steg? When we've reviewed your application, you'll hear from us within a week about advancement to an interview. När vi läst igenom din ansökan, meddelar vi dig inom en vecka om du gått vidare till intervju. During the interview you'll tell us more about yourself and your interest in education, learning and frontend development. We'll explain the internship in detail and at the end of the interview we'll agree upon how to move forward together. Under intervjun får du berätta mer om dig själv och ditt intresse för utbildning, lärande och frontendutveckling. Vi beskriver praktiken lite mer detaljerat och i slutet av intervjun kommer vi överens om hur vi går vidare tillsammans. All our open positions → Alla lediga tjänster → .we-love-building { fill: #ff4b00; width: 1.2em; height: 1.2em; animation: 1.6s ease we-love-building-heart-beat; animation-iteration-count: infinite; animation-direction: alternate-reverse; } .dark .we-love-building { fill: #f6682d; } @keyframes we-love-building-heart-beat { from { transform: scale(1.2); } to { transform: scale(1); } } We love building"
    },
    {
        "title": "Backend Developer Internship",
        "description": "Backend Developer Internship, Autumn 2023",
        "url": "/jobs/2023/autumn/backend-developer-internship.html",
        "content": "Backend Developer Backendutvecklare You can no longer apply for this position. You can find all our open positions here. Den här tjänsten går inte längre att söka. Alla våra lediga tjänster finns annonserade här. Autumn 2023 Hösten 2023 Learnpoint is an integrated LMS and SIS made for teachers, students, and school managers. The Learnpoint team is on a mission to simplify education and we have an internship position open for 1-4 backend developers during autumn 2023. Learnpoint är ett integrerat LMS och administrativt system för lärare, studenter, och skolledare. Vår mission är att förenkla utbildning och vi har en praktikplats öppen för 1-4 backendutvecklare under hösten 2023. About the Internship Om praktiken The main task will be to build an application or service. The first step will be to discuss and choose which application or service that fits based on the length of the internship, your skillset and our organizational needs. You will make a demo of the application or service at the end of the intership. Praktikens huvudsakliga uppdrag är att bygga en applikation eller en service. Första steget är att diskutera och bestämma vilken applikation eller service som passar utifrån praktikens längd, dina förkunskaper och verksamhetens behov, och sedan avslutas praktiken med att du presenterar applikationen eller servicen. In addition to the main task, you will also participate in some meetings and workshops. Utöver det huvudsakliga uppdraget kommer du även delta i några arbetsmöten och workshops. You'll have access to a supervisor throughout the internship. Du har tillgång till en handledare under hela praktiken. The internship is 2-6 months and takes place during autumn 2023. Praktiken genomförs under hösten 2023 och är 2-6 månader. We encourage you to apply together with someone else. The task can be done by a single trainee, but two would be even better. Vi ser helst att du genomför praktiken tillsammans med en annan praktikant. Uppdraget går att genomföra individuellt, men det fungerar bättre om ni är två som genomför det. Our team don't share an office, so you will work remote. Vi har inget gemensamt kontor, så allt arbete genomförs på distans. About Us Om oss We're a customer focused edtech company. In addition to Learnpoint, we're also developing the product yh-antagning.se. Vi är ett kundorienterat edtech bolag. Förutom Learnpoint utvecklar vi även produkten yh-antagning.se. About You Om dig You are truly interested in finding solutions. Both for technical problems and how to make the application faster and more reliable for the user. Du är genuint intresserad av att hitta lösningar. Både för tekniska problem och hur du ska göra en applikation snabbare och mer tillförlitlig för användarna. You are interested in results and answers, but perhaps equally interested in questions. You are curious to the bone and you love learning. You understand that there is no simple prescription when it comes to developing good applications, and you're eager to figure out how it should be done. Du är intresserad av resultat och svar, men kanske lika intresserad av frågor. Du är genuint nyfiken och älskar lärande. Du förstår att det inte finns något färdig framgånsrecept när man skall utveckla applikationer, och du drivs av att själv ta reda på hur man ska göra. You are proficient in .NET, C#, and SQL. Du behärskar .NET, C#, and SQL. How to Apply Sök praktikplatsen Write an application where you tell us about yourself and your interest in education and backend development. Attach CV and portfolio. Indicate if you apply together with another trainee. Send your application to martin.vehmas@learnpoint.se Skriv en ansökan där du beskriver dig själv och ditt intresse för utbildning och backendutveckling. Bifoga CV och portfolio. Ange om du söker praktiken tillsammans med någon annan. Skicka din ansökan till martin.vehmas@learnpoint.se What happens next? Vad är nästa steg? When we've reviewed your application, you'll hear from us within a week about advancement to the development challange stage. När vi läst igenom din ansökan, meddelar vi dig inom en vecka om du gått vidare till nästa fas i processen som är ett utvecklingsprov. The development challenge is an at-home assignment. You will extend an existing web application and document your working process. Utvecklingsprovet genomförs på distans. Du får i uppdrag att vidareutveckla en befintlig webbapplikation samt dokumentera din process och beskriva hur du tänkt. The final stage are a few interviews. Den tredje och sista fasen består av ett par intervjuer. All our open positions → Alla lediga tjänster → .we-love-building { fill: #ff4b00; width: 1.2em; height: 1.2em; animation: 1.6s ease we-love-building-heart-beat; animation-iteration-count: infinite; animation-direction: alternate-reverse; } .dark .we-love-building { fill: #f6682d; } @keyframes we-love-building-heart-beat { from { transform: scale(1.2); } to { transform: scale(1); } } We love building"
    },
    {
        "title": "Frontend Developer Internship",
        "description": "Frontend Developer Internship, Autumn 2023",
        "url": "/jobs/2023/autumn/frontend-developer-internship.html",
        "content": "Frontend Developer Frontendutvecklare You can no longer apply for this position. You can find all our open positions here. Den här tjänsten går inte längre att söka. Alla våra lediga tjänster finns annonserade här. Autumn 2023 Hösten 2023 Learnpoint is an integrated LMS and SIS made for teachers, students, and school managers. The Learnpoint team is on a mission to simplify education and we have internship positions open for frontend developers during autumn 2023. Learnpoint är ett integrerat LMS och administrativt system för lärare, studenter, och skolledare. Vår mission är att förenkla utbildning och vi har praktikplatser öppna för frontendutvecklare under hösten 2023. About the Internship Om praktiken The main task will be to design and implement an application. The first step is to discuss and decide which application to build, based on the length of the internship, your skillset and our organizational needs. You will make a demo at the end of the intership. Praktikens primära uppdrag är designa och implementera en applikation. Första steget blir att diskutera och bestämma vilken applikation som skall utvecklas, utifrån praktikens längd, dina förkunskaper och verksamhetens behov. Praktiken avslutas med en presentation. In addition to the main task, you'll also participate in a few meetings and workshops. Utöver det primära uppdraget kommer du även delta i några arbetsmöten och workshops. You'll have access to a supervisor throughout the whole internship. You'll meet with the supervisor at least once every week. Du har tillgång till en handledare under hela praktiken. Ni träffas minst en gång per vecka. The internship is 2-6 months and takes place during autumn 2023. Praktiken utförs under hösten 2023 och är 2-6 månader. The internship is a team effort. You should apply together with at least one other intern. Praktiken är ett teamarbete. Du skall söka praktikplatsen tillsammans med en eller flera andra praktikanter. The internship is remote. Praktiken sker på distans. About Us Om oss We're a customer focused edtech company. In addition to Learnpoint, we're also developing the product yh-antagning.se. Vi är ett kundorienterat edtech bolag. Förutom Learnpoint utvecklar vi även produkten yh-antagning.se. About You Om dig You are truly interested in frontend development, but you're also interested in users. How do they think, what's difficult for them, and what do they like? You understand that a great application is as much about humans as it is about code. Du är genuint intresserad av frontendutveckling, men du är också intresserad av användare. Hur tänker dom, vad tycker dom är svårt och vad gillar dom? Du förstår att en bra applikation handlar lika mycket om människor som om kod. You want to achieve results, but you're also interested in questions. You are curious, you love learning, and you understand there's no simple prescription for designing user friendly applications. Du vill uppnå resultat, men du är också intresserad av frågor. Du är nyfiken, älskar lärande och förstår att det finns inget färdigt recept för att designa användarvänliga applikationer. You are proficient in HTML, CSS, and JavaScript. Du behärskar HTML, CSS, och JavaScript. How to Apply Sök praktikplatsen Write an application where you tell us about yourself and your interest in education, learning, and frontend development. Attach CV and portfolio. Make sure to mention the other interns you are applying with. Send your application to karl.west@learnpoint.se Skriv en ansökan där du beskriver dig själv och ditt intresse för utbildning, lärande och frontendutveckling. Bifoga CV och portfolio. Ange vem eller vilka du söker tillsammans med. Skicka din ansökan till karl.west@learnpoint.se What happens next? Vad är nästa steg? When we've reviewed your application, you'll hear from us within a week about advancement to an interview. När vi läst igenom din ansökan, meddelar vi dig inom en vecka om du gått vidare till intervju. During the interview you'll tell us more about yourself and your interest in education, learning and frontend development. We'll explain the internship in detail and at the end of the interview we'll agree upon how to move forward together. Under intervjun får du berätta mer om dig själv och ditt intresse för utbildning, lärande och frontendutveckling. Vi beskriver praktiken lite mer detaljerat och i slutet av intervjun kommer vi överens om hur vi går vidare tillsammans. All our open positions → Alla lediga tjänster → .we-love-building { fill: #ff4b00; width: 1.2em; height: 1.2em; animation: 1.6s ease we-love-building-heart-beat; animation-iteration-count: infinite; animation-direction: alternate-reverse; } .dark .we-love-building { fill: #f6682d; } @keyframes we-love-building-heart-beat { from { transform: scale(1.2); } to { transform: scale(1); } } We love building"
    },
    {
        "title": "Frontend Developer Internship",
        "description": "Frontend Developer Internship, Spring 2023",
        "url": "/jobs/2023/spring/frontend-developer-internship.html",
        "content": "Frontend Developer Frontendutvecklare You can no longer apply for this position. You can find all our open positions here. Den här tjänsten går inte längre att söka. Alla våra lediga tjänster finns annonserade här. Spring 2023 Våren 2023 Learnpoint is an integrated LMS and SIS made for teachers, students, and school managers. The Learnpoint team is on a mission to simplify education and we have internship positions open for frontend developers during spring 2023. Learnpoint är ett integrerat LMS och administrativt system för lärare, studenter, och skolledare. Vår mission är att förenkla utbildning och vi har praktikplatser öppna för frontendutvecklare under våren 2023. About the Internship Om praktiken The main task will be to design and implement an application. The first step is to discuss and decide which application to build, based on the length of the internship, your skillset and our organizational needs. You will make a demo at the end of the intership. Praktikens primära uppdrag är designa och implementera en applikation. Första steget blir att diskutera och bestämma vilken applikation som skall utvecklas, utifrån praktikens längd, dina förkunskaper och verksamhetens behov. Praktiken avslutas med en presentation. In addition to the main task, you'll also participate in a few meetings and workshops. Utöver det primära uppdraget kommer du även delta i några arbetsmöten och workshops. You'll have access to a supervisor throughout the whole internship. You'll meet with the supervisor at least once every week. Du har tillgång till en handledare under hela praktiken. Ni träffas minst en gång per vecka. The internship is 2-6 months and takes place during spring 2023. Praktiken utförs under våren 2023 och är 2-6 månader. The internship is a team effort. You should apply together with at least one other intern. Praktiken är ett teamarbete. Du skall söka praktikplatsen tillsammans med en eller flera andra praktikanter. The internship is remote. Praktiken sker på distans. About Us Om oss Learnpoint is part of the edtech company ViaEcole. We're a customer focused company with two products — Learnpoint and yh-antagning.se. Learnpoint är en del av edtech bolaget ViaEcole. Vi är ett kundorienterat bolag med två produkter — Learnpoint och yh-antagning.se. About You Om dig You are truly interested in frontend development, but you're also interested in users. How do they think, what's difficult for them, and what do they like? You understand that a great application is as much about humans as it is about code. Du är genuint intresserad av frontendutveckling, men du är också intresserad av slutanvändare. Hur tänker dom, vad tycker dom är svårt och vad gillar dom? Du förstår att en bra applikation handlar lika mycket om människor som om kod. You want to achieve results, but you're also interested in questions. You are curious, you love learning, and you understand there's no simple prescription for designing user friendly applications. Du vill uppnå resultat, men du är också intresserad av frågor. Du är nyfiken, älskar lärande och förstår att det inte finns något färdigt recept för att designa användarvänliga applikationer. You are proficient in HTML, CSS, and JavaScript. Du behärskar HTML, CSS, och JavaScript. How to Apply Sök praktikplatsen Write an application where you tell us about yourself and your interest in education, learning, and frontend development. Attach CV and portfolio. Make sure to mention the other interns you are applying with. Send your application to karl.west@learnpoint.se Skriv en ansökan där du beskriver dig själv och ditt intresse för utbildning, lärande och frontendutveckling. Bifoga CV och portfolio. Ange vem eller vilka du söker tillsammans med. Skicka din ansökan till karl.west@learnpoint.se What happens next? Vad är nästa steg? When we've reviewed your application, you'll hear from us within a week about advancement to an interview. När vi läst igenom din ansökan, meddelar vi dig inom en vecka om du gått vidare till intervju. During the interview you'll tell us more about yourself and your interest in education, learning and frontend development. We'll explain the internship in detail and at the end of the interview we'll agree upon how to move forward together. Under intervjun får du berätta mer om dig själv och ditt intresse för utbildning, lärande och frontendutveckling. Vi beskriver praktiken lite mer detaljerat och i slutet av intervjun kommer vi överens om hur vi går vidare tillsammans. All our open positions → Alla lediga tjänster → .we-love-building { fill: #ff4b00; width: 1.2em; height: 1.2em; animation: 1.6s ease we-love-building-heart-beat; animation-iteration-count: infinite; animation-direction: alternate-reverse; } .dark .we-love-building { fill: #f6682d; } @keyframes we-love-building-heart-beat { from { transform: scale(1.2); } to { transform: scale(1); } } We love building"
    },
    {
        "title": "Marketing Internship",
        "description": "Marketing Internship, Spring 2023",
        "url": "/jobs/2023/spring/marketing-internship.html",
        "content": "Marketing Internship Marknadsförare You can no longer apply for this position. You can find all our open positions here. Den här tjänsten går inte längre att söka. Alla våra lediga tjänster finns annonserade här. Spring 2023 Våren 2023 Learnpoint is an integrated LMS and SIS made for teachers, students, and school managers. The Learnpoint team is on a mission to simplify education and we have internship positions open for marketers during spring 2023. Learnpoint är ett integrerat LMS och administrativt system för lärare, studenter, och skolledare. Vår mission är att förenkla utbildning och vi har praktikplatser öppna för marknadsförare under våren 2023. About the Internship Om praktiken Great marketing starts with a strong brand. The first step is to analyze our company and our market. We'll then select a suitable project based on the length of your internship, your skillset and our organizational needs. The main task could be to optimize a site or design a marketing campaign. You will give a presentation at the end of the internship. Bra marknadsföring utgår alltid från varumärket. Första steget under praktiken är därför att genomföra en analys av oss och av vår marknad. Praktikens primära uppdrag diskuterar vi och bestämmer utifrån praktikens längd, dina förkunskaper och verksamhetens behov. Det kan exempelvis bli att optimera en sajt eller designa en marknadsföringskampanj. Praktiken avslutas med en presentation. You'll have access to a supervisor throughout the whole internship. You'll meet with the supervisor at least once every week. Du har tillgång till en handledare under hela praktiken. Ni träffas minst en gång per vecka. The internship is 2-6 months and takes place during spring 2023. Praktiken utförs under våren 2023 och är 2-6 månader. The internship is a team effort. You should apply together with at least one other intern. Praktiken är ett teamarbete. Du skall söka praktikplatsen tillsammans med en eller flera andra praktikanter. The internship is remote. Praktiken sker på distans. About Us Om oss Learnpoint is part of the edtech company ViaEcole. We're a group of thinkers and doers who love learning. Learnpoint är en del av edtech bolaget ViaEcole. Vi som jobbar på ViaEcole är nyfikna, resultatorienterade och älskar lärande. About You Om dig You want to be productive, but you're also interested in customer psychology and brand theory. Du gillar att producera kampanjer och analyser, men du är också intresserad av kundpsykologi och brandingteori. You want to achieve results, but you're also interested in questions. You are curious, you love learning, and you understand there's no simple prescription for how to build a great marketing campaign. Du vill uppnå resultat, men du är också intresserad av frågor. Du är nyfiken, älskar lärande och förstår att det inte finns något färdigt recept för att skapa en framgångsrik kampanj. How to Apply Sök praktikplatsen Write an application where you tell us about yourself and your interest in education, learning, branding, and marketing. Attach CV and portfolio. Make sure to mention the other interns you are applying with. Send your application to martin.tholsby@learnpoint.se Skriv en ansökan där du beskriver dig själv och ditt intresse för utbildning, lärande, branding och marknadsföring. Bifoga CV och portfolio. Ange vem eller vilka du söker tillsammans med. Skicka din ansökan till martin.tholsby@learnpoint.se What happens next? Vad är nästa steg? When we've reviewed your application, you'll hear from us within a week about advancement to an interview. När vi läst igenom din ansökan, meddelar vi dig inom en vecka om du gått vidare till intervju. During the interview you'll tell us more about yourself and your interest in education, learning, branding, and marketing. We'll explain the internship in detail and at the end of the interview we'll agree upon how to move forward together. Under intervjun får du berätta mer om dig själv och ditt intresse för utbildning, lärande, branding och marknadsföring. Vi beskriver praktiken lite mer detaljerat och i slutet av intervjun kommer vi överens om hur vi går vidare tillsammans. All our open positions → Alla lediga tjänster → .we-love-building { fill: #ff4b00; width: 1.2em; height: 1.2em; animation: 1.6s ease we-love-building-heart-beat; animation-iteration-count: infinite; animation-direction: alternate-reverse; } .dark .we-love-building { fill: #f6682d; } @keyframes we-love-building-heart-beat { from { transform: scale(1.2); } to { transform: scale(1); } } We love building"
    },
    {
        "title": "Backend Developer Internship",
        "description": "Backend Developer Internship, Autumn 2024",
        "url": "/jobs/2024/autumn/backend-developer-internship.html",
        "content": "Backend Developer Backendutvecklare You can no longer apply for this position. You can find all our open positions here. Den här tjänsten går inte längre att söka. Alla våra lediga tjänster finns annonserade här. Autumn 2024 Hösten 2024 Learnpoint is an integrated LMS and SIS made for teachers, students, and school managers. The Learnpoint team is on a mission to simplify education and we have an internship position open for 1-4 backend developers during autumn 2024. Learnpoint är ett integrerat LMS och administrativt system för lärare, studenter, och skolledare. Vår mission är att förenkla utbildning och vi har en praktikplats öppen för 1-4 backendutvecklare under hösten 2024. About the Internship Om praktiken The main task will be to build an application or service. The first step will be to discuss and choose which application or service that fits based on the length of the internship, your skillset and our organizational needs. You will make a demo of the application or service at the end of the intership. Praktikens huvudsakliga uppdrag är att bygga en applikation eller en service. Första steget är att diskutera och bestämma vilken applikation eller service som passar utifrån praktikens längd, dina förkunskaper och verksamhetens behov, och sedan avslutas praktiken med att du presenterar applikationen eller servicen. In addition to the main task, you will also participate in some meetings and workshops. Utöver det huvudsakliga uppdraget kommer du även delta i några arbetsmöten och workshops. You'll have access to a supervisor throughout the internship. Du har tillgång till en handledare under hela praktiken. The internship is 2-6 months and takes place during autumn 2024. Praktiken genomförs under hösten 2024 och är 2-6 månader. We encourage you to apply together with someone else. The task can be done by a single trainee, but two would be even better. Vi ser helst att du genomför praktiken tillsammans med en annan praktikant. Uppdraget går att genomföra individuellt, men det fungerar bättre om ni är två som genomför det. Our team don't share an office, so you will work remote. Vi har inget gemensamt kontor, så allt arbete genomförs på distans. About Us Om oss We're a customer focused edtech company. In addition to Learnpoint, we're also developing the product yh-antagning.se. Vi är ett kundorienterat edtech bolag. Förutom Learnpoint utvecklar vi även produkten yh-antagning.se. About You Om dig You are truly interested in finding solutions. Both for technical problems and how to make the application faster and more reliable for the user. Du är genuint intresserad av att hitta lösningar. Både för tekniska problem och hur du ska göra en applikation snabbare och mer tillförlitlig för användarna. You are interested in results and answers, but perhaps equally interested in questions. You are curious to the bone and you love learning. You understand that there is no simple prescription when it comes to developing good applications, and you're eager to figure out how it should be done. Du är intresserad av resultat och svar, men kanske lika intresserad av frågor. Du är genuint nyfiken och älskar lärande. Du förstår att det inte finns något färdig framgånsrecept när man skall utveckla applikationer, och du drivs av att själv ta reda på hur man ska göra. You are proficient in .NET, C#, and SQL. Du behärskar .NET, C#, and SQL. How to Apply Sök praktikplatsen Write an application where you tell us about yourself and your interest in education and backend development. Attach CV and portfolio. Indicate if you apply together with another trainee. Send your application to martin.vehmas@learnpoint.se Skriv en ansökan där du beskriver dig själv och ditt intresse för utbildning och backendutveckling. Bifoga CV och portfolio. Ange om du söker praktiken tillsammans med någon annan. Skicka din ansökan till martin.vehmas@learnpoint.se What happens next? Vad är nästa steg? When we've reviewed your application, you'll hear from us within a week about advancement to the development challange stage. När vi läst igenom din ansökan, meddelar vi dig inom en vecka om du gått vidare till nästa fas i processen som är ett utvecklingsprov. The development challenge is an at-home assignment. You will extend an existing web application and document your working process. Utvecklingsprovet genomförs på distans. Du får i uppdrag att vidareutveckla en befintlig webbapplikation samt dokumentera din process och beskriva hur du tänkt. The final stage are a few interviews. Den tredje och sista fasen består av ett par intervjuer. All our open positions → Alla lediga tjänster → .we-love-building { fill: #ff4b00; width: 1.2em; height: 1.2em; animation: 1.6s ease we-love-building-heart-beat; animation-iteration-count: infinite; animation-direction: alternate-reverse; } .dark .we-love-building { fill: #f6682d; } @keyframes we-love-building-heart-beat { from { transform: scale(1.2); } to { transform: scale(1); } } We love building"
    },
    {
        "title": "Frontend Developer Internship",
        "description": "Frontend Developer Internship at Learnpoint, Autumn 2024",
        "url": "/jobs/2024/autumn/frontend-developer-internship.html",
        "content": "Frontend Developer Frontendtvecklare You can no longer apply for this position. You can find all our open positions here. Den här tjänsten går inte längre att söka. Alla våra lediga tjänster finns annonserade här. Autumn 2024 Hösten 2024 Learnpoint är en omtyckt lärplattform som används av studenter, lärare och skolledare. Vår mission är att förenkla utbildning och vi har nu praktikplatser öppna för frontendutvecklare till hösten 2024. Learnpoint is a loved learning platform for students, teachers, and school managers. Our mission is to simplify education and we have internship positions open for frontend developers during autumn 2024. About the Internship Om praktiken The main task will be to design and implement an application. The first step is to discuss and decide which application to build, based on the length of the internship, your skillset and our organizational needs. At the end of the internship you'll write a public article and make a presentation. Praktikens primära uppdrag är designa och implementera en applikation. Första steget blir att diskutera och bestämma vilken applikation som skall utvecklas, utifrån praktikens längd, dina förkunskaper och verksamhetens behov. I slutet av praktiken skriver du en publik artikel och håller en presentation. In addition to the main task, you'll also participate in discussions, meetings and workshops. Utöver det primära uppdraget kommer du även delta i arbetsmöten, diskussioner och workshops. You'll have access to a mentor throughout the whole internship. You'll meet with the mentor at least once every week. Du har tillgång till en handledare under hela praktiken. Ni träffas minst en gång per vecka. The internship is 2-6 months and takes place during autumn 2024. Praktiken utförs under hösten 2024 och är 2-6 månader. The internship is a team effort. You should apply together with at least one other intern. Praktiken är ett teamarbete. Du skall söka praktikplatsen tillsammans med en eller flera andra praktikanter. The internship is remote. Praktiken sker på distans. About You Om dig You are truly interested in frontend development, but you're also interested in users. How do they think, what's difficult for them, and what do they like? You understand that a great product development is as much about humans as it is about code. Du är genuint intresserad av frontendutveckling, men du är också intresserad av användare. Hur tänker dom, vad tycker dom är svårt och vad gillar dom? Du förstår att en bra produkt handlar lika mycket om människor som om kod. You want to achieve results, but you're also interested in questions. You are curious, you love learning, and you understand there's no simple recipe for success. Du vill uppnå resultat, men du är också intresserad av frågor. Du är nyfiken, älskar lärande och förstår att det finns inget enkelt recept på framgång. You are proficient in HTML, CSS, and JavaScript. Du behärskar HTML, CSS, och JavaScript. How to Apply Sök praktikplatsen Write an application where you tell us about yourself and your interest in education, learning, and frontend development. Attach CV and portfolio. Make sure to mention the other interns you are applying with. Send your application to karl.west@learnpoint.se Skriv en ansökan där du beskriver dig själv och ditt intresse för utbildning, lärande och frontendutveckling. Bifoga CV och portfolio. Ange vem eller vilka du söker tillsammans med. Skicka din ansökan till karl.west@learnpoint.se What happens next? Vad är nästa steg? When we've reviewed your application, you'll hear from us within a week about advancement to an interview. När vi läst igenom din ansökan, meddelar vi dig inom en vecka om du gått vidare till intervju. During the interview you'll tell us more about yourself and your interest in education, learning and frontend development. We'll explain the internship in detail and at the end of the interview we'll agree upon how to move forward together. Under intervjun får du berätta mer om dig själv och ditt intresse för utbildning, lärande och frontendutveckling. Vi beskriver praktiken lite mer detaljerat och i slutet av intervjun kommer vi överens om hur vi går vidare tillsammans. All our open positions → Alla lediga tjänster → .we-love-building { fill: #ff4b00; width: 1.2em; height: 1.2em; animation: 1.6s ease we-love-building-heart-beat; animation-iteration-count: infinite; animation-direction: alternate-reverse; } .dark .we-love-building { fill: #f6682d; } @keyframes we-love-building-heart-beat { from { transform: scale(1.2); } to { transform: scale(1); } } We love building"
    },
    {
        "title": "Sales Representative Internship",
        "description": "Sales Representative at Learnpoint, Autumn 2024",
        "url": "/jobs/2024/autumn/sales-internship.html",
        "content": "Sales Representative Säljare You can no longer apply for this position. You can find all our open positions here. Den här tjänsten går inte längre att söka. Alla våra lediga tjänster finns annonserade här. Autumn 2024 Hösten 2024 Learnpoint is a loved learning platform for students, teachers, and school managers. Our mission is to simplify education and we have internship positions open for sales representatives during autumn 2024. Learnpoint är en omtyckt lärplattform som används av studenter, lärare och skolledare. Vår mission är att förenkla utbildning och vi har praktikplatser öppna för säljare under hösten 2024. About the Internship Om praktiken Praktiken inleds med att du får lära dig mer om vår marknad och våra produkter. Du kommer sedan bland annat få praktisera prospektering, utveckla säljpitcher, utveckla din förmåga att demonstrera våra produkter och delta i säljmöten. Praktiken avslutas med en presentation. During the internship, you'll start by familiarizing yourself with our market and products. You will then, among other things, practice prospecting, develop sales pitches, improve your ability to demonstrate our products, and participate in sales meetings. The internship concludes with a presentation. Du har tillgång till en handledare under hela praktiken. Ni träffas minst en gång per vecka. Du kommer även delta i arbetsmöten och workshops med andra kollegor i företaget. You'll have access to a supervisor throughout the whole internship. You'll meet with the supervisor at least once every week. You'll also participate in meetings and workshops with other colleagues within the company. Praktiken utförs under hösten 2024 och är 2-4 månader. The internship is 2-4 months and takes place during autumn 2024. Praktiken är ett teamarbete. Du kan antingen söka praktikplatsen tillsammans med en annan praktikant, eller låta oss para ihop dig med en annan praktikant senare. The internship is a team effort. You can either apply for the internship together with another intern, or let us pair you with another intern later on. Praktiken sker på distans. The internship is remote. Om dig About You Du gillar att bygga relationer med nya människor, lära dig nya saker och finner glädje i att hjälpa andra. You enjoy building relationships with new people, learning new things, and finding joy in helping others. Du vill uppnå resultat, men inser att långsiktigt hållbara försäljningsresultat inte kommer genom att välja den snabbaste vägen. I stället fokuserar du på att bygga förtroende genom att vara nyfiken, hjälpsam, uppriktig och uthållig. You want to achieve results but understand that long-term sustainable sales outcomes don't come from choosing the quickest path. Instead, you focus on building trust by being curious, helpful, genuine, and persistent. Sök praktikplatsen How to Apply Skriv en ansökan där du beskriver dig själv och ditt intresse för utbildning, lärande och försäljning. Bifoga CV. Ange vem eller vilka du söker tillsammans med. Skicka din ansökan till martin.tholsby@learnpoint.se Write an application where you tell us about yourself and your interest in education, learning, and sales. Attach CV. Make sure to mention the other interns you are applying with. Send your application to martin.tholsby@learnpoint.se Vad är nästa steg? What happens next? När vi läst igenom din ansökan, meddelar vi dig inom en vecka om du gått vidare till intervju. When we've reviewed your application, you'll hear from us within a week about advancement to an interview. Under intervjun får du berätta mer om dig själv och ditt intresse för utbildning, lärande och försäljning. Vi beskriver praktiken lite mer detaljerat och i slutet av intervjun kommer vi överens om hur vi går vidare tillsammans. During the interview you'll tell us more about yourself and your interest in education, learning, and sales. We'll explain the internship in detail and at the end of the interview we'll agree upon how to move forward together. Vi ser fram emot att höra från dig! We look forward to hearing from you! All our open positions → Alla lediga tjänster → .we-love-building { fill: #ff4b00; width: 1.2em; height: 1.2em; animation: 1.6s ease we-love-building-heart-beat; animation-iteration-count: infinite; animation-direction: alternate-reverse; } .dark .we-love-building { fill: #f6682d; } @keyframes we-love-building-heart-beat { from { transform: scale(1.2); } to { transform: scale(1); } } We love building"
    },
    {
        "title": "Sales Representative",
        "description": "Sales Representative at Learnpoint, Autumn 2024",
        "url": "/jobs/2024/autumn/sales-representative.html",
        "content": "Sales Representative Säljare You can no longer apply for this position. You can find all our open positions here. Den här tjänsten går inte längre att söka. Alla våra lediga tjänster finns annonserade här. Autumn 2024 Hösten 2024 Learnpoint is a beloved learning platform for students, teachers, and school managers. Our mission is to simplify education and we're now looking for a remote sales representative who enjoys building relationships and is interested in learning. Learnpoint är en mycket omtyckt lärplattform för studenter, lärare och skolledare. Vår mission är att förenkla utbildning och vi söker nu en säljare på distans som tycker om att bygga relationer och har ett intresse för lärande. About the job Om tjänsten You'll manage our entire sales process, from prospecting and initial contact to identifying needs, booking and giving demos, and closing deals. Initially, you'll handle parts of the process, gradually taking on full responsibility. The position also involves maintaining and developing relationships with existing customers. Du kommer att hantera hela vår säljprocess, från prospektering och första kontakt till att identifiera behov, boka och hålla demos, samt avsluta affärer. Till en början kommer du att ta hand om delar av processen, för att successivt ta över hela ansvaret. I tjänsten ingår också att underhålla och utveckla relationer med befintliga kunder. Your focus will be on schools and educational institutions offering adult education in Sweden. Sales cycles typically range from months to years. Du kommer att arbeta med skolor och utbildningsföretag inom vuxenutbildning i Sverige. Våra säljcykler varar vanligtvis från några månader upp till flera år. You'll be a member of our integrated Customer Success and Sales team, working collaboratively to create lasting customer satisfaction. We share insights from customer interactions, refine sales strategies and develop ways to improve the customer experience. You'll also regularly interact with our development teams. Everyone at the company is helpful and professional. Du blir en del av vårt integrerade Customer Success- och säljteam, som arbetar tillsammans för att skapa bestående kundnöjdhet. Vi delar erfarenheter från kundinteraktioner, förfinar säljstrategier och utvecklar sätt att förbättra kundupplevelsen. Du kommer också att ha regelbunden kontakt med våra utvecklingsteam. Alla hos oss är hjälpsamma och professionella. There is a structured career ladder for sales representatives with five levels, each level determining the salary, currently ranging from 31 824 SEK at the lowest to 72 930 SEK at the highest. Det finns en strukturerad karriärstege för säljare med fem nivåer, där nivån bestämmer lönen, som för närvarande är 31 824 SEK på den lägsta och 72 930 SEK på den högsta. The position is full-time, permanent, and remote. We put work and quality above meetings and politics. Read more about us, how we work, and our benefits. Tjänsten är på heltid, tillsvidare och helt på distans. Vi prioriterar arbete och kvalitet framför möten och politik. Läs mer om oss, hur vi arbetar och våra förmåner. About you Om dig We're looking for a sales representative based in Sweden with a valid work permit who enjoys building relationships and has a strong interest in learning. Vi söker en säljare bosatt i Sverige som tycker om att bygga relationer och har ett stort intresse för lärande. Fluency in Swedish and English is required. Strong verbal skills are important, but thoughtful written communication that creates clarity and interest is crucial. Flytande svenska och engelska är ett krav. God muntlig förmåga är viktig, men omsorgsfullt formulerad skriftlig kommunikation som skapar tydlighet och intresse är avgörande. Documented experience in sales and customer relations is required. Dokumenterad erfarenhet av försäljning och kundrelationer är ett krav. How to apply Sök tjänsten Write an application where you tell us about yourself, and your approach to building relationships and written communication. Attach a CV that describes your skills and experiences. Skriv en ansökan där du berättar om dig själv och din syn på relationsbyggande och skriftlig kommunikation. Bifoga ett CV som beskriver dina kunskaper och erfarenheter. Send your application to martin.tholsby@learnpoint.se Skicka din ansökan till martin.tholsby@learnpoint.se What happens next? Vad är nästa steg? You'll hear from us within two weeks if you've moved forward. Note that we're not able to offer individual feedback at this point. Vi meddelar dig inom två veckor om du gått vidare. Notera att vi inte har möjlighet att ge individuell feedback i detta steg. Next step is a couple of initial interviews. You'll tell us a little about yourself, and we'll describe our business and answer your questions. The entire process will be carried out remotely. Nästa steg är ett par inledande intervjuer. Du får berätta om dig själv och vi beskriver vår verksamhet och besvarar dina frågor. Hela processen sker på distans. Then you'll take a test. You'll be asked to reflect on some typical sales scenarios in writing, which we will then discuss together. Därefter får du genomföra ett prov. Du får i uppdrag att skriftligen reflektera över några typiska säljsituationer som vi senare muntligen diskuterar tillsammans. The final stage in the process are a few interviews with future colleagues. Det sista steget består av ett litet antal intervjuer med framtida kollegor. We look forward to hearing from you! Vi ser fram emot att höra från dig! All our open positions → Alla lediga tjänster → .we-love-building { fill: #ff4b00; width: 1.2em; height: 1.2em; animation: 1.6s ease we-love-building-heart-beat; animation-iteration-count: infinite; animation-direction: alternate-reverse; } .dark .we-love-building { fill: #f6682d; } @keyframes we-love-building-heart-beat { from { transform: scale(1.2); } to { transform: scale(1); } } We love building"
    },
    {
        "title": "Backend Developer",
        "description": "Backend Developer at Learnpoint, Spring 2024",
        "url": "/jobs/2024/spring/backend-developer.html",
        "content": "Backendutvecklare Backend Developer You can no longer apply for this position. You can find all our open positions here. Den här tjänsten går inte längre att söka. Alla våra lediga tjänster finns annonserade här. April 2024 April 2024 Learnpoint är en omtyckt lärplattform som används av studenter, lärare och skolledare. Vår mission är att förenkla utbildning och vi söker nu en backendutvecklare med intresse för lärande. Learnpoint is a loved learning platform for students, teachers, and school managers. Our mission is to simplify education and we're now looking for a backend developer with an interest for learning. Om tjänsten About the job Du kommer implementera nya funktioner, fixa buggar och utveckla vår tekniska infrastruktur. Nya funktioner implementerar du tillsammans med duktiga designers i självständiga team. Teknikprojekten sker i samarbete med mycket erfarna och kompetenta backendutvecklare. You will implement new features, fix bugs, and improve our technical infrastructure. When implementing new features, you'll be working together with capable designers in independent teams. On the technical projects, you'll collaborate with very experienced and competent backend developers. Vår stack bygger på Azure, MS SQL Server och .NET. Our stack is primarily Azure, MS SQL Server, and .NET. Största delen av arbetet ägnas åt produkten Learnpoint, men ibland får du jobba med andra produkter, verktyg, och projekt i verksamheten. You'll spend most of your time working on the product Learnpoint, but you will occasionally work on other products, tools, and projects within the business. Du kommer inte kommunicera direkt med slutanvändare, men däremot får du ibland hjälpa vår support med tekniska ärenden. I gengäld kan du förvänta dig hjälp från supporten när du har frågor om kunder och användare. Alla på företaget är kunniga, motiverade och hjälpsamma. You'll not communicate directly with end users, but you will sometimes assist our support team with technical issues. In return, you can expect help from the support team when you have questions about customers and users. Everyone at the company is knowledgeable, motivated, and helpful. Du behöver inte överge ditt intresse för backend för att göra karriär hos oss. Du befordras successivt som backendutvecklare i totalt fem karriärsteg. I dagsläget är lönen 36 720 SEK på det första karriärsteget och 68 136 SEK på det sista. Making a career at Learnpoint does not mean giving up on your craft. As you improve, you'll be promoted through five career levels. Currently, the salary on the first level is 36 720 SEK and 68 136 SEK on the highest. Tjänsten är på distans. Vi prioriterar arbete och kvalitet framför möten och politik. Anställningen är fast och på heltid. The job is remote. We put work and quality above meetings and politics. The employment is permanent and full time. Om dig About you Vi letar en backendutvecklare som är bosatt i Sverige och har ett stort intresse för lärande. We're looking for a backend developer that lives in Sweden and have a big interest in learning. Du måste inte ha någon akademisk examen inom datateknik, men du behöver ha mycket goda kunskaper inom mjukvaruutveckling. A degree in computer science is not required, but you need very strong skills in software development. Särskilt meriterande är din förmåga att utveckla nya kunskaper. I dagsläget bygger vår backend på Azure, MS SQL Server och .NET, men varje projekt innebär nya utmaningar och din förmåga att vidareutvecklas är avgörande för att du skall lyckas hos oss. Your ability to aquire new skills is particularly important. Today, our stack is Azure, MS SQL Server, and .NET, but each project presents new challenges and your motivation to learn and adapt is key in order to be successful at Learnpoint. Sök tjänsten How to apply Skriv en ansökan där du berättar om dig själv och ditt intresse för lärande. Bifoga ett CV som beskriver dina kunskaper och erfarenheter. Write an application where you tell us about yourself and your interest in learning. Attach a CV that describes your skills and experiences. Skicka din ansökan senast den 30:e april till karl.west@learnpoint.se Send your application no later than April 30 to karl.west@learnpoint.se Vad är nästa steg? What happens next? Vi meddelar dig den 3:e maj om du gått vidare. Notera att vi inte har möjlighet att ge individuell feedback i detta steg. You'll hear from us on May 3 about advancement. Note that we're not able to offer individual feedback at this point. Nästa steg är ett par inledande intervjuer. Du får berätta om dig själv och vi beskriver vår verksamhet och besvarar dina frågor. Next step is a couple of initial interviews. You'll tell us a little about yourself, and we'll describe our business and answer your questions. Därefter får du genomföra ett prov. Du får i uppdrag att lösa ett par tekniska problem och diskutera dina lösningar med kunniga utvecklare. Allt sker på distans. Then you'll take a test. You'll be asked to solve a couple of technical problems and discuss your solutions with knowledgeable developers. Everything is done remotely. Det sista steget består av ett litet antal intervjuer med framtida kollegor. The final stage in the process are a few interviews with future colleagues. Vi ser fram emot att höra från dig! We look forward to hearing from you! All our open positions → Alla lediga tjänster → .we-love-building { fill: #ff4b00; width: 1.2em; height: 1.2em; animation: 1.6s ease we-love-building-heart-beat; animation-iteration-count: infinite; animation-direction: alternate-reverse; } .dark .we-love-building { fill: #f6682d; } @keyframes we-love-building-heart-beat { from { transform: scale(1.2); } to { transform: scale(1); } } We love building"
    },
    {
        "title": "Frontend Developer Internship",
        "description": "Frontend Developer Internship at Learnpoint, Autumn 2025",
        "url": "/jobs/2025/autumn/frontend-developer-internship.html",
        "content": "Frontend Developer Frontendutvecklare You can no longer apply for this position. You can find all our open positions here. Den här tjänsten går inte längre att söka. Alla våra lediga tjänster finns annonserade här. Autumn 2025 Hösten 2025 Learnpoint är en omtyckt lärplattform som används av studenter, lärare och skolledare. Vår mission är att förenkla utbildning och vi har nu praktikplatser öppna för frontendutvecklare till hösten 2025. Learnpoint is a loved learning platform for students, teachers, and school managers. Our mission is to simplify education and we have internship positions open for frontend developers during autumn 2025. About the Internship Om praktiken The main task will be to design and implement an application. The first step is to discuss and decide which application to build, based on the length of the internship, your skillset and our organizational needs. At the end of the internship you'll write a public article and make a presentation. Praktikens primära uppdrag är designa och implementera en applikation. Första steget blir att diskutera och bestämma vilken applikation som skall utvecklas, utifrån praktikens längd, dina förkunskaper och verksamhetens behov. I slutet av praktiken skriver du en publik artikel och håller en presentation. In addition to the main task, you'll also participate in discussions, meetings and workshops. Utöver det primära uppdraget kommer du även delta i arbetsmöten, diskussioner och workshops. You'll have access to a mentor throughout the whole internship. You'll meet with the mentor at least once every week. Du har tillgång till en handledare under hela praktiken. Ni träffas minst en gång per vecka. The internship is 2-6 months and takes place during autumn 2025. Praktiken utförs under hösten 2025 och är 2-6 månader. The internship is a team effort. You should apply together with at least one other intern. Praktiken är ett teamarbete. Du skall söka praktikplatsen tillsammans med en eller flera andra praktikanter. The internship is remote. Praktiken sker på distans. About You Om dig You are truly interested in frontend development, but you're also interested in users. How do they think, what's difficult for them, and what do they like? You understand that a great product development is as much about humans as it is about code. Du är genuint intresserad av frontendutveckling, men du är också intresserad av användare. Hur tänker dom, vad tycker dom är svårt och vad gillar dom? Du förstår att en bra produkt handlar lika mycket om människor som om kod. You want to achieve results, but you're also interested in questions. You are curious, you love learning, and you understand there's no simple recipe for success. Du vill uppnå resultat, men du är också intresserad av frågor. Du är nyfiken, älskar lärande och förstår att det finns inget enkelt recept på framgång. You are proficient in HTML, CSS, and JavaScript. Du behärskar HTML, CSS, och JavaScript. How to Apply Sök praktikplatsen Write an application where you tell us about yourself and your interest in education, learning, and frontend development. Attach CV and portfolio. Make sure to mention the other interns you are applying with. Send your application to karl.west@learnpoint.se Skriv en ansökan där du beskriver dig själv och ditt intresse för utbildning, lärande och frontendutveckling. Bifoga CV och portfolio. Ange vem eller vilka du söker tillsammans med. Skicka din ansökan till karl.west@learnpoint.se What happens next? Vad är nästa steg? When we've reviewed your application, you'll hear from us within a week about advancement to an interview. När vi läst igenom din ansökan, meddelar vi dig inom en vecka om du gått vidare till intervju. During the interview you'll tell us more about yourself and your interest in education, learning and frontend development. We'll explain the internship in detail and at the end of the interview we'll agree upon how to move forward together. Under intervjun får du berätta mer om dig själv och ditt intresse för utbildning, lärande och frontendutveckling. Vi beskriver praktiken lite mer detaljerat och i slutet av intervjun kommer vi överens om hur vi går vidare tillsammans. All our open positions → Alla lediga tjänster → .we-love-building { fill: #ff4b00; width: 1.2em; height: 1.2em; animation: 1.6s ease we-love-building-heart-beat; animation-iteration-count: infinite; animation-direction: alternate-reverse; } .dark .we-love-building { fill: #f6682d; } @keyframes we-love-building-heart-beat { from { transform: scale(1.2); } to { transform: scale(1); } } We love building"
    },
    {
        "title": "Backend Developer Internship",
        "description": "Backend Developer Internship, Spring 2025",
        "url": "/jobs/2025/spring/backend-developer-internship.html",
        "content": "Backend Developer Backendutvecklare You can no longer apply for this position. You can find all our open positions here. Den här tjänsten går inte längre att söka. Alla våra lediga tjänster finns annonserade här. Spring 2025 Våren 2025 Learnpoint is an integrated LMS and SIS made for teachers, students, and school managers. The Learnpoint team is on a mission to simplify education and we have an internship position open for 1-4 backend developers during spring 2025. Learnpoint är ett integrerat LMS och administrativt system för lärare, studenter, och skolledare. Vår mission är att förenkla utbildning och vi har en praktikplats öppen för 1-4 backendutvecklare under våren 2025. About the Internship Om praktiken The main task will be to build an application or service. The first step will be to discuss and choose which application or service that fits based on the length of the internship, your skillset and our organizational needs. You will make a demo of the application or service at the end of the intership. Praktikens huvudsakliga uppdrag är att bygga en applikation eller en service. Första steget är att diskutera och bestämma vilken applikation eller service som passar utifrån praktikens längd, dina förkunskaper och verksamhetens behov, och sedan avslutas praktiken med att du presenterar applikationen eller servicen. In addition to the main task, you will also participate in some meetings and workshops. Utöver det huvudsakliga uppdraget kommer du även delta i några arbetsmöten och workshops. You'll have access to a supervisor throughout the internship. Du har tillgång till en handledare under hela praktiken. The internship is 2-6 months and takes place during spring 2025. Praktiken genomförs under våren 2025 och är 2-6 månader. We encourage you to apply together with someone else. The task can be done by a single trainee, but two would be even better. Vi ser helst att du genomför praktiken tillsammans med en annan praktikant. Uppdraget går att genomföra individuellt, men det fungerar bättre om ni är två som genomför det. Our team don't share an office, so you will work remote. Vi har inget gemensamt kontor, så allt arbete genomförs på distans. About Us Om oss We're a customer focused edtech company. In addition to Learnpoint, we're also developing the product yh-antagning.se. Vi är ett kundorienterat edtech bolag. Förutom Learnpoint utvecklar vi även produkten yh-antagning.se. About You Om dig You are truly interested in finding solutions. Both for technical problems and how to make the application faster and more reliable for the user. Du är genuint intresserad av att hitta lösningar. Både för tekniska problem och hur du ska göra en applikation snabbare och mer tillförlitlig för användarna. You are interested in results and answers, but perhaps equally interested in questions. You are curious to the bone and you love learning. You understand that there is no simple prescription when it comes to developing good applications, and you're eager to figure out how it should be done. Du är intresserad av resultat och svar, men kanske lika intresserad av frågor. Du är genuint nyfiken och älskar lärande. Du förstår att det inte finns något färdig framgånsrecept när man skall utveckla applikationer, och du drivs av att själv ta reda på hur man ska göra. You are proficient in .NET, C#, and SQL. Du behärskar .NET, C#, and SQL. How to Apply Sök praktikplatsen Write an application where you tell us about yourself and your interest in education and backend development. Attach CV and portfolio. Indicate if you apply together with another trainee. Send your application to martin.vehmas@learnpoint.se Skriv en ansökan där du beskriver dig själv och ditt intresse för utbildning och backendutveckling. Bifoga CV och portfolio. Ange om du söker praktiken tillsammans med någon annan. Skicka din ansökan till martin.vehmas@learnpoint.se What happens next? Vad är nästa steg? When we've reviewed your application, you'll hear from us within a week about advancement to the development challange stage. När vi läst igenom din ansökan, meddelar vi dig inom en vecka om du gått vidare till nästa fas i processen som är ett utvecklingsprov. The development challenge is an at-home assignment. You will extend an existing web application and document your working process. Utvecklingsprovet genomförs på distans. Du får i uppdrag att vidareutveckla en befintlig webbapplikation samt dokumentera din process och beskriva hur du tänkt. The final stage are a few interviews. Den tredje och sista fasen består av ett par intervjuer. All our open positions → Alla lediga tjänster → .we-love-building { fill: #ff4b00; width: 1.2em; height: 1.2em; animation: 1.6s ease we-love-building-heart-beat; animation-iteration-count: infinite; animation-direction: alternate-reverse; } .dark .we-love-building { fill: #f6682d; } @keyframes we-love-building-heart-beat { from { transform: scale(1.2); } to { transform: scale(1); } } We love building"
    },
    {
        "title": "Frontend Developer Internship",
        "description": "Frontend Developer Internship at Learnpoint, Spring 2026",
        "url": "/jobs/2026/spring/frontend-developer-internship.html",
        "content": "Frontend Developer Internship Frontendutvecklare Praktik Spring 2026 Våren 2026 Learnpoint är en omtyckt lärplattform som används av studenter, lärare och skolledare. Vår mission är att förenkla utbildning och vi har nu praktikplatser öppna för frontendutvecklare under våren 2026. Learnpoint is a loved learning management platform for students, teachers, and school managers. Our mission is to simplify education and we have internship positions open for frontend developers during spring 2026. About the Internship Om praktiken The main task will be to design and implement an application. The first step is to discuss and decide which application to build, based on the length of the internship, your skillset and our organizational needs. At the end of the internship you'll write a public article and make a presentation. Praktikens primära uppdrag är designa och implementera en applikation. Första steget blir att diskutera och bestämma vilken applikation som skall utvecklas, utifrån praktikens längd, dina förkunskaper och verksamhetens behov. I slutet av praktiken skriver du en publik artikel och håller en presentation. In addition to the main task, you'll also participate in discussions, meetings and workshops. Utöver det primära uppdraget kommer du även delta i arbetsmöten, diskussioner och workshops. You'll have access to a mentor throughout the whole internship. You'll meet about once a week. Du har tillgång till en handledare under hela praktiken. Ni träffas ungefär en gång per vecka. The internship is 2-6 months and takes place during spring 2026. Praktiken utförs under våren 2026 och är 2-6 månader. The internship is a team effort. You should apply together with at least one other intern. Praktiken är ett teamarbete. Du skall söka praktikplatsen tillsammans med en eller flera andra praktikanter. The internship is remote. Praktiken sker på distans. About You Om dig You are genuinely interested in frontend development, but you're also interested in users. How do they think, what's difficult for them, what do they enjoy? You understand that frontend development is as much about humans as it is about code. Du är genuint intresserad av frontendutveckling, men du är också intresserad av användare. Hur tänker dom, vad tycker dom är svårt, vad gillar dom? Du förstår att frontendutveckling handlar lika mycket om människor som om kod. You want to achieve results, but you're also interested in questions. You are curious, you love learning, and you understand that there's no simple recipe for great products. Du är resultatinriktad, men du är också intresserad av frågor. Du är nyfiken, älskar lärande och förstår att det inte finns något enkelt recept på bra produkter. You are proficient in HTML, CSS, and JavaScript. Du behärskar HTML, CSS, och JavaScript. How to Apply Sök praktikplatsen Write an application where you tell us about yourself and your interest in education, learning, and frontend development. Attach CV and portfolio. Make sure to mention the other interns you are applying with. Send your application to karl.west@learnpoint.se Skriv en ansökan där du beskriver dig själv och ditt intresse för utbildning, lärande och frontendutveckling. Bifoga CV och portfolio. Ange vem eller vilka du söker tillsammans med. Skicka din ansökan till karl.west@learnpoint.se What happens next? Vad händer sen? When we've reviewed your application, you'll hear from us about advancement to an admission test. You'll take the test remotely. När vi läst din ansökan så meddelar vi dig om du gått vidare till ett antagningsprov. Provet genomför du på distans. Once you've pass the test, you'll be invited to an interview. During the interview you'll tell us more about yourself and your interest in education, learning and frontend development. We'll explain the internship in detail, answer your questions, and at the end of the interview we'll agree upon how to move forward. När du klarat provet blir du inbjuden till en intervju. Under intervjun får du berätta mer om dig själv och ditt intresse för utbildning, lärande och frontendutveckling. Vi beskriver praktiken mer i detalj, svarar på dina frågor, och i slutet av intervjun kommer vi överens om hur vi ska gå vidare. All our open positions → Alla lediga tjänster → .we-love-building { fill: #ff4b00; width: 1.2em; height: 1.2em; animation: 1.6s ease we-love-building-heart-beat; animation-iteration-count: infinite; animation-direction: alternate-reverse; } .dark .we-love-building { fill: #f6682d; } @keyframes we-love-building-heart-beat { from { transform: scale(1.2); } to { transform: scale(1); } } We love building"
    },
    {
        "title": "UX Designer Internship",
        "description": "UX Designer Internship at Learnpoint, Spring 2026",
        "url": "/jobs/2026/spring/ux-designer-internship.html",
        "content": "UX Designer Internship UX Designer Praktik Spring 2026 Våren 2026 Learnpoint är en omtyckt lärplattform som används av studenter, lärare och skolledare. Vår mission är att förenkla utbildning och vi har nu praktikplatser öppna för UX designers under våren 2026. Learnpoint is a loved learning management platform for students, teachers, and school managers. Our mission is to simplify education and we have internship positions open for UX designers during spring 2026. About the Internship Om praktiken The main task will be to research and design a feature. The first step is to discuss and decide upon which feature to design, based on the length of the internship, your skillset and our organizational needs. At the end of the internship you'll write a public article and make a presentation. Praktikens primära uppdrag är genomföra UX-research och designa en funktion. Första steget blir att diskutera och bestämma vilken funktion som skall designas, utifrån praktikens längd, dina förkunskaper och verksamhetens behov. I slutet av praktiken skriver du en publik artikel och håller en presentation. In addition to the main task, you'll also participate in discussions, meetings and workshops. Utöver det primära uppdraget kommer du även delta i arbetsmöten, diskussioner och workshops. You'll have access to a mentor throughout the whole internship. You'll meet about once a week. Du har tillgång till en handledare under hela praktiken. Ni träffas ungefär en gång per vecka. The internship is 2-6 months and takes place during spring 2026. Praktiken utförs under våren 2026 och är 2-6 månader. The internship is a team effort. You should apply together with at least one other intern. Praktiken är ett teamarbete. Du skall söka praktikplatsen tillsammans med en eller flera andra praktikanter. The internship is remote. Praktiken sker på distans. About You Om dig You are genuinely interested in UX design, but you're also interested in users. How do they think, what's difficult for them, what do they enjoy? You understand that UX is as much about humans as it is about research and design. Du är genuint intresserad av UX design, men du är också intresserad av användare. Hur tänker dom, vad tycker dom är svårt, vad gillar dom? Du förstår att UX handlar lika mycket om människor som om research och design. You want to achieve results, but you're also interested in questions. You are curious, you love learning, and you understand that there's no simple recipe for great design. Du är resultatinriktad, men du är också intresserad av frågor. Du är nyfiken, älskar lärande och förstår att det inte finns något enkelt recept på bra design. You are proficient Figma or some similar tool. Du behärskar Figma eller något liknande verktyg. How to Apply Sök praktikplatsen Write an application where you tell us about yourself and your interest in education, learning, and UX design. Attach CV and portfolio. Make sure to mention the other interns you are applying with. Send your application to karl.west@learnpoint.se Skriv en ansökan där du beskriver dig själv och ditt intresse för utbildning, lärande och UX design. Bifoga CV och portfolio. Ange vem eller vilka du söker tillsammans med. Skicka din ansökan till karl.west@learnpoint.se What happens next? Vad händer sen? When we've reviewed your application, you'll hear from us about advancement to an admission test. You'll take the test remotely. När vi läst din ansökan så meddelar vi dig om du gått vidare till ett antagningsprov. Provet genomför du på distans. Once you've pass the test, you'll be invited to an interview. During the interview you'll tell us more about yourself and your interest in education, learning and UX design. We'll explain the internship in detail, answer your questions, and at the end of the interview we'll agree upon how to move forward. När du klarat provet blir du inbjuden till en intervju. Under intervjun får du berätta mer om dig själv och ditt intresse för utbildning, lärande och UX design. Vi beskriver praktiken mer i detalj, svarar på dina frågor, och i slutet av intervjun kommer vi överens om hur vi ska gå vidare. All our open positions → Alla lediga tjänster → .we-love-building { fill: #ff4b00; width: 1.2em; height: 1.2em; animation: 1.6s ease we-love-building-heart-beat; animation-iteration-count: infinite; animation-direction: alternate-reverse; } .dark .we-love-building { fill: #f6682d; } @keyframes we-love-building-heart-beat { from { transform: scale(1.2); } to { transform: scale(1); } } We love building"
    },
    {
        "title": "Learnpoint: Work with us",
        "description": "You want join our mission to simplify the future of education? View our available positions here!",
        "url": "/jobs/index.html",
        "content": "Work with us Lediga tjänster All our open positions are announced on this page. If you’d like to be notified about job openings you can subscribe to our newsletter. Här annonserar vi alla våra lediga tjänster. Vill du få mejl när en ny tjänst publiceras kan du prenumerera på vårt nyhetsbrev. UX Designer Internship UX Designer Praktik Internship 2-6 months, Spring 2026 Remote Praktikplats 2-6 månader, Våren 2026 Distans Frontend Developer Internship Frontendutvecklare Praktik Internship 2-6 months, Spring 2026 Remote Praktikplats 2-6 månader, Våren 2026 Distans"
    },
    {
        "title": "Breadcrumb shortcuts",
        "description": "Breadcrumb shortcuts. Genvägar i brödsmulorna.",
        "url": "/news/2021/11/breadcrumb-shortcuts.html",
        "content": "Breadcrumb shortcuts Genvägar i brödsmulorna Karl West November 22, 2021 22 november, 2021 The breadcrumbs in Learnpoint now have shortcuts. The shortcuts makes it possible to navigate directly from one student grade to another, without having to visit the grading list. Brödsmulorna i Learnpoint har fått genvägar. Genvägarna gör att du kan navigera direkt från ett studentbetyg till ett annat, utan att behöva ta omvägen via listan med studentbetyg. Du slipper klicka fram och tillbaka. Here's how the shortcuts look like: Såhär ser genvägarna ut: Which pages have shortcuts? Vilka sidor har genvägar? Shortcuts are enabled on internship pages and student grade pages (both course and course item pages). The double-arrow icon in the breadcrumbs indicate that shortcuts are available. Genvägar finns på LIA-platser och studentbetyg (för både kurser och kursdelar). Den dubbelriktade pilen i brödsmulorna indikerar att genvägar finns tillgängliga. View all news → Visa alla nyheter → .we-love-learning { fill: #ff0000; width: 1em; height: 1em; animation: 1.6s ease we-love-learning-heart-beat; animation-iteration-count: infinite; animation-direction: alternate-reverse; } .dark .we-love-learning { fill: #ff4a4a; } @keyframes we-love-learning-heart-beat { from { transform: scale(1.2); } to { transform: scale(1); } } We love learning"
    },
    {
        "title": "Group code in title field",
        "description": "Group code in title field. Gruppkod i titelfältet",
        "url": "/news/2022/06/group-code-in-title-field.html",
        "content": "Group code in title field Gruppkod i titelfältet Karl West June 10, 2022 10 juni, 2022 The title field now contains the group code and the group type. If you're a member of several groups with the same name, it's now easier to see which group you've navigated to. Titelfältet innehåller nu både gruppkoden och grupptypen. Är du medlem i flera grupper med samma namn blir det lättare att se vilken grupp du har navigerat till. Here's how the group code and group type is displayed in the title field: Såhär visas gruppkoden och grupptypen i titelfältet: View all news → Visa alla nyheter → .we-love-learning { fill: #ff0000; width: 1em; height: 1em; animation: 1.6s ease we-love-learning-heart-beat; animation-iteration-count: infinite; animation-direction: alternate-reverse; } .dark .we-love-learning { fill: #ff4a4a; } @keyframes we-love-learning-heart-beat { from { transform: scale(1.2); } to { transform: scale(1); } } We love learning"
    },
    {
        "title": "New feature: Notifications",
        "description": "New feature: Notifications. Ny funktion: Aviseringar",
        "url": "/news/2022/09/notifications.html",
        "content": "New feature: Notifications Ny funktion: Aviseringar Karl West September 12, 2022 12 september, 2022 On the evening of 14 September 2022, Learnpoint will be updated with a new feature: Notifications. The current news start page will be replaced with a notification page that contains everything new and relevant that've happened since you last signed in. På kvällen den 14 sep 2022 uppdateras Learnpoint med en ny funktion: Aviseringar. Startsidan med nyheter ersätts med en aviseringssida som visar allt nytt och relevant som hänt sedan du senast loggade in. Here's how the notification page will look like: Såhär kommer den nya aviseringssidan se ut: Where will the news go? Vart tar nyheterna vägen? You'll find the news on the start page, but now as notifications. One difference is that you'll be able to see which news are new and which news you've already seen. Nyheterna finns kvar på startsidan, men nu i form av aviseringar. En skillnad blir att du kan se vilka nyheter som är lästa och vilka som är nya. What will Learnpoint notifiy about? Vad kommer Learnpoint avisera om? Learnpoint will notify about news, comments, surveys, logbooks and internships. Each type has its own icon to make them clearly distinguishable. Learnpoint kommer avisera om nyheter, kommentarer, enkäter, loggböcker och LIA-platser. Varje aviseringstyp har en egen ikon så att du lätt skall se skillnad på dom. To get notifications from a specific group, you have to be a member of that group. If you're an administrator or a manager for a program, you might have access to several courses without being a member. To get notifications from these courses, you have to add yourself as a member to those groups. För att få aviseringar från en viss grupp måste du vara medlem i gruppen. Om du är administratör eller utbildningsledare för en utbildning, så kan du ha behörighet till flera kurser utan att vara medlem på kurserna. Vill du få aviseringar från dessa kurser behöver du lägga till dig själv som medlem. Email notifications Mejlaviseringar You'll be able recieve notifications by email. Du kan välja att få aviseringar via mejl. If you don't use Learnpoint very often, email notifications will let you stay up to date without having to sign in. If you end up getting too many emails, you can turn them off at any time. Om du inte använder Learnpoint så ofta, kan meljaviseringar vara ett praktiskt sätt att hänga med på vad som händer utan att behöva logga in. Blir det för mycket mejl kan du stänga av mejlaviseringarna när som helst. Reminders Påminnelser Notifications for surveys, internships and logbooks, will have built-in reminders. Aviseringar för enkäter, LIA-platser och loggböcker kommer få en påminnelse-funktion. If a survey isn't completed, Learnpoint will send a reminder. The reminder is repeated once per week until the survey is completed. Same goes for internships — reminders are sent until the internship is approved. Om en enkät inte besvarats så skickar Learnpoint en påminnelse. Påminnelsen upprepas en gång per vecka tills enkäten är besvarad. Samma sak för LIA-platser — Learnpoint skickar påminnelser tills LIA-platsen har godkänts. Reminders for surveys and internship don't need to be configured, they're automatically sent by Learnpoint. Reminders for logbooks are configured manually just like before. Påminnelser för enkäter och LIA-platser behöver inte konfigureras, dom sköts automatiskt av Learnpoint. Påminnelserna för loggböcker konfigureras manuellt precis som tidigare. View all news → Visa alla nyheter → .we-love-learning { fill: #ff0000; width: 1em; height: 1em; animation: 1.6s ease we-love-learning-heart-beat; animation-iteration-count: infinite; animation-direction: alternate-reverse; } .dark .we-love-learning { fill: #ff4a4a; } @keyframes we-love-learning-heart-beat { from { transform: scale(1.2); } to { transform: scale(1); } } We love learning"
    },
    {
        "title": "Show if survey is anonymous",
        "description": "Show if survey is anonymous",
        "url": "/news/2022/10/anonymous-survey.html",
        "content": "Show if survey is anonymous Visa om enkät är anonym Frida Brodin October 13, 2022 13 oktober, 2022 When you create a survey, you can choose whether it should be anonymous or not. När du skapar en enkät kan du välja om den ska vara anonym eller inte. Today, the person who is answering can see whether the survey is anonymous or not. Previously this was not shown. Nu kan den som svarar se om enkäten är anonym eller inte. Tidigare har det inte visats. If the survey is anonymous it says \"Ja\", otherwise it says \"Nej\". Here is an example of a survey that is anonymous: Om enkäten är anonym står det \"Ja\" och är den inte anonym står det \"Nej\". Här är ett exempel på en anonym enkät: View all news → Visa alla nyheter → .we-love-learning { fill: #ff0000; width: 1em; height: 1em; animation: 1.6s ease we-love-learning-heart-beat; animation-iteration-count: infinite; animation-direction: alternate-reverse; } .dark .we-love-learning { fill: #ff4a4a; } @keyframes we-love-learning-heart-beat { from { transform: scale(1.2); } to { transform: scale(1); } } We love learning"
    },
    {
        "title": "Comments on announcements",
        "description": "Comments on announcements",
        "url": "/news/2022/10/comments-on-announcements.html",
        "content": "Comments on announcements Kommentarer på nyheter Karl West October 17, 2022 17 oktober, 2022 Every group has an announcement feature. You can write announcements to communicate information to the group members. Alla grupper har en nyhetsfunktion. Du kan skriva nyheter för att kommunicera information till medlemmarna i gruppen. On the evening of 19 Oct, the announcement feature will be updated. The update will make it possible to write comments to announcements. På kvällen den 19 okt uppdateras nyhetsfunktionen. Uppdateringen gör det möjligt att skriva kommentarer på nyheter. This is how an announcement could look like after the update: Såhär kan en nyhet se ut efter uppdateringen: View all news → Visa alla nyheter → .we-love-learning { fill: #ff0000; width: 1em; height: 1em; animation: 1.6s ease we-love-learning-heart-beat; animation-iteration-count: infinite; animation-direction: alternate-reverse; } .dark .we-love-learning { fill: #ff4a4a; } @keyframes we-love-learning-heart-beat { from { transform: scale(1.2); } to { transform: scale(1); } } We love learning"
    },
    {
        "title": "Gradebook colors",
        "description": "Gradebook colors",
        "url": "/news/2022/10/gradebook-colors.html",
        "content": "Gradebook colors Färger på betygssidan Frida Brodin October 10, 2022 10 oktober, 2022 On the gradebook page, there is an overview of all grades in the course. På betygssidan finns en översikt över alla betyg i kursen. Previously, all the grades were displayed in the same color. Now, passed and non-passed grades have different colors. Green color for grades like G and VG, and red color for grades like IG. Tidigare visades alla betyg i samma färg. Nu har godkända och icke-godkända betyg fått olika färger. Grön färg för betyg som G och VG, och röd färg för betyg som IG och streck. This is how the gradebook looks like with colors: Såhär ser betygssidan ut med färger: View all news → Visa alla nyheter → .we-love-learning { fill: #ff0000; width: 1em; height: 1em; animation: 1.6s ease we-love-learning-heart-beat; animation-iteration-count: infinite; animation-direction: alternate-reverse; } .dark .we-love-learning { fill: #ff4a4a; } @keyframes we-love-learning-heart-beat { from { transform: scale(1.2); } to { transform: scale(1); } } We love learning"
    },
    {
        "title": "Switch off notifications on groups",
        "description": "Switch off notifications on groups",
        "url": "/news/2022/12/switch-off-notifications-on-groups.html",
        "content": "Switch off notifications on groups Stänga av aviseringar på grupper Daniel Gidlöf December 6, 2022 6 december, 2022 On the notifications settings page, it is now possible to switch off notifications for individual groups. På inställningssidan för aviseringar är det nu möjligt att stänga av aviseringar för enskilda grupper. A blue bell indicates that notifications are turned on, and a grey bell indicates that notifications are switched off. Click the bell to change the setting: En blå klocka visar att aviseringar är påslagna, och en grå klocka visar att dom är avstängda. Man klickar på klockan för att ändra inställningen: The setting is also available on the About-page for the group: Aviseringsklockan är också tillgänglig på gruppens Om-sida: An icon indicates if notifications are switched off for a group: Om aviseringarna är avstängda för en grupp så visas det i gruppsidans titel: You have to be a member of the group in order to turn notifications on. Just like before, you can also turn on and switch off notifications for separate comment threads. Du måste vara medlem i en grupp för att kunna slå på aviseringar för den. Precis som tidigare så kan du också slå på och stänga av aviseringar för enskilda kommentarstrådar. View all news → Visa alla nyheter → .we-love-learning { fill: #ff0000; width: 1em; height: 1em; animation: 1.6s ease we-love-learning-heart-beat; animation-iteration-count: infinite; animation-direction: alternate-reverse; } .dark .we-love-learning { fill: #ff4a4a; } @keyframes we-love-learning-heart-beat { from { transform: scale(1.2); } to { transform: scale(1); } } We love learning"
    },
    {
        "title": "New feature: Discussion Channels",
        "description": "New feature: Discussion Channels",
        "url": "/news/2023/06/discussion-channels.html",
        "content": "New feature: Discussion Channels Ny funktion: Diskussionskanaler Dhanfia Rahman June 21, 2023 21 juni, 2023 Learnpoint has been updated with a new feature: Discussion Channels. The feature will make it easier to communicate and collaborate in Learnpoint. Learnpoint har uppdaterats med en ny funktion: Diskussionskanaler. Funktionen gör det enklare att kommunicera och samarbeta i Learnpoint. Here's how a channel can look like: Såhär kan en kanal se ut: Getting started Kom igång You need to manually enable the feature on the About-page for courses and classes that have already started. Du behöver manuellt aktivera funktionen på Om-sidan i dom kurser och klasser som redan startat. The feature is automatically enabled when you create new groups, and it's also enabled in groups that are created but not yet started. Funktionen blir däremot automatiskt aktiverad när du skapar nya grupper, och den är dessutom aktiverad i grupper som är skapade men ännu inte startat. Creating channels Skapa kanaler When the feature is enabled, both teachers and students can begin creating channels. När funktionen är aktiverad, kan både lärare och studenter börja skapa kanaler. You can create several channels in a group, and you can also sort them into separate categories if you want. Du kan ha flera kanaler i en grupp, och du kan även att sortera in dem i separata kategorier om du vill. Joining channels Bli medlem There are no \"private\" channels in Learnpoint. Anyone in the group can join any channel. Det finns inga \"privata\" kanaler i Learnpoint. Alla lärare och studenter i gruppen kan bli medlem i vilken kanal som helst. Using channels Hur man använder kanaler You can use the channels in many different ways. For example, you can write announcements, respond to questions, encourage collaborative learning, and much more. Du kan använda kanalerna på många olika sätt. Du kan exempelvis skriva nyheter, svara på frågor, uppmuntra till kollaborativt lärande, och mycket annat. View all news → Visa alla nyheter → .we-love-learning { fill: #ff0000; width: 1em; height: 1em; animation: 1.6s ease we-love-learning-heart-beat; animation-iteration-count: infinite; animation-direction: alternate-reverse; } .dark .we-love-learning { fill: #ff4a4a; } @keyframes we-love-learning-heart-beat { from { transform: scale(1.2); } to { transform: scale(1); } } We love learning"
    },
    {
        "title": "New feature: Import content",
        "description": "New feature: Import content",
        "url": "/news/2023/10/import-content.html",
        "content": "New feature: Import content Ny funktion: Importera innehåll Dhanfia Rahman October 18, 2023 18 oktober, 2023 Learnpoint has been updated with a new feature: Import content. This feature will make it easy to reuse course content. Learnpoint har uppdaterats med en ny funktion: Importera innehåll. Funktionen gör det enkelt att återanvända kursinnehåll. You'll find the feature at the bottom of the content page: Funktionen hittar du längst ned på innehålls-sidan: What can be imported? Vad kan importeras? You can import course items and sections from Learnpoint courses. Note that it's only the item content and attachments that will be imported, not the settings. Du kan importera kursdelar och avsnitt från kurser i Learnpoint. Observera att det endast är kursdelarnas innehåll och bilagor som importeras, inte inställningarna. Who can import from a course? Vem kan importera från en kurs? You can always import content from your own courses. Each course also has a setting to allow every teacher in the school to import content from it. Du kan alltid importera innehåll från dina egna kurser. Varje kurs har dessutom en inställning för att göra det möjligt för andra lärare på skolan att importera innehåll från den. For existing courses, the setting has to be manually enabled, but when you create a new course, it will be enabled by default. För befintliga kurser behöver inställningen aktiveras manuellt, men när du skapar en ny kurs så är inställningen aktiverad per default. View all news → Visa alla nyheter → .we-love-learning { fill: #ff0000; width: 1em; height: 1em; animation: 1.6s ease we-love-learning-heart-beat; animation-iteration-count: infinite; animation-direction: alternate-reverse; } .dark .we-love-learning { fill: #ff4a4a; } @keyframes we-love-learning-heart-beat { from { transform: scale(1.2); } to { transform: scale(1); } } We love learning"
    },
    {
        "title": "Choose visibility for the content in course items",
        "description": "Choose visibility for the content in course items",
        "url": "/news/2024/01/content-visibility.html",
        "content": "Choose visibility for the content in course items Välja synlighet för innehåll på kursdelar Frida Brodin January 30, 2024 30 januari, 2024 Learnpoint has been updated with a new setting for course items: Content visibility. The setting makes it possible to choose whether the course item content should be visible immediately or from a certain point in time. Learnpoint har uppdaterats med en ny inställning för kursdelar: Innehållets synlighet. Inställningen gör det möjligt att välja om kursdelens innehåll ska visas direkt eller från en viss tidpunkt. This is what the setting looks like: Så här ser inställningen ut: How the setting works Så här fungerar inställningen You can choose between two options: Du kan välja mellan två alternativ: Synligt direkt. The content is visible immediately, just like before. Synligt från. The content is visible from the time you selected. Synligt direkt. Innehållet visas direkt, precis som tidigare. Synligt från. Innehållet visas från den tidpunkt du valt. How it looks like for the students Så här ser det ut för studenterna If you select \"Synligt från\", the students will be able to see the course item while the content itself is hidden. Instead, information about when the content will become visible is displayed: Om du väljer \"Synligt från\" kommer studenterna att kunna se kursdelen, men däremot är själva innehållet dolt. Istället visas information om när innehållet kommer att bli synligt: View all news → Visa alla nyheter → .we-love-learning { fill: #ff0000; width: 1em; height: 1em; animation: 1.6s ease we-love-learning-heart-beat; animation-iteration-count: infinite; animation-direction: alternate-reverse; } .dark .we-love-learning { fill: #ff4a4a; } @keyframes we-love-learning-heart-beat { from { transform: scale(1.2); } to { transform: scale(1); } } We love learning"
    },
    {
        "title": "Course item attachments moves to content",
        "description": "Course item attachments moves to content",
        "url": "/news/2024/02/moving-attachment-to-content.html",
        "content": "Course item attachments moves to content Kursdelarnas bilagor flyttas till innehållet Karl West February 27, 2024 27 februari, 2024 Tonight, Feb 27, there will be an update regarding files in course items. Previously, you added files as attachments, and now you'll add files to the content instead. I kväll den 27 feb förändras hanteringen av filer i kursdelarna. Tidigare lade man till filer som bilagor, men nu kommer man istället lägga till dom direkt i innehållet. During the update, all existing attachments will be moved to the content. This move is automatic: I samband med förändringen kommer alla befintliga bilagor flyttas till innehållet. Flytten sker helt automatiskt: View all news → Visa alla nyheter → .we-love-learning { fill: #ff0000; width: 1em; height: 1em; animation: 1.6s ease we-love-learning-heart-beat; animation-iteration-count: infinite; animation-direction: alternate-reverse; } .dark .we-love-learning { fill: #ff4a4a; } @keyframes we-love-learning-heart-beat { from { transform: scale(1.2); } to { transform: scale(1); } } We love learning"
    },
    {
        "title": "Import sections",
        "description": "Import sections",
        "url": "/news/2024/04/import-sections.html",
        "content": "Import sections Importera avsnitt Karl West April 4, 2024 4 april, 2024 The feature Import content makes it easy to reuse course content, but the feature have had a limitation. It wasn't possible to import a section without also importing course items from that section. Funktionen Importera innehåll används för att återanvända kursinnehåll, men funktionen har haft en begränsning. Det gick inte att importera ett avsnitt utan att även importera kursdelar från avsnittet. This limitation is removed and it's now possible to import sections without having to import course items: Begränsningen är borttagen och nu går det att importera avsnitt utan att man behöver importera kursdelar: View all news → Visa alla nyheter → .we-love-learning { fill: #ff0000; width: 1em; height: 1em; animation: 1.6s ease we-love-learning-heart-beat; animation-iteration-count: infinite; animation-direction: alternate-reverse; } .dark .we-love-learning { fill: #ff4a4a; } @keyframes we-love-learning-heart-beat { from { transform: scale(1.2); } to { transform: scale(1); } } We love learning"
    },
    {
        "title": "New feature: Startpage",
        "description": "New feature: Startpage",
        "url": "/news/2024/12/start-page.html",
        "content": "New feature: Startpage Ny funktion: Startsida Karl West December 3, 2024 3 december, 2024 At the end of the month, December 2024, Learnpoint will be updated with a new startpage. The startpage will show your current groups, and it will be the first thing you see when you sign in. It will look something like this: I slutet av månaden, december 2024, kommer Learnpoint uppdateras med en ny startsida. Startsidan visar dina aktuella grupper och blir det första du ser när du loggar in. Ungefär såhär kommer startsidan se ut: Different design but the same features Ny design men samma funktioner Learnpoint will look different after the update. The left menu, for example, will be removed and replaced with a top menu. But the actual features in Learnpoint will behave like before. Learnpoint kommer se annorlunda ut efter uppdateringen, exempelvis försvinner vänstermenyn och ersätts av en toppmeny, men själva funktionerna i Learnpoint kommer fungera som förut. In this short video clip, a teacher is grading a student, and as you can see, the workflow is the same as before: I det här videoklippet sätter en lärare betyg på en student, och som du kan se, så fungerar flödet likadant som tidigare: Notifications in the top menu Aviseringar i toppmenyn The notifications will be moved into a top menu. This means that you can \"sneek peek\" your notifications, without leaving the page you're currently on: Aviseringarna kommer flyttas till en toppmeny. Det innebär att du kan \"tjuvkika\" på aviseringarna, utan att behöva lämna sidan du befinner dig på: School Logo Logga The update will make it possible to use a custom school logo. The logo will be visible both on the sign-in page and the startpage: Efter uppdateringen blir det också möjligt att använda en egen logga. Loggan visas både på inloggningssidan och startsidan: Thoughts or questions? Tankar eller funderingar? Don't hesitate to reach out if you have any thoughts or questions about this update. Our support team always appreciate your feedback! Tveka inte att höra av dig med frågor och synpunkter. Vårt support team uppskattar alltid feedback! View all news → Visa alla nyheter → .we-love-learning { fill: #ff0000; width: 1em; height: 1em; animation: 1.6s ease we-love-learning-heart-beat; animation-iteration-count: infinite; animation-direction: alternate-reverse; } .dark .we-love-learning { fill: #ff4a4a; } @keyframes we-love-learning-heart-beat { from { transform: scale(1.2); } to { transform: scale(1); } } We love learning"
    },
    {
        "title": "New feature: Group Shortcuts",
        "description": "New feature: Group Shortcuts",
        "url": "/news/2025/01/group-shortcuts.html",
        "content": "New feature: Group Shortcuts Ny funktion: Genvägar till grupper Karl West January 28, 2025 28 januari, 2025 Learnpoint has been updated with a new feature: Group Shortcuts. The shortcuts make it possible to switch between groups, without having to navigate via the startpage. Learnpoint har uppdaterats med en ny funktion: Genvägar till grupper. Genvägarna gör det möjligt att växla mellan grupper, utan att behöva gå via startsidan. Here's how the shortcuts work: Såhär fungerar genvägarna: View all news → Visa alla nyheter → .we-love-learning { fill: #ff0000; width: 1em; height: 1em; animation: 1.6s ease we-love-learning-heart-beat; animation-iteration-count: infinite; animation-direction: alternate-reverse; } .dark .we-love-learning { fill: #ff4a4a; } @keyframes we-love-learning-heart-beat { from { transform: scale(1.2); } to { transform: scale(1); } } We love learning"
    },
    {
        "title": "Course Item Comments",
        "description": "Course Item Comments",
        "url": "/news/2025/04/course-item-comments.html",
        "content": "Course Item Comments Kommentarer på kursdelar Zuzana Roháčová April 14, 2025 14 april, 2025 Course items in Learnpoint have been updated with a comments section. This makes it possible for students and teachers to discuss the content. Kursdelarna i Learnpoint har fått kommentarer. Det gör det möjligt för studenter och lärare att diskutera innehållet i kursdelarna. This is how it looks for teachers (the comments are at the bottom of the page): Såhär ser det ut för lärare (kommentarerna finns längst ned på sidan): The student view is changed and is now divided into two separate tabs. The first tab Innehåll contains the content and the new comments section: Studenternas sida har ändrats och är nu uppdelad på två olika flikar. På den första fliken Innehåll finns kursdelens innehåll och den nya kommentarfunktionen: The second tab Uppgift/Betyg contains the grading, the assignment, and comments. These comments are not visible to the whole group, only to the individual student and the teachers in the group: På den andra fliken Uppgift/Betyg finns uppgift, betyg, och kommentarer. Dessa kommentarer visas inte för hela gruppen, utan endast för den enskilda studenten och lärarna i gruppen: View all news → Visa alla nyheter → .we-love-learning { fill: #ff0000; width: 1em; height: 1em; animation: 1.6s ease we-love-learning-heart-beat; animation-iteration-count: infinite; animation-direction: alternate-reverse; } .dark .we-love-learning { fill: #ff4a4a; } @keyframes we-love-learning-heart-beat { from { transform: scale(1.2); } to { transform: scale(1); } } We love learning"
    },
    {
        "title": "Upload Files in Comments",
        "description": "Upload Files in Comments",
        "url": "/news/2025/05/upload-files-in-comments.html",
        "content": "Upload Files in Comments Ladda upp filer i kommentarer Dhanfia Rahman May 5, 2025 5 maj, 2025 The comments in Learnpoint have been updated. It's now possible to upload files. Kommentarerna i Learnpoint har uppdaterats. Nu är det möjligt att ladda upp filer. Here's how the comments can look like with an uploaded file: Såhär kan kommentarerna se ut med en uppladdad fil: View all news → Visa alla nyheter → .we-love-learning { fill: #ff0000; width: 1em; height: 1em; animation: 1.6s ease we-love-learning-heart-beat; animation-iteration-count: infinite; animation-direction: alternate-reverse; } .dark .we-love-learning { fill: #ff4a4a; } @keyframes we-love-learning-heart-beat { from { transform: scale(1.2); } to { transform: scale(1); } } We love learning"
    },
    {
        "title": "Grading Scales",
        "description": "Grading Scales",
        "url": "/news/2025/06/grading-scales.html",
        "content": "New feature: Grading Scales Ny funktion: Betygsskalor Frida Brodin June 10, 2025 10 juni, 2025 On Thursday the 12th of June, Learnpoint will be updated with a new feature: Grading Scales. The feature makes it possible to customize existing scales, as well as adding new scales. Torsdagen den 12 juni kommer Learnpoint att uppdateras med en ny funktion: Betygsskalor. Funktionen gör det möjligt att anpassa befintliga betygsskalor och lägga till nya. The feature will be particularly benificial for schools that run multiple forms of educations, because you can now use different scales for different courses. Funktionen kan vara särskilt användbar för skolor som bedriver olika typer av utbildningar. Nu kan du nämligen använda olika skalor i olika kurser. If you have the role as School Administrator, you'll find the feature in the more menu: Om du har rollen Skoladministratör så hittar du funktionen i mer-menyn: On the grading scales page, you can add new scales and customize existing ones: På sidan för betygsskalor kan du lägga till nya skalor eller redigera de som redan finns: TIP: Grading steps are typically expressed in letters or numbers. But this feature also makes it possible to use emojis, which could be useful in some situations. Here's an example with two emojis, a red cross and a green checkmark: TIPS: Betygssteg visas ofta med bokstäver eller siffror. Den nya funktionen gör det möjligt att använda emojis, vilket skulle kunna vara användbart i vissa situationer. Här är ett exempel på ett rött kryss och en grön bock: If you want to know more about how grading scales work, don't hesitate to contact our support team. We're always happy to help. Om du vill veta mer om hur betygsskalor fungerar, tveka inte att kontakta vår support. Vi hjälper gärna till. View all news → Visa alla nyheter → .we-love-learning { fill: #ff0000; width: 1em; height: 1em; animation: 1.6s ease we-love-learning-heart-beat; animation-iteration-count: infinite; animation-direction: alternate-reverse; } .dark .we-love-learning { fill: #ff4a4a; } @keyframes we-love-learning-heart-beat { from { transform: scale(1.2); } to { transform: scale(1); } } We love learning"
    },
    {
        "title": "Upload Files in Comments",
        "description": "Upload Files in Comments",
        "url": "/news/2025-05/upload-files-in-comments.html",
        "content": ""
    },
    {
        "title": "Grading Scales",
        "description": "Grading Scales",
        "url": "/news/2025-06/grading-scales.html",
        "content": ""
    },
    {
        "title": "Learnpoint: News",
        "description": "Learnpoint News, Learnpoint Nyheter",
        "url": "/news/index.html",
        "content": "News Nyheter On this page you'll find product announcements and updates. To get notified by email, subscribe to our newsletter. Här publiceras produktnyheter och uppdateringar. Vill du få nyheterna skickad till din mejl kan du prenumerera på vårt nyhetsbrev. New feature: Grading scales Ny funktion: Betygsskalor 10 June 2025 10 juni 2025 Upload Files in Comments Ladda upp filer i kommentarer 5 May 2025 5 maj 2025 Course Item Comments Kommentarer på kursdelar 14 Apr 2025 14 apr 2025 New feature: Group Shortcuts Ny funktion: Genvägar till grupper 28 Jan 2025 28 jan 2025 New feature: Startpage Ny funktion: Startsida 3 Dec 2024 3 dec 2024 Import sections Importera avsnitt 4 Apr 2024 4 apr 2024 Course item attachments moves to content Kursdelarnas bilagor flyttas till innehållet 27 Feb 2024 27 feb 2024 Choose visibility for the content in course items Välja synlighet för innehåll på kursdelar 30 Jan 2024 30 jan 2024 New feature: Import content Ny funktion: Importera innehåll 18 Oct 2023 18 okt 2023 New feature: Discussion Channels Ny funktion: Diskussionskanaler 21 Jun 2023 21 jun 2023 Switch off notifications on groups Stänga av aviseringar på grupper 6 Dec 2022 6 dec 2022 Comments on announcements Kommentarer på nyheter 17 Oct 2022 17 okt 2022 Show if survey is anonymous Visa om enkät är anonym 13 Oct 2022 13 okt 2022 Gradebook colors Färger på betygssidan 10 Oct 2022 10 okt 2022 New feature: Notifications Ny funktion: Aviseringar 12 Sep 2022 12 sep 2022 Group code in title field Gruppkod i titelfältet 10 Jun 2022 10 jun 2022 Breadcrumb shortcuts Genvägar i brödsmulorna 22 Nov 2021 22 nov 2021"
    },
    {
        "title": "Unsubscribed",
        "description": "Unsubscribed. Prenumerationen avslutad.",
        "url": "/news/unsubscribed/index.html",
        "content": "Unsubscribed! Prenumerationen avslutad! You're now unsubscribed from Learnpoint News. Go to the news page if you want to re-subscribe or read the news online. Din prenumeration på Learnpoint News har avslutats. Gå till nyhetssidan om du vill prenumerera igen eller läsa nyheterna online."
    },
    {
        "title": "Learnpoint: Sign In",
        "description": "Sign In to Learnpoint",
        "url": "/sign-in.html",
        "content": "Choose school Välj skola Your previous sign ins Dina tidigare inloggningar Trouble signing in? Read more here! Problem att logga in? Läs mer här!"
    },
    {
        "title": "Learnpoint: Status",
        "description": "Learnpoint Status & Uptime",
        "url": "/status/index.html",
        "content": ""
    }
]