[
    {
        "title": "Kursinnehåll / Kursdelar",
        "description": "Kursinnehåll / Kursdelar - Learnpoint Hjälp och Support",
        "url": "/help/content/course-items.html",
        "content": "Kursdelar This page is only available in swedish. Kursdelarna kan innehålla information, uppgifter och bifogade filer. Lägg till kursdel En kursdel måste alltid ligga i ett avsnitt. Se till att det finns avsnitt innan du lägger till en kursdel. Välj i vilket avsnitt kursdelen skall läggas till. Klicka på Ny kursdel. Fyll i namn. Klicka på Skapa: Publicera kursdel Kursdelarna (och avsnitten) visas inte för studenterna förrän dom är publicerade. Klicka på meny-ikonen (dom tre prickarna till höger). Klicka på Publicera: Lägg till innehåll Kursdelarna kan innehålla text, länkar, bilder, filmer och bifogade filer. Klicka på kursdelen. Klicka på redigeringsknappen (den grå pennan till höger om kursdelens namn). Lägg till text, länkar, bilder, etc. Klicka på Spara: Ange inställningar Det finns fyra inställningar på varje kursdel. Uppgift: Inställningen anger om kursdelen skall vara en inlämningsuppgift. Tid: Anger ett tidsintervall eller endast en sluttid. Betyg: Anger om läraren skall sätta betyg på kursdelen. Bilagor: Anger vilka filer som hör till kursdelen. Såhär gör du för att ange kursdelens inställningar: Klicka på kursdelen. Klicka på redigeringsknappen (den grå pennan till höger om inställningen). Välj inställning. Klicka på Spara: Flytta kursdel Kursdelarna kan flyttas så att dom hamnar i rätt ordning. Klicka på meny-ikonen till höger (dom tre prickarna till höger). Klicka på Flytta. Nu visas blå knappar som indikerar vart du kan flytta kursdelen. Klicka på någon av dom blå knapparna: Ta bort kursdel Klicka på meny-ikonen (dom tre prickarna till höger). Klicka på Ta bort: Återställ borttagen kursdel Borttagna kursdelar sparas i 30 dagar. Under den tiden är det möjligt att återställa dom. Skrolla längst ned på innehållsidan. Klicka på Visa borttagna. Hitta den kursdel du vill återställa. Klicka på Återställ."
    },
    {
        "title": "Kursinnehåll / Inledning",
        "description": "Kursinnehåll / Inledning - Learnpoint Hjälp och Support",
        "url": "/help/content/introduction.html",
        "content": "Kursinnehåll This page is only available in swedish. Innehållet i kurserna byggs upp av kursdelar och avsnitt. Kursdelarna kan innehålla information, uppgifter och bifogade filer. Avsnitten fungerar som platshållare för kursdelarna, så att du kan ge innehållet en tydlig struktur. Kursinnehållet finns på fliken Innehåll i respektive kurs:"
    },
    {
        "title": "Kursinnehåll / Avsnitt",
        "description": "Kursinnehåll / Avsnitt - Learnpoint Hjälp och Support",
        "url": "/help/content/sections.html",
        "content": "Avsnitt This page is only available in swedish. Avsnitten fungerar som platshållare för kursdelarna så att du kan ge kursinnehållet en tydlig struktur. Lägg till avsnit Skrolla längst ned på innehållssidan. Klicka på Nytt avsnitt. Fyll i namn. Fyll i beskrivning om du vill. Klicka på Skapa: Publicera avsnitt Avsnitten (och kursdelarna) visas inte för studenterna förrän dom är publicerade. Klicka på meny-ikonen (dom tre prickarna till höger). Klicka på Publicera: Flytta avsnitt Avsnitten kan flyttas så att dom hamnar i rätt ordning. Klicka på meny-ikonen till höger (dom tre prickarna till höger). Klicka på Flytta. Nu visas blå knappar som indikerar vart du kan flytta avsnittet. Klicka på någon av dom blå knapparna: Ta bort avsnitt Klicka på meny-ikonen (dom tre prickarna till höger). Klicka på Ta bort: Återställ borttaget avsnitt Borttagna avsnitt sparas i 30 dagar. Under den tiden är det möjligt att återställa dom. Skrolla längst ned på innehållsidan. Klicka på Visa borttagna. Hitta det avsnitt du vill återställa. Klicka på Återställ."
    },
    {
        "title": "Kom igång / Aviseringar",
        "description": "Aviseringar - Learnpoint Hjälp och Support",
        "url": "/help/getting-started/notifications.html",
        "content": "Aviseringar This page is only available in swedish. Du behöver inte klicka runt i Learnpoint för att se vad som hänt. Allt nytt finns på aviseringssidan. Aviseringssidan Aviseringssidan hittar du längst upp i menyn till vänster: Vad aviserar Learnpoint om? Learnpoint aviserar om nyheter, kommentarer, enkäter, LIA-platser och loggböcker. För att få aviseringar från en grupp, måste du vara medlem gruppen. Om du är administratör eller utbildningsledare för en klass, har du behörighet till flera grupper utan att vara medlem. Vill du få aviseringar från dessa grupper behöver du lägga till dig själv som medlem. Markera avisering som läst När du klickar på en avisering kommer du till det aviseringen avser (ex. en nyhet eller en kommentar). Aviseringen markeras automatiskt som läst när du klickar på den. Du kan även manuellt markera en avisering som läst. Klicka på meny-ikonen (dom tre prickarna till höger) och sedan på Markera som läst: För att markera alla aviseringar som lästa, klicka på Markera alla som lästa: Markera avisering som oläst Om en avisering är läst, kan du markera den som oläst. Klicka på meny-ikonen (dom tre prickarna till höger) och sedan på Markera som oläst: Bli aviserad med e-post Du kan välja att bli aviserad med e-post. Aviseringarna visas alltid på aviseringssidan, men du kan dessutom få e-post när det kommer nya aviseringar. För att bli aviserad med e-post, klicka på kugghjulet och kryssa sedan i checkboxen:"
    },
    {
        "title": "Kom igång / Profilsidan",
        "description": "Profilsidan - Learnpoint Hjälp och Support",
        "url": "/help/getting-started/profile-page.html",
        "content": "Profilsidan This page is only available in swedish. På din profilsida finns allmän information om dig som exempelvis namn, e-post och bild. Du kommmer till profilsidan genom att klicka på ditt namn längst ned i menyn till vänster: Ändra profil Klicka på pennan för att ändra profilbild och på Redigera för att ändra information: Byt lösenord Klicka på Byt lösenord för att byta lösenord:"
    },
    {
        "title": "Kom igång / Logga in",
        "description": "Logga in - Learnpoint Hjälp och Support",
        "url": "/help/getting-started/sign-in.html",
        "content": "Logga in This page is only available in swedish. Hitta till skolans inloggningssida Gå till learnpoint.se/sign-in.html Ange adressen till din skola. Klicka på Fortsätt för att komma till skolans inloggningssida. Aktivera konto Om det är första gången du loggar in behöver du aktivera ditt konto: Gå till skolan inloggningssida (se ovan). Klicka på Aktivera konto. Ange din e-postadress och klicka på OK. Du får inom kort ett mail med instruktioner för att aktivera kontot. Logga in När du aktiverat ditt konto loggar du in på följande sätt: Gå till skolan inloggningssida (se ovan). Ange användarnamn och lösenord. Klicka på Logga in. Problem att logga in? Kontrollera användarnamnet. Observera att du inte kan logga in med en mailadress. Kontrollera att Caps Lock inte är aktiverat på tangentbordet. Har du glömt ditt lösenord kan du återställa det. Klicka på Glömt ditt lösenord? och följ instruktionerna. Lyckas du ändå inte logga in? Kontakta vår support så hjälper vi till!"
    },
    {
        "title": "Betyg / Kursdelar",
        "description": "Betyg / Kursdelar - Learnpoint Hjälp och Support",
        "url": "/help/grading/course-items.html",
        "content": "Kursdelar This page is only available in swedish. Aktivera betygsättning på kursdelar För att kunna betygsätta en kursdel behöver det anges bland inställningarna på kursdelen: Uppföljningssidan Varje kursdel har en uppföljningssida. På den visas: En liten blå ikon för nya inlämningar. En siffra för nya kommentarer. Det angivna betyget. Om betyget har publicerats. En knapp för att publicera samtliga betyg som inte publicerats. Sätt betyg på kursdel Gå till kursdelens uppföljningssida. Klicka på en student. Välj betyg. Ange Feedback om du vill förtydliga betyget på något sätt. Klicka på Publicera när du vill att studenten skall se betyget. Du kan även öppna inlämningsuppgifter och skriva kommentarer till studenten. Använd genvägarna för att navigera till nästa student. Ta bort betyg på kursdel Gå till studenten. Klicka på meny-ikonen (dom tre prickarna till höger). Klicka på Ta bort betyget. Klicka på Ta bort. Klicka på Publicera när du vill att borttagningen skall visas för studenten. Klicka på OK."
    },
    {
        "title": "Betyg / Kurser",
        "description": "Betyg / Kurser - Learnpoint Hjälp och Support",
        "url": "/help/grading/courses.html",
        "content": "Kurser This page is only available in swedish. En överblick av samtliga betyg på en kurs finns på fliken Betyg. Kursbetygen visas i den första kolumnen: Sätt betyg på kurs Gå till fliken Betyg. Klicka på rutan för kursbetyg på någon av studenterna. Välj betyg. Klicka på Klarrapportera när du är färdig med betygsättningen. Klicka på Publicera när du vill att betyget skall visas för studenten. NOTERA: Ibland har du som lärare inte behörighet att publicera kursbetyg och då kan du hoppa över detta steg. Välj nästa student bland genvägarna: Ta bort på kurs Gå till studentens kursbetyg. Klicka på meny-ikonen (dom tre prickarna till höger). Klicka på Ta bort betyget. Klicka på Ta bort. Klicka på Klarrapportera. Klicka på Publicera när du vill att borttagningen skall visas för studenten. NOTERA: Ibland har du som lärare inte behörighet att publicera kursbetyg och då kan du hoppa över detta steg."
    },
    {
        "title": "Betyg / Inledning",
        "description": "Betyg / Inledning - Learnpoint Hjälp och Support",
        "url": "/help/grading/introduction.html",
        "content": "Betyg This page is only available in swedish. Betyg kan sättas både på kurser och kursdelar. En överblick av alla betyg finns på fliken Betyg i respektive kurs: På studenternas profilsida, under fliken Studieplan, finns en överblick av studentens kursbetyg:"
    },
    {
        "title": "Grupper / Om",
        "description": "Grupper / Om - Learnpoint Hjälp och Support",
        "url": "/help/groups/about.html",
        "content": "Om This page is only available in swedish. Varje grupp har en sida med allmän information: Redigera allmän information om gruppen Klicka på Redigera för att ändra gruppens information:"
    },
    {
        "title": "Grupper / Material",
        "description": "Grupper / Material - Learnpoint Hjälp och Support",
        "url": "/help/groups/documents.html",
        "content": "Material This page is only available in swedish. Med materialfunktionen kan du lagra filer och länkar i grupper av typen klass och skola. Funktionen finns på fliken Material: Lägg till Lägg till en fil eller en länk genom att klicka på Lägg till och följ sedan instruktionerna: Ändra och ta bort Längst till höger på sidan finns knappar för att ändra och ta bort:"
    },
    {
        "title": "Grupper / Inledning",
        "description": "Grupper / Inledning - Learnpoint Hjälp och Support",
        "url": "/help/groups/introduction.html",
        "content": "Grupper This page is only available in swedish. Learnpoint är huvudsakligen organiserat i grupper. Varje grupp innehåller information och funktionalitet för just den gruppen. Det finns tre typer av grupper i Learnpoint — skola, klass och kurs. Dom fungerar på ungefär samma sätt, men det finns några skillnader. Funktionen innehåll finns endast i kurser, och funktionen material finns endast i klasser och skolan. Aktuella grupper &quot;Aktuella grupper&quot; är dom grupper som du är medlem i och som pågår just nu. Du hittar dina aktuella grupper i menyn till vänster: Alla grupper Klicka på Grupper för att se och söka bland alla dina grupper:"
    },
    {
        "title": "Grupper / Nyheter",
        "description": "Grupper / Nyheter - Learnpoint Hjälp och Support",
        "url": "/help/groups/posts.html",
        "content": "Nyheter This page is only available in swedish. Du kan skriva nyheter för att meddela information till medlemmarna i en grupp. Nyheterna finns under fliken Nyheter i respektive grupp: Skriva och publicera nyheter För att skriva en nyhet, klicka först på Skriv nyhet uppe till vänster. Fyll sedan i titel, innehåll och klicka på Publicera: Spara utkast När du publicerar en nyhet får medlemmarna i gruppen en avisering och kan läsa nyheten. Om du vill spara nyheten men publicera vid ett senare tillfälle, klickar du istället på Spara utkast: Dina sparade utkast finns under Dina utkast uppe till höger på nyhetsfliken:"
    },
    {
        "title": "Grupper / Personal",
        "description": "Grupper / Personal - Learnpoint Hjälp och Support",
        "url": "/help/groups/staff.html",
        "content": "Personal This page is only available in swedish. Varje grupp innehåller personal. Personalen visas på fliken Personal: Lägg till personal Klicka på Lägg till. Fyll i mailadress och klicka på Nästa. Kryssa i dom roller personalen skall ha i gruppen. Klicka på Klar: Om personalen är helt ny på skolan, behöver du även ange namn, signatur, e-post, m.m. Ta bort eller ändra roll för personal Klicka på dom tre prickarna längst till höger. Klicka på Redigera medlemskap. Klicka på Ta bort eller Ändra roll. Om du valde att ändra roll, kryssa i rätt roller och klicka sedan på Spara: Vilka roller som kan väljas beror på vilken typ av grupp det är. Visa profilsidan för personal Varje personal har en profilsida med allmän information. Klicka på personalens bild. Klicka på Visa profilsidan. På profilsidan kan du se information om personalen:"
    },
    {
        "title": "Grupper / Studenter",
        "description": "Grupper / Studenter - Learnpoint Hjälp och Support",
        "url": "/help/groups/students.html",
        "content": "Studenter This page is only available in swedish. Varje grupp innehåller studenter. I grupper av typen kurs finns studenterna på fliken Deltagare och i grupper av typen skola och klass finns dom på fliken Studerande: Lägg till student Studenter kan endast läggas till på klasser. (Du kan inte lägga till studenter på skolan eller på kurser). När du lagt till en student på en klass, blir hon automatiskt tillagd på skolan och på klassens ingående kurser. Klicka på Lägg till. Klicka på Lägg till studerande. Fyll i personnummer och klicka på Nästa. Välj status och datum. Klicka på Klar: Om studenten är helt ny på skolan, behöver du även ange namn, födelsedatum, adress, m.m. Ta bort student Man kan inte ta bort en student direkt från skolan eller från en kurs. Istället ändrar man studentens status i en klass och hennes medlemskap på skolan och klassens kurser uppdateras då automatiskt. Klicka på dom tre prickarna längst till höger. Klicka på Ändra status. Välj status och datum. Klicka på Spara: Visa profilsidan för en student Varje student har en profilsida med allmän information, kalender, studieplan och dokumentation. Klicka på studentens bild. Klicka på Visa profilsidan. På profilsidan kan du bläddra mellan dom olika funktionerna:"
    },
    {
        "title": "Hjälp",
        "description": "Learnpoint Hjälp och Support",
        "url": "/help/index.html",
        "content": "Help Hjälp Support Support support@learnpoint.se +46 850 126 090 08 - 50 12 60 90 Phone opening hours Open Closed Closed for lunch Telefontider Öppet Stängt Lunchstängt const phoneSupportOpenHours = { 0: [], // Sun 1: [9, 10, 11, 13, 14, 15], // Mon 2: [9, 10, 11, 13, 14, 15], // Tue 3: [9, 10, 11, 13, 14, 15], // Wed 4: [9, 10, 11, 13, 14, 15], // Thu 5: [9, 10, 11], // Fri 6: [], // Sat }; function phoneSupportIsOpen() { const nowAtOffice = new Date((new Date()).toLocaleString('en-US', { timeZone: 'Europe/Stockholm' })); const dayAtOffice = nowAtOffice.getDay(); const hourAtOffice = nowAtOffice.getHours(); const openNow = phoneSupportOpenHours[dayAtOffice].includes(hourAtOffice); const openPreviousHour = phoneSupportOpenHours[dayAtOffice].includes(hourAtOffice - 1); const openNextHour = phoneSupportOpenHours[dayAtOffice].includes(hourAtOffice + 1); return { openNow, openPreviousHour, openNextHour }; } const { openNow, openPreviousHour, openNextHour } = phoneSupportIsOpen(); const supportOpeningHoursPanel = document.querySelector('.help-index-page__support-opening-hours'); if (openNow) { supportOpeningHoursPanel.classList.add('OPEN'); } else { if (openPreviousHour && openNextHour) { supportOpeningHoursPanel.classList.add('CLOSED-FOR-LUNCH'); } else { supportOpeningHoursPanel.classList.add('CLOSED'); } } Mon-Thu Mån-Tor 9am-12pm and 1pm-4pm 9-12 och 13-16 Fri Fre 9am-12pm 9-12 User guides Dokumentation Check out the guides in the menu to the left for instructions on how to use Learnpoint. I menyn till vänster hittar du instruktioner för alla funktioner i Learnpoint. Check out the guides in the I menu in the upper right corner for instructions on how to use Learnpoint. menyn uppe till höger hittar du instruktioner för alla funktioner i Learnpoint. News Nyheter Product announcements and updates are published on the news page, where you also can subscribe to our newsletter. På nyhetssidan publiceras produktnyheter och uppdateringar. Där kan du även prenumerera på vårt nyhetsbrev. Feedback Feedback We really appreciate feedback from our users. Get in touch with our support with your ideas on how we can improve Learnpoint. Vi uppskattar alltid feedback från våra användare. Kontakta vår support med synpunkter och förslag kring Learnpoint. User testing Användartester If you want to participate in user testing or user interviews, please send an email to: karl.west@learnpoint.se Vill du delta i användartester eller verksamhetsintervjuer? Skicka en intresseanmälan till: karl.west@learnpoint.se"
    },
    {
        "title": "LIA / LIA-plats",
        "description": "LIA / LIA-plats - Learnpoint Hjälp och Support",
        "url": "/help/internship/internship.html",
        "content": "LIA-plats This page is only available in swedish. Lägg till LIA-plats Både studenter och personal kan lägga till LIA-platser. Såhär gör du som personal: Gå till LIA-verktyget. Välj student. Klicka på Registrera LIA-plats. Ange handledarens mejladress. Klicka på Nästa. Ange information om handledaren. Klicka på Nästa. Ange information om praktikplatsen. Klicka på Spara. Godkänn LIA-plats För att en LIA-plats skall anses godkänd, behöver den godkännas av samtliga parter: studenten, handledare och skolan. Studenten och handledaren godkänner på egen hand, men som personal kan du dessutom godkänna åt dom: Gå till LIA-platsen Klicka i kryssboxarna för dom du vill godkänna åt:"
    },
    {
        "title": "LIA / Inledning",
        "description": "LIA / Inledning - Learnpoint Hjälp och Support",
        "url": "/help/internship/introduction.html",
        "content": "Inledning This page is only available in swedish. LIA är ett verktyg för att hantera praktik under utbildningen. Verktyget finns på LIA-kurser under fliken LIA: LIA-processen Innan praktiken börjar behöver studentera söka och hitta en lämplig praktikplats. Under denna period kan studenterna uppmanas att skriva om sitt sökande i loggboken. Loggboken är en del av LIA-verktyget. När studenten hittat praktikplats så registrerar hon den i verktyget. Handledaren på praktikföretaget får ett mejl och uppmanas att godkänna praktikplatsen och en överenskommelse. Under praktiken kan studenterna uppmanas skriva om sina erfarenheter i loggboken. När praktiken är slut får studenten och handledaren besvara varsin enkät. Svaren från studenten används för att utvärdera praktikföretaget, och svaren från handledaren används som betygsunderlag."
    },
    {
        "title": "LIA / Inställningar",
        "description": "LIA / Inställningar - Learnpoint Hjälp och Support",
        "url": "/help/internship/settings.html",
        "content": "Inställningar This page is only available in swedish. Inställningar på kursen Inställningarna för LIA-vertyget finns under länken LIA-inställningar på fliken LIA: Verktyget har inställningar för: Loggbok under sökande. Loggbok under praktik. Automatisk publicering till handledare. Möjlighet att bifoga filer. Instruktioner till handledare. Överenskommelsen som handledaren godkänner innan praktiken. Här är ett exempel på hur inställningarna kan se ut: Skolövergripande inställningar Du som administratör kan ändra dom skolövergripande standardinställningarna för LIA-verktyget. Inställningarna finns i menyn till vänster: Inställningar för enkäter Inställningarna för LIA-vertygets enkäter finns under länken LIA-enkäter på fliken LIA: LIA-verktyget har enkätinställningar för: Studentenkäten som besvaras av studenten när praktiken är klar. Handledarenkäten som besvaras av handledaren när praktiken är klar. Här är ett exempel på hur inställningarna kan se ut:"
    },
    {
        "title": "Learnpoint",
        "description": "Skapa utbildningar, registrera studenter, dela ut uppgifter, skriv nyheter, och betygsätt studenter. Allt på ett ställe.",
        "url": "/index.html",
        "content": "Learnpoint Learnpoint Integrated LMS and SIS Integrerad lärplattform och skoladministration Create programmes, write announcements, enroll students, hand out assignments, and assess student work. All in one place. Skapa utbildningar, registrera studenter, dela ut uppgifter, skriv nyheter, och betygsätt studenter. Allt på ett ställe. Announcements Nyheter Write announcements to all students in a group or course. An efficient way to communicate information. Skriv nyheter till alla studenter i en klass eller kurs. Ett effektivt sätt att förmedla information. Assignments Uppgifter Create and hand out assignments. You can sort the assignments into sections to give the course a clear structure. Skapa och dela ut uppgifter. Du kan sortera in uppgifterna i avsnitt för att ge kursen en tydlig struktur. Grading Betyg You can grade both courses and assignments. Each course has a comprehensible grading overview. Du kan betygsätta både kurser och uppgifter. I varje kurs finns en överskådlig sammanställning. Want to know more? Vill du veta mer? Would you like a demo, ask a question, or just talk to us? Vill du se en demo, ställa en fråga, eller bara snacka en sväng? Write to hello@learnpoint.se Skriv till hello@learnpoint.se We love learning"
    },
    {
        "title": "Design Challenge Code",
        "description": "",
        "url": "/jobs/2021/02/design-challenge-code.html",
        "content": ""
    },
    {
        "title": "Design Challenge",
        "description": "Design Challenge, February 2021",
        "url": "/jobs/2021/02/design-challenge.html",
        "content": "Design Challenge Designprov February 2021 Februari 2021 This design challenge is part of the application process for a designer position. You have recieved a mail if you're qualified for this challenge. Detta designprov är en del av anställningsprocessen för en tjänst som designer. Du har fått mail om du kvalificerat dig för provet. Challenge Description Instruktion Learnpoint is organized in courses and each course has a document tool. Users can add, search, and view documents. Learnpoint innehåller kurser och varje kurs har ett dokumentverktyg. Användare kan lägga till, söka, och titta på dokument. The documents are sorted alphabetically, but there is no other structure. If there are lots of documents, it is difficult for the user to get a clear overview of all the documents. Dokumenten är sorterade i bokstavsordning, men i övrigt finns ingen struktur. Om det finns många dokument är det svårt för användare att få en god överblick av alla dokument. The problem is not about finding a specific document. If the user knows what document she is looking for, she can use the search feature. The problem is about getting a clear overview if there are lots of documents. Problemet handlar inte om att hitta ett visst dokument. Om användaren vet vilket dokument hon letar efter, så kan hon använda sökfunktionen. Problemet handlar om att få en god överblick när det finns väldigt många dokument. The challenge has two tasks: Provet består av två uppgifter: Find and discuss different solutions to the overview problem. Identifiera och diskutera olika lösningar på problemet med översikt. Implement one of your solutions. Implementera en av dina lösningar. The Document Tool in Learnpoint Dokumentverktyget i Learnpoint Below is an illustration of the document tool in Learnpoint. Nedan är en illustration av dokumentverktyget i Learnpoint. The Document Tool in Learnpoint Dokumentverktyget i Learnpoint How to approach the challange Tips för att lösa uppgiften This design challenge is primarily about showcasing your work processess and the way you think about design problems. When your work is evaluated, the first task will be more important than the second. Make sure to spend enough time on the first task before moving on to the next. Designprovet skall framför allt visa hur du arbetar och resonerar kring ett designproblem. Ditt arbete kommer bedömas med tonvikt på den första uppgiften. Se till att lägga tillräckligt med tid på den första uppgiften innan du går vidare till nästa. The second task should not result in a complete implementation that's ready for deployment. But it needs to be finished enough to demonstrate your chosen solution. If the solution requires a lot of work, you can limit the implementation to just a part of the solution. To get started, you can use the source code from this example. Den andra uppgiften ska inte resultera i en fullständig implementation som är färdig att leverera. Däremot behöver den vara tillräckligt genomarbetad för att demonstrera din valda lösning. Om lösningen är omfattande, kan du begränsa implementationen till en del av lösningen. För att komma igång kan du använda källkoden till detta exempel. Handing in your work Inlämning The first task should be documented in a PDF and the second task should be coded in a HTML file. The files should be zipped before you hand them in. Den första uppgiften skall dokumenteras i en PDF och den andra skall kodas i en HTML-fil. Zippa filerna innan du lämnar in dom. (Alternatively, you can write a blog post for the first task and/or publish the second task on the web. If you choose this option, you should hand in links instead of zipped files.) (Alternativt kan du skriva ett blogginlägg för den första uppgiften och/eller publicera den andra uppgiften på webben. Om du väljer detta alternativ så lämnar du in länkar istället för zippade filer.) Hand in your work no later than March 15th to karl.west@viaecole.se Lämna in ditt arbete senaste den 15 mars till karl.west@viaecole.se We love learning"
    },
    {
        "title": "Designer",
        "description": "Product Designer Position, February 2021",
        "url": "/jobs/2021/02/designer.html",
        "content": "Designer You can no longer apply for this position. You can find all our open positions here. Den här tjänsten går inte längre att söka. Alla våra lediga tjänster finns annonserade här. February 2021 Februari 2021 Learnpoint is an integrated LMS and SIS made for teachers, students, and school managers. The Learnpoint team is on a mission to simplify education and we're now hiring a full time designer. Learnpoint är ett integrerat LMS och administrativt system för lärare, studenter, och skolledare. Vår mission är att förenkla utbildning och nu har vi en ledig tjänst som designer. About the Job Om tjänsten Design is often split into many different roles such as UI, UX, frontend developement, and so on. At Learnpoint, it's all one role. We believe the best designs come from someone who is involved at every step from idea and research to finished product. Design är ofta uppdelat i olika roller som UI, UX, frontend utveckling, och så vidare. Hos oss ligger alla dessa i en och samma roll. Vår övertygelse är att riktigt bra design bygger på ett djupt engagemang i alla aspekter av designprocessen. This means that designers at Learnpoint are generalists. They are projects managers, visual designers, writers, researchers, developers, and more. Hos oss är designers generalister. Dom leder projekt, skriver, skissar, bygger prototyper, implementerar design, och så vidare. You'll spend most of your time designing the product Learnpoint. But occasionally you'll be working on other products, tools, and sites that's part of the company. Största delen av arbetet ägnas åt produkten Learnpoint. Men ibland kommer du jobba med andra produkter, verktyg, och webbsidor som finns inom ramen för bolagets verksamhet. The day-to-day work varies a lot. During our six week work cycles, we mainly focus on designing and building new features. But as a designer, you'll also be working on bug fixes, adjustments, and minor improvements. Between each development cycle, we spend two weeks doing free research. You can read, design games, take a course, or anything else that will advance your design mastery. Det dagliga arbetet varierar mycket. Under våra sex veckors utvecklingsperioder jobbar vi främst med nyutveckling. Men som designer hos oss kommer du även jobba med buggfixar, justeringar, och små förbättringar. Mellan varje utvecklingsperiod har vi två veckors fritt arbete. Du kan läsa, designa spel, gå en kurs, eller vad som helst som utvecklar din designkompetens. The team don't share an office, so everyone works remotely. You can work from home, rent an office, or whatever works best for you. Where, when, and how you work is up to you. Vi har inget gemensamt kontor, så alla jobbar på distans. Du kan jobba hemifrån, hyra en kontorsplats, eller hitta på något annat. Var, hur, och när du jobbar är upp till dig. The job is permanent and full time. Tjänsten är fast och på heltid. Making a career at Learnpoint does not mean giving up on your craft. As you become better at design, you'll advance from junior designer to designer, and then from senior designer to lead designer, and so on. There are five levels of design mastery in total. En karriär hos oss innebär inte att du kommer lämna ditt yrke som designer. När du utvecklar din kompetens kommer du befordras från junior designer till designer, och sedan från senior designer till lead designer, och så vidare. Det finns totalt fem karriärssteg. The salary for a junior designer is 31 416 SEK. Lönen för en junior designer är 31 416 SEK. About Us Om oss Learnpoint is part of the edtech company ViaEcole. We're a customer focused company with two products — Learnpoint and yh-antagning.se. Learnpoint är en del av edtech bolaget ViaEcole. Vi är ett kundorienterat bolag med två produkter — Learnpoint och yh-antagning.se. About You Om dig You are truly interested in design, but perhaps equally interested in humans. How do humans think, how do they learn, what makes them happy? You understand that good design is as much about pixels, as it is about human perception, cognition, and culture. Du är genuint intresserad av design, men kanske minst lika intresserad av människor. Hur tänker dom, hur lär dom sig, och vad gör dom lyckliga? Du förstår att bra design handlar lika mycket om pixlar som om perception, kognition, och mänsklig kultur. You believe that design is about improving the life for others. Du tror på att design handlar om att förbättra andra människors vardag. You are interested in results and answers, but even more interested in questions. You are curious to the bone and you love learning. You understand that there is no prescription for designing an easy-to-use feature, but you're eager to figure it out. You believe that nothing interesting starts with knowing. It starts with not knowing — it starts with a question. Du är intresserad av resultat och svar, men kanske ännu mer intresserad av frågor. Du är genuint nyfiken och älskar lärande. Du förstår att det inte finns något färdig recept för att designa lättillgängliga produkter, men du drivs av att ta reda på hur man gör. Du tror på att inget intressant börjar med att veta. Det börjar med att inte veta — det börjar med en fråga. You are proficient in HTML, CSS, and JavaScript. And you love writing. You understand that words matters just as much as colors and spacing. Du behärskar HTML, CSS, och JavaScript. Och du gillar att skriva. Du förstår att ord spelar lika stor roll som pixlar och färger. How to Apply Sök jobbet Write an application where you tell us about yourself and describe how you could contribute in our mission to simplify education. Send your application before March 1st to karl.west@viaecole.se Skriv en ansökan där du berättar om dig själv och beskriver hur du kan hjälpa till i vår mission att förenkla utbildning. Skicka din ansökan senast 1:a mars till karl.west@viaecole.se What happens next? Vad är nästa steg? When we've reviewed the applications, you'll hear from us at the beginning or March about advancement to the design challange stage. När vi gått igenom ansökningarna, meddelar vi dig i början av mars om du gått vidare till nästa fas i processen som är ett designprov. The design challenge is an at-home assignment that will showcase your approach to design. You will redesign a web page and document your process and your thinking. Designprovet genomförs på distans. Du får i uppdrag att designa om en webbsida och dokumentera din process och hur du resonerat. The final stage in the process are a few interviews with future colleagues. Den sista fasen består av ett litet antal intervjuer med framtida kollegor. We love learning"
    },
    {
        "title": "Frontend Developer Internship",
        "description": "Frontend Developer Internship, Autumn 2021",
        "url": "/jobs/2021/autumn/frontend-developer-internship.html",
        "content": "Frontend Developer Frontendutvecklare You can no longer apply for this position. You can find all our open positions here. Den här tjänsten går inte längre att söka. Alla våra lediga tjänster finns annonserade här. Autumn 2021 Hösten 2021 Learnpoint is an integrated LMS and SIS made for teachers, students, and school managers. The Learnpoint team is on a mission to simplify education and we have an internship position open for 1-2 frontend developers during autumn 2021. Learnpoint är ett integrerat LMS och administrativt system för lärare, studenter, och skolledare. Vår mission är att förenkla utbildning och vi har en praktikplats öppen för 1-2 frontendutvecklare under hösten 2021. About the Internship Om praktiken The main task will be to design and implement an application. The first step will be to discuss and choose which application that fits based on the length of the internship, your skillset and our organizational needs. You will make a demo of the application at the end of the intership. Praktikens huvudsakliga uppdrag är att designa och implementera en applikation. Första steget är att diskutera och bestämma vilken applikation som passar utifrån praktikens längd, dina förkunskaper och verksamhetens behov, och sedan avslutas praktiken med att du presenterar applikationen. In addition to the main task, you will also participate in some meetings and workshops. Utöver det huvudsakliga uppdraget kommer du även delta i några arbetsmöten och workshops. You'll have access to a supervisor throughout the internship. Du har tillgång till en handledare under hela praktiken. The internship is 2-6 months and takes place during autumn 2021. Praktiken genomförs under hösten 2021 och är 2-6 månader. We encourage you to apply together with someone else. The task can be done by a single trainee, but two would be even better. Vi ser helst att du genomför praktiken tillsammans med en annan praktikant. Uppdraget går att genomföra individuellt, men det fungerar bättre om ni är två som genomför det. Our team don't share an office, so you will work remote. Vi har inget gemensamt kontor, så allt arbete genomförs på distans. About Us Om oss Learnpoint is part of the edtech company ViaEcole. We're a customer focused company with two products — Learnpoint and yh-antagning.se. Learnpoint är en del av edtech bolaget ViaEcole. Vi är ett kundorienterat bolag med två produkter — Learnpoint och yh-antagning.se. About You Om dig You are truly interested in frontend development, but you're also interested in users. How do they think, what's difficult for them, and what do the like? You understand that a good application is as much about code as it is about humans. Du är genuint intresserad av frontendutveckling, men du är även intresserad av användare. Hur tänker dom, vad tycker dom är svårt och vad gillar dom? Du förstår att en bra applikation handlar lika mycket om kod som om människor. You are interested in results and answers, but perhaps equally interested in questions. You are curious to the bone and you love learning. You understand that there is no simple prescription when it comes to developing good applications, and you're eager to figure out how it should be done. Du är intresserad av resultat och svar, men kanske lika intresserad av frågor. Du är genuint nyfiken och älskar lärande. Du förstår att det inte finns något färdig framgånsrecept när man skall utveckla applikationer, och du drivs av att själv ta reda på hur man ska göra. You are proficient in HTML, CSS, and JavaScript. Du behärskar HTML, CSS, och JavaScript. How to Apply Sök praktikplatsen Write an application where you tell us about yourself and your interest in education and frontend development. Attach CV and portfolio. Indicate if you apply together with another trainee. Send your application to karl.west@viaecole.se Skriv en ansökan där du beskriver dig själv och ditt intresse för utbildning och frontendutveckling. Bifoga CV och portfolio. Ange om du söker praktiken tillsammans med någon annan. Skicka din ansökan till karl.west@viaecole.se What happens next? Vad är nästa steg? When we've reviewed your application, you'll hear from us within a week about advancement to the development challange stage. När vi läst igenom din ansökan, meddelar vi dig inom en vecka om du gått vidare till nästa fas i processen som är ett utvecklingsprov. The development challenge is an at-home assignment. You will design and implement a small component and document your working process. Utvecklingsprovet genomförs på distans. Du får i uppdrag att designa och implementera en komponent samt dokumentera din process och beskriva hur du tänkt. The final stage are a few interviews. Den tredje och sista fasen består av ett par intervjuer. We love learning"
    },
    {
        "title": "Frontend Developer Internship",
        "description": "Frontend Developer Internship, Spring 2021",
        "url": "/jobs/2021/spring/frontend-developer-internship.html",
        "content": "Frontend Developer Frontendutvecklare You can no longer apply for this position. You can find all our open positions here. Den här tjänsten går inte längre att söka. Alla våra lediga tjänster finns annonserade här. Spring 2021 Våren 2021 Learnpoint is an integrated LMS and SIS made for teachers, students, and school managers. The Learnpoint team is on a mission to simplify education and we have an internship position open for 1-2 frontend developers during spring 2021. Learnpoint är ett integrerat LMS och administrativt system för lärare, studenter, och skolledare. Vår mission är att förenkla utbildning och vi har en praktikplats öppen för 1-2 frontendutvecklare under våren 2021. About the Internship Om praktiken The main task will be to design and implement an application. The first step will be to discuss and choose which application that fits based on the length of the internship, your skillset and our organizational needs. You will make a demo of the application at the end of the intership. Praktikens huvudsakliga uppdrag är att designa och implementera en applikation. Första steget är att diskutera och bestämma vilken applikation som passar utifrån praktikens längd, dina förkunskaper och verksamhetens behov, och sedan avslutas praktiken med att du presenterar applikationen. In addition to the main task, you will also participate in some meetings and workshops. Utöver det huvudsakliga uppdraget kommer du även delta i några arbetsmöten och workshops. You'll have access to a supervisor throughout the internship. Du har tillgång till en handledare under hela praktiken. The internship is 2-6 months and takes place during spring 2021. Praktiken genomförs under våren 2021 och är 2-6 månader. We encourage you to apply together with someone else. The task can be done by a single trainee, but two would be even better. Vi ser helst att du genomför praktiken tillsammans med en annan praktikant. Uppdraget går att genomföra individuellt, men det fungerar bättre om ni är två som genomför det. Our team don't share an office, so you will work remote. Vi har inget gemensamt kontor, så allt arbete genomförs på distans. About Us Om oss Learnpoint is part of the edtech company ViaEcole. We're a customer focused company with two products — Learnpoint and yh-antagning.se. Learnpoint är en del av edtech bolaget ViaEcole. Vi är ett kundorienterat bolag med två produkter — Learnpoint och yh-antagning.se. About You Om dig You are truly interested in frontend development, but you're also interested in users. How do they think, what's difficult for them, and what do the like? You understand that a good application is as much about code as it is about humans. Du är genuint intresserad av frontendutveckling, men du är även intresserad av användare. Hur tänker dom, vad tycker dom är svårt och vad gillar dom? Du förstår att en bra applikation handlar lika mycket om kod som om människor. You are interested in results and answers, but perhaps equally interested in questions. You are curious to the bone and you love learning. You understand that there is no simple prescription when it comes to developing good applications, and you're eager to figure out how it should be done. Du är intresserad av resultat och svar, men kanske lika intresserad av frågor. Du är genuint nyfiken och älskar lärande. Du förstår att det inte finns något färdig framgånsrecept när man skall utveckla applikationer, och du drivs av att själv ta reda på hur man ska göra. You are proficient in HTML, CSS, and JavaScript. Du behärskar HTML, CSS, och JavaScript. How to Apply Sök praktikplatsen Write an application where you tell us about yourself and your interest in education and frontend development. Attach CV and portfolio. Indicate if you apply together with another trainee. Send your application to karl.west@viaecole.se Skriv en ansökan där du beskriver dig själv och ditt intresse för utbildning och frontendutveckling. Bifoga CV och portfolio. Ange om du söker praktiken tillsammans med någon annan. Skicka din ansökan till karl.west@viaecole.se What happens next? Vad är nästa steg? When we've reviewed your application, you'll hear from us within a week about advancement to the development challange stage. När vi läst igenom din ansökan, meddelar vi dig inom en vecka om du gått vidare till nästa fas i processen som är ett utvecklingsprov. The development challenge is an at-home assignment. You will design and implement a small component and document your working process. Utvecklingsprovet genomförs på distans. Du får i uppdrag att designa och implementera en komponent samt dokumentera din process och beskriva hur du tänkt. The final stage are a few interviews. Den tredje och sista fasen består av ett par intervjuer. We love learning"
    },
    {
        "title": "Backend Developer Internship",
        "description": "Backend Developer Internship, Autumn 2022",
        "url": "/jobs/2022/autumn/backend-developer-internship.html",
        "content": "Backend Developer Backendutvecklare Autumn 2022 Hösten 2022 Learnpoint is an integrated LMS and SIS made for teachers, students, and school managers. The Learnpoint team is on a mission to simplify education and we have an internship position open for 1-2 backend developers during spring 2022. Learnpoint är ett integrerat LMS och administrativt system för lärare, studenter, och skolledare. Vår mission är att förenkla utbildning och vi har en praktikplats öppen för 1-2 backendutvecklare under hösten 2022. About the Internship Om praktiken The main task will be to build an application or service. The first step will be to discuss and choose which application or service that fits based on the length of the internship, your skillset and our organizational needs. You will make a demo of the application or service at the end of the intership. Praktikens huvudsakliga uppdrag är att bygga en applikation eller en service. Första steget är att diskutera och bestämma vilken applikation eller service som passar utifrån praktikens längd, dina förkunskaper och verksamhetens behov, och sedan avslutas praktiken med att du presenterar applikationen eller servicen. In addition to the main task, you will also participate in some meetings and workshops. Utöver det huvudsakliga uppdraget kommer du även delta i några arbetsmöten och workshops. You'll have access to a supervisor throughout the internship. Du har tillgång till en handledare under hela praktiken. The internship is 2-6 months and takes place during spring 2022. Praktiken genomförs under hösten 2022 och är 2-6 månader. We encourage you to apply together with someone else. The task can be done by a single trainee, but two would be even better. Vi ser helst att du genomför praktiken tillsammans med en annan praktikant. Uppdraget går att genomföra individuellt, men det fungerar bättre om ni är två som genomför det. Our team don't share an office, so you will work remote. Vi har inget gemensamt kontor, så allt arbete genomförs på distans. About Us Om oss Learnpoint is part of the edtech company ViaEcole. We're a customer focused company with two products — Learnpoint and yh-antagning.se. Learnpoint är en del av edtech bolaget ViaEcole. Vi är ett kundorienterat bolag med två produkter — Learnpoint och yh-antagning.se. About You Om dig You are truly interested in finding solutions. Both for technical problems and how to make the application faster and more reliable for the user. Du är genuint intresserad av att hitta lösningar. Både för tekniska problem och hur du ska göra en applikation snabbare och mer tillförlitlig för användarna. You are interested in results and answers, but perhaps equally interested in questions. You are curious to the bone and you love learning. You understand that there is no simple prescription when it comes to developing good applications, and you're eager to figure out how it should be done. Du är intresserad av resultat och svar, men kanske lika intresserad av frågor. Du är genuint nyfiken och älskar lärande. Du förstår att det inte finns något färdig framgånsrecept när man skall utveckla applikationer, och du drivs av att själv ta reda på hur man ska göra. You are proficient in .NET, C#, and SQL. Du behärskar .NET, C#, and SQL. How to Apply Sök praktikplatsen Write an application where you tell us about yourself and your interest in education and backend development. Attach CV and portfolio. Indicate if you apply together with another trainee. Send your application to martin.vehmas@viaecole.se Skriv en ansökan där du beskriver dig själv och ditt intresse för utbildning och backendutveckling. Bifoga CV och portfolio. Ange om du söker praktiken tillsammans med någon annan. Skicka din ansökan till martin.vehmas@viaecole.se What happens next? Vad är nästa steg? When we've reviewed your application, you'll hear from us within a week about advancement to the development challange stage. När vi läst igenom din ansökan, meddelar vi dig inom en vecka om du gått vidare till nästa fas i processen som är ett utvecklingsprov. The development challenge is an at-home assignment. You will extend an existing web application and document your working process. Utvecklingsprovet genomförs på distans. Du får i uppdrag att vidareutveckla en befintlig webbapplikation samt dokumentera din process och beskriva hur du tänkt. The final stage are a few interviews. Den tredje och sista fasen består av ett par intervjuer. We love learning"
    },
    {
        "title": "Customer Support Agent Internship",
        "description": "Customer Support Agent Internship, Autumn 2022",
        "url": "/jobs/2022/autumn/customer-support-agent-internship.html",
        "content": "Customer Support Agent Customer Support Agent You can no longer apply for this position. You can find all our open positions here. Den här tjänsten går inte längre att söka. Alla våra lediga tjänster finns annonserade här. Autumn 2022 Hösten 2022 Learnpoint is an integrated LMS and SIS made for teachers, students, and school managers. The Learnpoint team is on a mission to simplify education and we have an internship position open for a Customer Support Agent during autumn 2022. Learnpoint är ett integrerat LMS och administrativt system för lärare, studenter, och skolledare. Vår mission är att förenkla utbildning och vi har en praktikplats öppen för en Customer Support Agent under hösten 2022. About the Internship Om praktikplatsen Your main task will be to work with product support. You will be a member of our Customer Success team that is responsible for customer onboarding and product support. Towards the end of your internship you will make a presentation and a report. Ditt primära uppdrag är att arbeta med kundsupport. Du kommer vara en del av vårt Customer Success-team som ansvarar för att utbilda nya kunder och ge produktsupport. Praktiken avslutas med att du skriver en rapport och håller en presentation. You will have a supervisor that you have daily contact with throughout the whole internship. Du kommer att få en handledare som du har daglig kontakt med under hela praktiken. The internship is 2-6 months and takes place during autumn 2022. Praktiken utförs under hösten 2022 och är 2-6 månader lång. The internship is remote. Praktiken sker på distans. About Us Om oss Learnpoint is part of the edtech company ViaEcole. We are a customer focused company with two products — Learnpoint and yh-antagning.se. Learnpoint är en del av edtech bolaget ViaEcole. Vi är ett kundorienterat bolag med två produkter — Learnpoint och yh-antagning.se. About You Om dig You are interested in technology, but your passion is communicating with people. You are a positive person who is dedicated to finding solutions and helping others. We find the right attitude and motivation more important than experience. Du gillar teknik, men älskar att kommunicera med människor. Du är en positiv person som gillar att hitta lösningar och hjälpa andra. För oss är rätt inställning och motivation viktigare än erfarenhet. You have excellent verbal and written Swedish skills. Du talar och skriver utmärkt svenska. How to Apply Hur du ansöker We want you to write a letter where you introduce yourself to us and tell us why you want this internship. We appreciate honesty and passion. Skriv ett brev där du berättar om dig själv och varför du vill ha just den här praktikplatsen. Vi uppskattar engagemang och ärlighet. Tell us about: Berätta: Why you want to work in customer service/customer support. Varför du vill jobba med kundservice/kundsupport. A description of a great customer service/customer support experience you have had, and what made it great. En väldigt bra kundservice-/kundsupportupplevelse du har haft och vad som gjorde den bra. A time you taught yourself a new skill. När du lärde dig något nytt. Send your application to martin.tholsby@viaecole.se Skicka din ansöka till martin.tholsby@viaecole.se What happens next? Vad är nästa steg? When we have reviewed your application, you will hear from us within a week about advancement to the next stage which is a written assignment. The final stage includes interviews with members of our Customer Success team. När vi läst igenom din ansökan, meddelar vi dig inom en vecka om du har gått vidare till nästa steg i processen som är en skriftlig uppgift. Sista steget är att bli intervjuad av medlemmar i vårt Customer Success-team. We love learning"
    },
    {
        "title": "Backend Developer Internship",
        "description": "Backend Developer Internship, Spring 2022",
        "url": "/jobs/2022/spring/backend-developer-internship.html",
        "content": "Backend Developer Backendutvecklare You can no longer apply for this position. You can find all our open positions here. Den här tjänsten går inte längre att söka. Alla våra lediga tjänster finns annonserade här. Spring 2022 Våren 2022 Learnpoint is an integrated LMS and SIS made for teachers, students, and school managers. The Learnpoint team is on a mission to simplify education and we have an internship position open for 1-2 backend developers during spring 2022. Learnpoint är ett integrerat LMS och administrativt system för lärare, studenter, och skolledare. Vår mission är att förenkla utbildning och vi har en praktikplats öppen för 1-2 backendutvecklare under våren 2022. About the Internship Om praktiken The main task will be to build an application or service. The first step will be to discuss and choose which application or service that fits based on the length of the internship, your skillset and our organizational needs. You will make a demo of the application or service at the end of the intership. Praktikens huvudsakliga uppdrag är att bygga en applikation eller en service. Första steget är att diskutera och bestämma vilken applikation eller service som passar utifrån praktikens längd, dina förkunskaper och verksamhetens behov, och sedan avslutas praktiken med att du presenterar applikationen eller servicen. In addition to the main task, you will also participate in some meetings and workshops. Utöver det huvudsakliga uppdraget kommer du även delta i några arbetsmöten och workshops. You'll have access to a supervisor throughout the internship. Du har tillgång till en handledare under hela praktiken. The internship is 2-6 months and takes place during spring 2022. Praktiken genomförs under våren 2022 och är 2-6 månader. We encourage you to apply together with someone else. The task can be done by a single trainee, but two would be even better. Vi ser helst att du genomför praktiken tillsammans med en annan praktikant. Uppdraget går att genomföra individuellt, men det fungerar bättre om ni är två som genomför det. Our team don't share an office, so you will work remote. Vi har inget gemensamt kontor, så allt arbete genomförs på distans. About Us Om oss Learnpoint is part of the edtech company ViaEcole. We're a customer focused company with two products — Learnpoint and yh-antagning.se. Learnpoint är en del av edtech bolaget ViaEcole. Vi är ett kundorienterat bolag med två produkter — Learnpoint och yh-antagning.se. About You Om dig You are truly interested in finding solutions. Both for technical problems and how to make the application faster and more reliable for the user. Du är genuint intresserad av att hitta lösningar. Både för tekniska problem och hur du ska göra en applikation snabbare och mer tillförlitlig för användarna. You are interested in results and answers, but perhaps equally interested in questions. You are curious to the bone and you love learning. You understand that there is no simple prescription when it comes to developing good applications, and you're eager to figure out how it should be done. Du är intresserad av resultat och svar, men kanske lika intresserad av frågor. Du är genuint nyfiken och älskar lärande. Du förstår att det inte finns något färdig framgånsrecept när man skall utveckla applikationer, och du drivs av att själv ta reda på hur man ska göra. You are proficient in .NET, C#, and SQL. Du behärskar .NET, C#, and SQL. How to Apply Sök praktikplatsen Write an application where you tell us about yourself and your interest in education and backend development. Attach CV and portfolio. Indicate if you apply together with another trainee. Send your application to martin.vehmas@viaecole.se Skriv en ansökan där du beskriver dig själv och ditt intresse för utbildning och backendutveckling. Bifoga CV och portfolio. Ange om du söker praktiken tillsammans med någon annan. Skicka din ansökan till martin.vehmas@viaecole.se What happens next? Vad är nästa steg? When we've reviewed your application, you'll hear from us within a week about advancement to the development challange stage. När vi läst igenom din ansökan, meddelar vi dig inom en vecka om du gått vidare till nästa fas i processen som är ett utvecklingsprov. The development challenge is an at-home assignment. You will extend an existing web application and document your working process. Utvecklingsprovet genomförs på distans. Du får i uppdrag att vidareutveckla en befintlig webbapplikation samt dokumentera din process och beskriva hur du tänkt. The final stage are a few interviews. Den tredje och sista fasen består av ett par intervjuer. We love learning"
    },
    {
        "title": "Frontend Developer Internship",
        "description": "Frontend Developer Internship, Spring 2022",
        "url": "/jobs/2022/spring/frontend-developer-internship.html",
        "content": "Frontend Developer Frontendutvecklare You can no longer apply for this position. You can find all our open positions here. Den här tjänsten går inte längre att söka. Alla våra lediga tjänster finns annonserade här. Spring 2022 Våren 2022 Learnpoint is an integrated LMS and SIS made for teachers, students, and school managers. The Learnpoint team is on a mission to simplify education and we have internship positions open for frontend developers during spring 2022. Learnpoint är ett integrerat LMS och administrativt system för lärare, studenter, och skolledare. Vår mission är att förenkla utbildning och vi har praktikplatser öppna för frontendutvecklare under våren 2022. About the Internship Om praktiken The main task will be to design and implement an application. The first step is to discuss and decide which application to build, based on the length of the internship, your skillset and our organizational needs. You will make a demo at the end of the intership. Praktikens primära uppdrag är designa och implementera en applikation. Första steget blir att diskutera och bestämma vilken applikation som skall utvecklas, utifrån praktikens längd, dina förkunskaper och verksamhetens behov. Praktiken avslutas med en presentation. In addition to the main task, you'll also participate in a few meetings and workshops. Utöver det primära uppdraget kommer du även delta i några arbetsmöten och workshops. You'll have access to a supervisor throughout the whole internship. You'll meet with the supervisor at least once every week. Du har tillgång till en handledare under hela praktiken. Ni träffas minst en gång per vecka. The internship is 2-6 months and takes place during spring 2022. Praktiken utförs under våren 2022 och är 2-6 månader. The internship is a team effort. You should apply together with at least one other intern. Praktiken är ett teamarbete. Du skall söka praktikplatsen tillsammans med en eller flera andra praktikanter. The internship is remote. Praktiken sker på distans. About Us Om oss Learnpoint is part of the edtech company ViaEcole. We're a customer focused company with two products — Learnpoint and yh-antagning.se. Learnpoint är en del av edtech bolaget ViaEcole. Vi är ett kundorienterat bolag med två produkter — Learnpoint och yh-antagning.se. About You Om dig You are truly interested in frontend development, but you're also interested in users. How do they think, what's difficult for them, and what do they like? You understand that a usable application is as much about code as it is about humans. Du är genuint intresserad av frontendutveckling, men du är också intresserad av slutanvändare. Hur tänker dom, vad tycker dom är svårt och vad gillar dom? Du förstår att en användarvänlig applikation handlar lika mycket om kod som om människor. You want to achieve results, but you're also interested in questions. You are curious, you love learning, and you understand there's no simple prescription for designing user friendly applications. Du vill uppnå resultat, men du är också intresserad av frågor. Du är nyfiken, älskar lärande och förstår att det inte finns något färdig recept för att designa användarvänliga applikationer. You are proficient in HTML, CSS, and JavaScript. Du behärskar HTML, CSS, och JavaScript. How to Apply Sök praktikplatsen Write an application where you tell us about yourself and your interest in education, learning, and frontend development. Attach CV and portfolio. Make sure to mention the other interns you are applying with. Send your application to karl.west@viaecole.se Skriv en ansökan där du beskriver dig själv och ditt intresse för utbildning, lärande och frontendutveckling. Bifoga CV och portfolio. Ange vem eller vilka du söker tillsammans med. Skicka din ansökan till karl.west@viaecole.se What happens next? Vad är nästa steg? When we've reviewed your application, you'll hear from us within a week about advancement to an interview. När vi läst igenom din ansökan, meddelar vi dig inom en vecka om du gått vidare till intervju. During the interview you'll tell us more about yourself and your interest in education, learning and frontend development. We'll explain the internship in detail and at the end of the interview we'll agree upon how to move forward together. Under intervjun får du berätta mer om dig själv och ditt intresse för utbildning, lärande och frontendutveckling. Vi beskriver praktiken lite mer detaljerat och i slutet av intervjun kommer vi överens om hur vi går vidare tillsammans. We love learning"
    },
    {
        "title": "Work with us",
        "description": "You want join our mission to simplify the future of education? View our available positions here!",
        "url": "/jobs/index.html",
        "content": "Work with us Lediga tjänster Backend Developer Backend Developer Internship 2-6 months, Autumn 2022 Remote Praktik 2-6 månader, Hösten 2022 Distans"
    },
    {
        "title": "Breadcrumb shortcuts",
        "description": "Breadcrumb shortcuts. Genvägar i brödsmulorna.",
        "url": "/news/2021-11/breadcrumb-shortcuts.html",
        "content": "Breadcrumb shortcuts Genvägar i brödsmulorna Nov 22, 2021 22 nov 2021 • Karl W The breadcrumbs in Learnpoint now have shortcuts. The shortcuts makes it possible to navigate directly from one student grade to another, without having to visit the grading list. Brödsmulorna i Learnpoint har fått genvägar. Genvägarna gör att du navigera direkt från ett studentbetyg till ett annat, utan att behöva ta omvägen via listan med studentbetyg. Du slipper klicka fram och tillbaka. Here's how the shortcuts look like: Såhär ser genvägarna ut: Which pages have shortcuts? Vilka sidor har genvägar? Shortcuts are enabled on internship pages and student grade pages (both course and course item pages). The double-arrow icon in the breadcrumbs indicate that shortcuts are available. Genvägar finns på LIA-platser och studentbetyg (för både kurser och kursdelar). Den dubbelriktade pilen i brödsmulorna indikerar att genvägar finns tillgängliga. View all news → Visa alla nyheter → We love learning"
    },
    {
        "title": "Group code in title field",
        "description": "Group code in title field. Gruppkod i titelfältet",
        "url": "/news/2022-06/group-code-in-title-field.html",
        "content": "Group code in title field Gruppkod i titelfältet Jun 10, 2022 10 jun 2022 • Karl W The title field now contains the group code and the group type. If you're a member of several groups with the same name, it's now easier to see which group you've navigated to. Titelfältet innehåller nu både gruppkoden och grupptypen. Är du medlem i flera grupper med samma namn blir det lättare att se vilken grupp du har navigerat till. Here's how the group code and group type is displayed in the title field: Såhär visas gruppkoden och grupptypen i titelfältet: View all news → Visa alla nyheter → We love learning"
    },
    {
        "title": "New feature: Notifications",
        "description": "New feature: Notifications. Ny funktion: Aviseringar",
        "url": "/news/2022-09/notifications.html",
        "content": "New feature: Notifications Ny funktion: Aviseringar Sep 12, 2022 12 sep 2022 • Karl W On the evening of September 14, Learnpoint will be updated with a new feature: Notifications. The current news start page will be replaced with a notification page that contains everything new and relevant that've happened since you last signed in. På kvällen den 14 sep uppdateras Learnpoint med en ny funktion: Aviseringar. Startsidan med nyheter ersätts med en aviseringssida som visar allt nytt och relevant som hänt sedan du senast loggade in. Here's how the notification page will look like: Såhär kommer den nya aviseringssidan se ut: Where will the news go? Vart tar nyheterna vägen? You'll find the news on the start page, but now as notifications. One difference is that you'll be able to see which news are new and which news you've already seen. Nyheterna finns kvar på startsidan, men nu i form av aviseringar. En skillnad blir att du kan se vilka nyheter som är lästa och vilka som är nya. What will Learnpoint notifiy about? Vad kommer Learnpoint avisera om? Learnpoint will notify about news, comments, surveys, logbooks and internships. Each type has its own icon to make them clearly distinguishable. Learnpoint kommer avisera om nyheter, kommentarer, enkäter, loggböcker och LIA-platser. Varje aviseringstyp har en egen ikon så att du lätt skall se skillnad på dom. To get notifications from a specific group, you have to be a member of that group. If you're an administrator or a manager for a program, you might have access to several courses without being a member. To get notifications from these courses, you have to add yourself as a member to those groups. För att få aviseringar från en viss grupp måste du vara medlem i gruppen. Om du är administratör eller utbildningsledare för en utbildning, så kan du ha behörighet till flera kurser utan att vara medlem på kurserna. Vill du få aviseringar från dessa kurser behöver du lägga till dig själv som medlem. Email notifications Mejlaviseringar You'll be able recieve notifications by email. Du kan välja att få aviseringar via mejl. If you don't use Learnpoint very often, email notifications will let you stay up to date without having to sign in. If you end up getting too many emails, you can turn them off at any time. Om du inte använder Learnpoint så ofta, kan meljaviseringar vara ett praktiskt sätt att hänga med på vad som händer utan att behöva logga in. Blir det för mycket mejl kan du stänga av mejlaviseringarna när som helst. Reminders Påminnelser Notifications for surveys, internships and logbooks, will have built-in reminders. Aviseringar för enkäter, LIA-platser och loggböcker kommer få en påminnelse-funktion. If a survey isn't completed, Learnpoint will send a reminder. The reminder is repeated once per week until the survey is completed. Same goes for internships — reminders are sent until the internship is approved. Om en enkät inte besvarats så skickar Learnpoint en påminnelse. Påminnelsen upprepas en gång per vecka tills enkäten är besvarad. Samma sak för LIA-platser — Learnpoint skickar påminnelser tills LIA-platsen har godkänts. Reminders for surveys and internship don't need to be configured, they're automatically sent by Learnpoint. Reminders for logbooks are configured manually just like before. Påminnelser för enkäter och LIA-platser behöver inte konfigureras, dom sköts automatiskt av Learnpoint. Påminnelserna för loggböcker konfigureras manuellt precis som tidigare. View all news → Visa alla nyheter → We love learning"
    },
    {
        "title": "Learnpoint News",
        "description": "Learnpoint News, Learnpoint Nyheter",
        "url": "/news/index.html",
        "content": "News Nyheter On this page you'll find product announcements and updates. To get notified by email, subscribe to our newsletter. Här publiceras produktnyheter och uppdateringar. Vill du få nyheterna skickad till din mejl kan du prenumerera på vårt nyhetsbrev. New feature: Notifications Ny funktion: Aviseringar Sep 12, 2022 12 sep 2022 Group code in title field Gruppkod i titelfältet Jun 10, 2022 10 jun 2022 Breadcrumb shortcuts Genvägar i brödsmulorna Nov 22, 2021 22 nov 2021"
    },
    {
        "title": "",
        "description": "",
        "url": "/news/unsubscribed/index.html",
        "content": ""
    },
    {
        "title": "Sign In",
        "description": "Sign In to Learnpoint",
        "url": "/sign-in.html",
        "content": "Sign in Logga in Enter the Learnpoint address for your school. Skriv in Learnpoint-adressen till din skola. Couldn't find the school. Check the address. Hittade inte skolan. Kontrollera adressen. Enter the Learnpoint address Ange Learnpoint-adressen school-name Continue Fortsätt Trouble signing in? We'd be happy to help. Problem att logga in? Vi hjälper gärna till. Previous sign ins Tidigare inloggningar"
    }
]